#pragma once
// Borderlands 2 (1.8.5) SDK

#ifdef _MSC_VER
#pragma pack(push, 0x4)
#endif

#include "stdafx.h"

//---------------------------------------------------------------------------
//Constants
//---------------------------------------------------------------------------

#define CONST_TRACEFLAG_SkipMovers                               4
#define CONST_COVERLINK_EdgeExposureDot                          0.85f
#define CONST_RB_None                                            0x00
#define CONST_TRACEFLAG_LightProjectile                          8192
#define CONST_USE_FAILURE_LEVEL                                  0
#define CONST_SCENEFILTER_None                                   0x00000000
#define CONST_REP_RBLOCATION_ERROR_TOLERANCE_SQ                  16.0f
#define CONST_TRACEFLAG_Projectiles                              65536
#define CONST_MINFLOORZ                                          0.7
#define CONST_ACTORMAXSTEPHEIGHT                                 35.0
#define CONST_RBSTATE_LINVELSCALE                                10.0
#define CONST_GAMEEVENT_TEAM_MATCH_WON                           4
#define CONST_RBSTATE_ANGVELSCALE                                1000.0
#define CONST_GAMEEVENT_GAME_OPTION_URL                          7
#define CONST_TRACEFLAG_Blocking                                 8
#define CONST_RB_NeedsUpdate                                     0x01
#define CONST_GAMEEVENT_NETWORKUSAGEOUT_POLL                     38

//	SFT_CenteredOnPlayer           = 1,
//	SFT_Friends                    = 2,
//	SFT_TopRankings                = 3,
//	SFT_MAX                        = 4
//};


// Enum Engine.WillowInventory.PlayerMark
//enum class EPlayerMark : uint8_t
//{
//	PM_Trash                       = 0,
//	PM_Standard                    = 1,
//	PM_Favorite                    = 2,
//	PM_MAX                         = 3
//};


// Enum Engine.WillowInventoryDefinition.EStatCombinationMethod
//enum class EStatCombinationMethod : uint8_t
//{
//	SCM_Multiply                   = 0,
//	SCM_Divide                     = 1,
//	SCM_Add                        = 2,
//	SCM_Subtract                   = 3,
//	SCM_DontCombine                = 4,
//	SCM_MAX                        = 5
//};


// Enum Engine.WillowInventoryDefinition.EAttributeSlotEffectMode
//enum class EAttributeSlotEffectMode : uint8_t
//{
//	ATTRSLOTEFFECTMODE_Default     = 0,
//	ATTRSLOTEFFECTMODE_Timed       = 1,
//	ATTRSLOTEFFECTMODE_Custom      = 2,
//	ATTRSLOTEFFECTMODE_MAX         = 3
//};


// Enum Engine.WillowInventoryDefinition.ECurrencyType
//enum class ECurrencyType : uint8_t
//{
//	CURRENCY_Credits               = 0,
//	CURRENCY_Eridium               = 1,
//	CURRENCY_SeraphCrystals        = 2,
//	CURRENCY_Reserved_A            = 3,
//	CURRENCY_Reserved_B            = 4,
//	CURRENCY_Reserved_C            = 5,
//	CURRENCY_Reserved_D            = 6,
//	CURRENCY_Reserved_E            = 7,
//	CURRENCY_Reserved_F            = 8,
//	CURRENCY_Reserved_G            = 9,
//	CURRENCY_Reserved_H            = 10,
//	CURRENCY_Reserved_I            = 11,
//	CURRENCY_Reserved_J            = 12,
//	CURRENCY_MAX                   = 13
//};


// Enum Engine.WillowInventoryDefinition.EPlayerDroppability
//enum class EPlayerDroppability : uint8_t
//{
//	EPD_Droppable                  = 0,
//	EPD_Sellable                   = 1,
//	EPD_CannotDropOrSell           = 2,
//	EPD_MAX                        = 3
//};


// Enum Engine.WillowInventory.SerialNumberState
//enum class ESerialNumberState : uint8_t
//{
//	SNS_Empty                      = 0,
//	SNS_Writing                    = 1,
//	SNS_Full                       = 2,
//	SNS_Reading                    = 3,
//	SNS_Encrypted                  = 4,
//	SNS_MAX                        = 5
//};


// Enum Engine.WillowInventory.EncryptedSerial
//enum class EncryptedSerial : uint8_t
//{
//	ES_Encrypted                   = 0,
//	ES_MAX                         = 1
//};


// Enum Engine.Weapon.EWeaponFireType
//enum class EWeaponFireType : uint8_t
//{
//	EWFT_InstantHit                = 0,
//	EWFT_Projectile                = 1,
//	EWFT_Beam                      = 2,
//	EWFT_Custom                    = 3,
//	EWFT_None                      = 4,
//	EWFT_MAX                       = 5
//};



//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// ScriptStruct Engine.AkEvent.AkPlayingInfo
// 0x0008
struct FAkPlayingInfo
{
	class UAkComponent*                                SourceComponent;                                          // 0x0000(0x0004) (ExportObject, Component, EditInline)
	int                                                AkPlayingId;                                              // 0x0004(0x0004)
};

// ScriptStruct Engine.Actor.ResourcePoolReference
// 0x000C
struct FResourcePoolReference
{
	class AResourcePoolManager*                        PoolManager;                                              // 0x0000(0x0004)
	unsigned char                                      PoolIndexInManager;                                       // 0x0004(0x0001)
	unsigned char                                      PoolGUID;                                                 // 0x0005(0x0001)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0006(0x0002) MISSED OFFSET
	class UResourcePool*                               Data;                                                     // 0x0008(0x0004)
};

// ScriptStruct Engine.Actor.RigidBodyContactInfo
// 0x003C
struct FRigidBodyContactInfo
{
	struct FVector                                     ContactPosition;                                          // 0x0000(0x000C)
	struct FVector                                     ContactNormal;                                            // 0x000C(0x000C)
	float                                              ContactPenetration;                                       // 0x0018(0x0004)
	struct FVector                                     ContactVelocity[0x2];                                     // 0x001C(0x000C)
	class UPhysicalMaterial*                           PhysMaterial[0x2];                                        // 0x0034(0x0004)
};

// ScriptStruct Engine.Actor.CollisionImpactData
// 0x0024
struct FCollisionImpactData
{
	TArray<struct FRigidBodyContactInfo>               ContactInfos;                                             // 0x0000(0x000C) (NeedCtorLink)
	struct FVector                                     TotalNormalForceVector;                                   // 0x000C(0x000C)
	struct FVector                                     TotalFrictionForceVector;                                 // 0x0018(0x000C)
};

// ScriptStruct Engine.Actor.TraceHitInfo
// 0x001C
struct FTraceHitInfo
{
	class UMaterial*                                   Material;                                                 // 0x0000(0x0004) (AlwaysInit)
	class UPhysicalMaterial*                           PhysMaterial;                                             // 0x0004(0x0004) (AlwaysInit)
	int                                                Item;                                                     // 0x0008(0x0004) (AlwaysInit)
	int                                                LevelIndex;                                               // 0x000C(0x0004) (AlwaysInit)
	struct FName                                       BoneName;                                                 // 0x0010(0x0008) (AlwaysInit)
	class UPrimitiveComponent*                         HitComponent;                                             // 0x0018(0x0004) (ExportObject, Component, AlwaysInit, EditInline)
};

// ScriptStruct Engine.Actor.ImpactInfo
// 0x005C
struct FImpactInfo
{
	class AActor*                                      HitActor;                                                 // 0x0000(0x0004) (AlwaysInit)
	struct FVector                                     HitLocation;                                              // 0x0004(0x000C) (AlwaysInit)
	struct FVector                                     HitNormal;                                                // 0x0010(0x000C) (AlwaysInit)
	struct FVector                                     RayDir;                                                   // 0x001C(0x000C) (AlwaysInit)
	struct FVector                                     StartTrace;                                               // 0x0028(0x000C) (AlwaysInit)
	struct FTraceHitInfo                               HitInfo;                                                  // 0x0034(0x001C) (Component, AlwaysInit)
	struct FVector                                     EndTrace;                                                 // 0x0050(0x000C) (AlwaysInit)
};

// ScriptStruct Engine.Actor.BasedPosition
// 0x0034
struct FBasedPosition
{
	class AActor*                                      Base;                                                     // 0x0000(0x0004) (Edit)
	struct FVector                                     Position;                                                 // 0x0004(0x000C) (Edit)
	struct FVector                                     CachedBaseLocation;                                       // 0x0010(0x000C)
	struct FRotator                                    CachedBaseRotation;                                       // 0x001C(0x000C)
	struct FVector                                     CachedTransPosition;                                      // 0x0028(0x000C)
};

// ScriptStruct Engine.Actor.TimerData
// 0x001C
struct FTimerData
{
	unsigned long                                      bLoop : 1;                                                // 0x0000(0x0004)
	unsigned long                                      bPaused : 1;                                              // 0x0000(0x0004)
	struct FName                                       FuncName;                                                 // 0x0004(0x0008)
	float                                              Rate;                                                     // 0x000C(0x0004)
	float                                              Count;                                                    // 0x0010(0x0004)
	float                                              TimerTimeDilation;                                        // 0x0014(0x0004)
	class UObject*                                     TimerObj;                                                 // 0x0018(0x0004)
};

// ScriptStruct Engine.WorldInfo.WorldFractureSettings
// 0x001C
struct FWorldFractureSettings
{
	float                                              ChanceOfPhysicsChunkOverride;                             // 0x0000(0x0004)
	unsigned long                                      bEnableChanceOfPhysicsChunkOverride : 1;                  // 0x0004(0x0004)
	unsigned long                                      bLimitExplosionChunkSize : 1;                             // 0x0004(0x0004)
	float                                              MaxExplosionChunkSize;                                    // 0x0008(0x0004)
	unsigned long                                      bLimitDamageChunkSize : 1;                                // 0x000C(0x0004)
	float                                              MaxDamageChunkSize;                                       // 0x0010(0x0004)
	int                                                MaxNumFacturedChunksToSpawnInAFrame;                      // 0x0014(0x0004)
	float                                              FractureExplosionVelScale;                                // 0x0018(0x0004)
};

// ScriptStruct Engine.Brush.GeomSelection
// 0x000C
struct FGeomSelection
{
	int                                                Type;                                                     // 0x0000(0x0004)
	int                                                Index;                                                    // 0x0004(0x0004)
	int                                                SelectionIndex;                                           // 0x0008(0x0004)
};

// ScriptStruct Engine.PostProcessVolume.LUTBlender
// 0x001C
struct FLUTBlender
{
	TArray<class UTexture*>                            LUTTextures;                                              // 0x0000(0x000C) (NeedCtorLink)
	TArray<float>                                      LUTWeights;                                               // 0x000C(0x000C) (NeedCtorLink)
	unsigned long                                      bHasChanged : 1;                                          // 0x0018(0x0004) (Const, Native, Transient)
};

// ScriptStruct Engine.PostProcessVolume.PostProcessSettings
// 0x00E8
struct FPostProcessSettings
{
	unsigned long                                      bOverride_EnableBloom : 1;                                // 0x0000(0x0004)
	unsigned long                                      bOverride_EnableDOF : 1;                                  // 0x0000(0x0004)
	unsigned long                                      bOverride_EnableMotionBlur : 1;                           // 0x0000(0x0004)
	unsigned long                                      bOverride_EnableSceneEffect : 1;                          // 0x0000(0x0004)
	unsigned long                                      bOverride_AllowAmbientOcclusion : 1;                      // 0x0000(0x0004)
	unsigned long                                      bOverride_OverrideRimShaderColor : 1;                     // 0x0000(0x0004)
	unsigned long                                      bOverride_Bloom_Scale : 1;                                // 0x0000(0x0004)
	unsigned long                                      bOverride_Bloom_Threshold : 1;                            // 0x0000(0x0004)
	unsigned long                                      bOverride_Bloom_Tint : 1;                                 // 0x0000(0x0004)
	unsigned long                                      bOverride_Bloom_ScreenBlendThreshold : 1;                 // 0x0000(0x0004)
	unsigned long                                      bOverride_Bloom_InterpolationDuration : 1;                // 0x0000(0x0004)
	unsigned long                                      bOverride_DOF_FalloffExponent : 1;                        // 0x0000(0x0004)
	unsigned long                                      bOverride_DOF_BlurKernelSize : 1;                         // 0x0000(0x0004)
	unsigned long                                      bOverride_DOF_BlurBloomKernelSize : 1;                    // 0x0000(0x0004)
	unsigned long                                      bOverride_DOF_MaxNearBlurAmount : 1;                      // 0x0000(0x0004)
	unsigned long                                      bOverride_DOF_MinBlurAmount : 1;                          // 0x0000(0x0004)
	unsigned long                                      bOverride_DOF_MaxFarBlurAmount : 1;                       // 0x0000(0x0004)
	unsigned long                                      bOverride_DOF_FocusType : 1;                              // 0x0000(0x0004)
	unsigned long                                      bOverride_DOF_FocusInnerRadius : 1;                       // 0x0000(0x0004)
	unsigned long                                      bOverride_DOF_FocusDistance : 1;                          // 0x0000(0x0004)
	unsigned long                                      bOverride_DOF_FocusPosition : 1;                          // 0x0000(0x0004)
	unsigned long                                      bOverride_DOF_TunnelVisionScale : 1;                      // 0x0000(0x0004)
	unsigned long                                      bOverride_DOF_TunnelVisionYOffset : 1;                    // 0x0000(0x0004)
	unsigned long                                      bOverride_DOF_InterpolationDuration : 1;                  // 0x0000(0x0004)
	unsigned long                                      bOverride_DOF_BokehTexture : 1;                           // 0x0000(0x0004)
	unsigned long                                      bOverride_MotionBlur_MaxVelocity : 1;                     // 0x0000(0x0004)
	unsigned long                                      bOverride_MotionBlur_Amount : 1;                          // 0x0000(0x0004)
	unsigned long                                      bOverride_MotionBlur_FullMotionBlur : 1;                  // 0x0000(0x0004)
	unsigned long                                      bOverride_MotionBlur_CameraRotationThreshold : 1;         // 0x0000(0x0004)
	unsigned long                                      bOverride_MotionBlur_CameraTranslationThreshold : 1;      // 0x0000(0x0004)
	unsigned long                                      bOverride_MotionBlur_InterpolationDuration : 1;           // 0x0000(0x0004)
	unsigned long                                      bOverride_Scene_Desaturation : 1;                         // 0x0000(0x0004)
	unsigned long                                      bOverride_Scene_Colorize : 1;                             // 0x0004(0x0004)
	unsigned long                                      bOverride_Scene_TonemapperScale : 1;                      // 0x0004(0x0004)
	unsigned long                                      bOverride_Scene_ImageGrainScale : 1;                      // 0x0004(0x0004)
	unsigned long                                      bOverride_Scene_HighLights : 1;                           // 0x0004(0x0004)
	unsigned long                                      bOverride_Scene_MidTones : 1;                             // 0x0004(0x0004)
	unsigned long                                      bOverride_Scene_Shadows : 1;                              // 0x0004(0x0004)
	unsigned long                                      bOverride_Scene_InterpolationDuration : 1;                // 0x0004(0x0004)
	unsigned long                                      bOverride_Scene_ColorGradingLUT : 1;                      // 0x0004(0x0004)
	unsigned long                                      bOverride_RimShader_Color : 1;                            // 0x0004(0x0004)
	unsigned long                                      bOverride_RimShader_InterpolationDuration : 1;            // 0x0004(0x0004)
	unsigned long                                      bEnableBloom : 1;                                         // 0x0004(0x0004) (Edit)
	unsigned long                                      bEnableDOF : 1;                                           // 0x0004(0x0004) (Edit)
	unsigned long                                      bTwoLayerSimpleDepthOfField : 1;                          // 0x0004(0x0004)
	unsigned long                                      bEnableMotionBlur : 1;                                    // 0x0004(0x0004) (Edit)
	unsigned long                                      bEnableSceneEffect : 1;                                   // 0x0004(0x0004) (Edit)
	unsigned long                                      bAllowAmbientOcclusion : 1;                               // 0x0004(0x0004) (Edit)
	unsigned long                                      bOverrideRimShaderColor : 1;                              // 0x0004(0x0004) (Edit)
	float                                              Bloom_Scale;                                              // 0x0008(0x0004) (Edit, Interp)
	float                                              Bloom_Threshold;                                          // 0x000C(0x0004) (Edit, Interp)
	struct FColor                                      Bloom_Tint;                                               // 0x0010(0x0004) (Edit, Interp)
	float                                              Bloom_ScreenBlendThreshold;                               // 0x0014(0x0004) (Edit, Interp)
	float                                              Bloom_InterpolationDuration;                              // 0x0018(0x0004) (Edit)
	float                                              DOF_BlurBloomKernelSize;                                  // 0x001C(0x0004) (Edit, Interp)
	float                                              DOF_FalloffExponent;                                      // 0x0020(0x0004) (Edit, Interp)
	float                                              DOF_BlurKernelSize;                                       // 0x0024(0x0004) (Edit, Interp)
	float                                              DOF_MaxNearBlurAmount;                                    // 0x0028(0x0004) (Edit, Interp)
	float                                              DOF_MinBlurAmount;                                        // 0x002C(0x0004) (Edit, Interp)
	float                                              DOF_MaxFarBlurAmount;                                     // 0x0030(0x0004) (Edit, Interp)
	unsigned char                                      DOF_FocusType;                                            // 0x0034(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0035(0x0003) MISSED OFFSET
	float                                              DOF_FocusInnerRadius;                                     // 0x0038(0x0004) (Edit, Interp)
	float                                              DOF_FocusDistance;                                        // 0x003C(0x0004) (Edit, Interp)
	struct FVector                                     DOF_FocusPosition;                                        // 0x0040(0x000C) (Edit)
	float                                              DOF_TunnelVisionScale;                                    // 0x004C(0x0004) (Edit, Interp)
	float                                              DOF_TunnelVisionYOffset;                                  // 0x0050(0x0004) (Edit, Interp)
	float                                              DOF_InterpolationDuration;                                // 0x0054(0x0004) (Edit)
	class UTexture2D*                                  DOF_BokehTexture;                                         // 0x0058(0x0004) (Edit)
	float                                              MotionBlur_MaxVelocity;                                   // 0x005C(0x0004) (Edit, Interp)
	float                                              MotionBlur_Amount;                                        // 0x0060(0x0004) (Edit, Interp)
	unsigned long                                      MotionBlur_FullMotionBlur : 1;                            // 0x0064(0x0004) (Edit)
	float                                              MotionBlur_CameraRotationThreshold;                       // 0x0068(0x0004) (Edit, Interp)
	float                                              MotionBlur_CameraTranslationThreshold;                    // 0x006C(0x0004) (Edit, Interp)
	float                                              MotionBlur_InterpolationDuration;                         // 0x0070(0x0004) (Edit)
	float                                              Scene_Desaturation;                                       // 0x0074(0x0004) (Edit, Interp)
	struct FVector                                     Scene_Colorize;                                           // 0x0078(0x000C) (Edit, Interp)
	float                                              Scene_TonemapperScale;                                    // 0x0084(0x0004) (Edit, Interp)
	float                                              Scene_ImageGrainScale;                                    // 0x0088(0x0004) (Edit, Interp)
	struct FVector                                     Scene_HighLights;                                         // 0x008C(0x000C) (Edit, Interp)
	struct FVector                                     Scene_MidTones;                                           // 0x0098(0x000C) (Edit, Interp)
	struct FVector                                     Scene_Shadows;                                            // 0x00A4(0x000C) (Edit, Interp)
	float                                              Scene_InterpolationDuration;                              // 0x00B0(0x0004) (Edit)
	struct FLinearColor                                RimShader_Color;                                          // 0x00B4(0x0010) (Edit)
	float                                              RimShader_InterpolationDuration;                          // 0x00C4(0x0004) (Edit)
	class UTexture*                                    ColorGrading_LookupTable;                                 // 0x00C8(0x0004) (Edit)
	struct FLUTBlender                                 ColorGradingLUT;                                          // 0x00CC(0x001C) (Const, Transient, NeedCtorLink)
};

// ScriptStruct Engine.ReverbVolume.InteriorSettings
// 0x0024
struct FInteriorSettings
{
	unsigned long                                      bIsWorldInfo : 1;                                         // 0x0000(0x0004)
	float                                              ExteriorVolume;                                           // 0x0004(0x0004) (Edit)
	float                                              ExteriorTime;                                             // 0x0008(0x0004) (Edit)
	float                                              ExteriorLPF;                                              // 0x000C(0x0004) (Edit)
	float                                              ExteriorLPFTime;                                          // 0x0010(0x0004) (Edit)
	float                                              InteriorVolume;                                           // 0x0014(0x0004) (Edit)
	float                                              InteriorTime;                                             // 0x0018(0x0004) (Edit)
	float                                              InteriorLPF;                                              // 0x001C(0x0004) (Edit)
	float                                              InteriorLPFTime;                                          // 0x0020(0x0004) (Edit)
};

// ScriptStruct Engine.ReverbVolume.ReverbSettings
// 0x001C
struct FReverbSettings
{
	unsigned long                                      bApplyReverb : 1;                                         // 0x0000(0x0004) (Edit)
	unsigned char                                      ReverbType;                                               // 0x0004(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0005(0x0003) MISSED OFFSET
	float                                              Volume;                                                   // 0x0008(0x0004) (Edit)
	float                                              FadeTime;                                                 // 0x000C(0x0004) (Edit)
	float                                              ReflectionsDelayOverride;                                 // 0x0010(0x0004) (Edit)
	float                                              LateDelayOverride;                                        // 0x0014(0x0004) (Edit)
	float                                              DecayHighFrequencyRatioOverride;                          // 0x0018(0x0004) (Edit)
};

// ScriptStruct Engine.WorldInfo.NetViewer
// 0x0020
struct FNetViewer
{
	class APlayerController*                           InViewer;                                                 // 0x0000(0x0004)
	class AActor*                                      Viewer;                                                   // 0x0004(0x0004)
	struct FVector                                     ViewLocation;                                             // 0x0008(0x000C)
	struct FVector                                     ViewDir;                                                  // 0x0014(0x000C)
};

// ScriptStruct Engine.WorldInfo.PhysXSimulationProperties
// 0x000C
struct FPhysXSimulationProperties
{
	unsigned long                                      bUseHardware : 1;                                         // 0x0000(0x0004) (Edit)
	unsigned long                                      bFixedTimeStep : 1;                                       // 0x0000(0x0004) (Edit)
	float                                              TimeStep;                                                 // 0x0004(0x0004) (Edit)
	int                                                MaxSubSteps;                                              // 0x0008(0x0004) (Edit)
};

// ScriptStruct Engine.WorldInfo.PhysXSceneProperties
// 0x003C
struct FPhysXSceneProperties
{
	struct FPhysXSimulationProperties                  PrimaryScene;                                             // 0x0000(0x000C) (Edit, EditInline)
	struct FPhysXSimulationProperties                  CompartmentRigidBody;                                     // 0x000C(0x000C) (Edit, EditInline)
	struct FPhysXSimulationProperties                  CompartmentFluid;                                         // 0x0018(0x000C) (Edit, EditInline)
	struct FPhysXSimulationProperties                  CompartmentCloth;                                         // 0x0024(0x000C) (Edit, EditInline)
	struct FPhysXSimulationProperties                  CompartmentSoftBody;                                      // 0x0030(0x000C) (Edit, EditInline)
};

// ScriptStruct Engine.WorldInfo.CompartmentRunList
// 0x0004
struct FCompartmentRunList
{
	unsigned long                                      RigidBody : 1;                                            // 0x0000(0x0004) (Edit)
	unsigned long                                      Fluid : 1;                                                // 0x0000(0x0004) (Edit)
	unsigned long                                      Cloth : 1;                                                // 0x0000(0x0004) (Edit)
	unsigned long                                      SoftBody : 1;                                             // 0x0000(0x0004) (Edit)
};

// ScriptStruct Engine.WorldInfo.ApexModuleDestructibleSettings
// 0x0010
struct FApexModuleDestructibleSettings
{
	int                                                MaxChunkIslandCount;                                      // 0x0000(0x0004) (Edit)
	int                                                MaxRrbActorCount;                                         // 0x0004(0x0004)
	float                                              MaxChunkSeparationLOD;                                    // 0x0008(0x0004) (Edit)
	unsigned long                                      bOverrideMaxChunkSeparationLOD : 1;                       // 0x000C(0x0004) (Edit)
};

// ScriptStruct Engine.WorldInfo.PhysXEmitterVerticalProperties
// 0x0018
struct FPhysXEmitterVerticalProperties
{
	unsigned long                                      bDisableLod : 1;                                          // 0x0000(0x0004) (Edit)
	int                                                ParticlesLodMin;                                          // 0x0004(0x0004) (Edit)
	int                                                ParticlesLodMax;                                          // 0x0008(0x0004) (Edit)
	int                                                PacketsPerPhysXParticleSystemMax;                         // 0x000C(0x0004) (Edit)
	unsigned long                                      bApplyCylindricalPacketCulling : 1;                       // 0x0010(0x0004) (Edit)
	float                                              SpawnLodVsFifoBias;                                       // 0x0014(0x0004) (Edit)
};

// ScriptStruct Engine.WorldInfo.PhysXVerticalProperties
// 0x0018
struct FPhysXVerticalProperties
{
	struct FPhysXEmitterVerticalProperties             Emitters;                                                 // 0x0000(0x0018) (Edit, EditInline)
};

// ScriptStruct Engine.WorldInfo.ScreenMessageString
// 0x0020
struct FScreenMessageString
{
	struct FQWord                                      Key;                                                      // 0x0000(0x0008) (Transient, AlwaysInit)
	struct FString                                     ScreenMessage;                                            // 0x0008(0x000C) (Transient, AlwaysInit, NeedCtorLink)
	struct FColor                                      DisplayColor;                                             // 0x0014(0x0004) (Transient, AlwaysInit)
	float                                              TimeToDisplay;                                            // 0x0018(0x0004) (Transient, AlwaysInit)
	float                                              CurrentTimeDisplayed;                                     // 0x001C(0x0004) (Transient, AlwaysInit)
};

// ScriptStruct Engine.WorldInfo.LightmassWorldInfoSettings
// 0x003C
struct FLightmassWorldInfoSettings
{
	float                                              StaticLightingLevelScale;                                 // 0x0000(0x0004) (Edit)
	int                                                NumIndirectLightingBounces;                               // 0x0004(0x0004) (Edit)
	struct FColor                                      EnvironmentColor;                                         // 0x0008(0x0004) (Edit)
	float                                              EnvironmentIntensity;                                     // 0x000C(0x0004) (Edit)
	float                                              EmissiveBoost;                                            // 0x0010(0x0004) (Edit)
	float                                              DiffuseBoost;                                             // 0x0014(0x0004) (Edit)
	float                                              SpecularBoost;                                            // 0x0018(0x0004)
	float                                              IndirectNormalInfluenceBoost;                             // 0x001C(0x0004) (Edit)
	unsigned long                                      bUseAmbientOcclusion : 1;                                 // 0x0020(0x0004) (Edit)
	float                                              DirectIlluminationOcclusionFraction;                      // 0x0024(0x0004) (Edit)
	float                                              IndirectIlluminationOcclusionFraction;                    // 0x0028(0x0004) (Edit)
	float                                              OcclusionExponent;                                        // 0x002C(0x0004) (Edit)
	float                                              FullyOccludedSamplesFraction;                             // 0x0030(0x0004) (Edit)
	float                                              MaxOcclusionDistance;                                     // 0x0034(0x0004) (Edit)
	unsigned long                                      bVisualizeMaterialDiffuse : 1;                            // 0x0038(0x0004) (Edit)
	unsigned long                                      bVisualizeAmbientOcclusion : 1;                           // 0x0038(0x0004) (Edit)
	unsigned long                                      bCompressShadowmap : 1;                                   // 0x0038(0x0004) (Edit)
};

// ScriptStruct Engine.WorldInfo.HostMigrationState
// 0x001C
struct FHostMigrationState
{
	unsigned char                                      HostMigrationProgress;                                    // 0x0000(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	float                                              HostMigrationElapsedTime;                                 // 0x0004(0x0004)
	float                                              HostMigrationTravelCountdown;                             // 0x0008(0x0004)
	struct FString                                     HostMigrationTravelURL;                                   // 0x000C(0x000C) (NeedCtorLink)
	unsigned long                                      bHostMigrationEnabled : 1;                                // 0x0018(0x0004)
};

// ScriptStruct Engine.WorldInfo.NavigationArea
// 0x000C
struct FNavigationArea
{
	struct FName                                       AreaName;                                                 // 0x0000(0x0008) (Edit, Const)
	struct FColor                                      AreaColor;                                                // 0x0008(0x0004) (Edit, Const)
};

// ScriptStruct Engine.OnlineSubsystem.UniqueNetId
// 0x0018
struct FUniqueNetId
{
	struct FQWord                                      Uid;                                                      // 0x0000(0x0008)
	unsigned char                                      NpId[0x10];                                               // 0x0008(0x0001)
};

// ScriptStruct Engine.OnlineSubsystem.NamedInterface
// 0x000C
struct FNamedInterface
{
	struct FName                                       InterfaceName;                                            // 0x0000(0x0008)
	class UObject*                                     InterfaceObject;                                          // 0x0008(0x0004)
};

// ScriptStruct Engine.OnlineSubsystem.NamedInterfaceDef
// 0x0014
struct FNamedInterfaceDef
{
	struct FName                                       InterfaceName;                                            // 0x0000(0x0008)
	struct FString                                     InterfaceClassName;                                       // 0x0008(0x000C) (NeedCtorLink)
};

// ScriptStruct Engine.OnlineSubsystem.OnlineRegistrant
// 0x0018
struct FOnlineRegistrant
{
	struct FUniqueNetId                                PlayerNetId;                                              // 0x0000(0x0018) (Const)
};

// ScriptStruct Engine.OnlineSubsystem.OnlineArbitrationRegistrant
// 0x000C (0x0018 - 0x0024)
struct FOnlineArbitrationRegistrant : public FOnlineRegistrant
{
	struct FQWord                                      MachineId;                                                // 0x0018(0x0008) (Const)
	int                                                Trustworthiness;                                          // 0x0020(0x0004) (Const)
};

// ScriptStruct Engine.OnlineSubsystem.NamedSession
// 0x0028
struct FNamedSession
{
	struct FName                                       SessionName;                                              // 0x0000(0x0008)
	struct FPointer                                    SessionInfo;                                              // 0x0008(0x0004) (Const, Native, Transient)
	class UOnlineGameSettings*                         GameSettings;                                             // 0x000C(0x0004)
	TArray<struct FOnlineRegistrant>                   Registrants;                                              // 0x0010(0x000C) (NeedCtorLink)
	TArray<struct FOnlineArbitrationRegistrant>        ArbitrationRegistrants;                                   // 0x001C(0x000C) (NeedCtorLink)
};

// ScriptStruct Engine.OnlineSubsystem.AppIdLicenseInfo
// 0x0008
struct FAppIdLicenseInfo
{
	int                                                AppID;                                                    // 0x0000(0x0004)
	int                                                LicenseMask;                                              // 0x0004(0x0004)
};

// ScriptStruct Engine.OnlineSubsystem.TOCInfo
// 0x0024
struct FTOCInfo
{
	struct FString                                     TOC;                                                      // 0x0000(0x000C) (NeedCtorLink)
	struct FString                                     RootPath;                                                 // 0x000C(0x000C) (NeedCtorLink)
	struct FString                                     Path;                                                     // 0x0018(0x000C) (NeedCtorLink)
};

// ScriptStruct Engine.OnlineSubsystem.OnlineContent
// 0x007C
struct FOnlineContent
{
	unsigned char                                      ContentType;                                              // 0x0000(0x0001)
	unsigned char                                      UserIndex;                                                // 0x0001(0x0001)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0002(0x0002) MISSED OFFSET
	unsigned long                                      bIsCorrupt : 1;                                           // 0x0004(0x0004)
	int                                                DeviceID;                                                 // 0x0008(0x0004)
	int                                                LicenseMask;                                              // 0x000C(0x0004)
	struct FString                                     FriendlyName;                                             // 0x0010(0x000C) (NeedCtorLink)
	struct FString                                     Filename;                                                 // 0x001C(0x000C) (NeedCtorLink)
	struct FString                                     ContentPath;                                              // 0x0028(0x000C) (NeedCtorLink)
	TArray<struct FString>                             ContentPackages;                                          // 0x0034(0x000C) (NeedCtorLink)
	TArray<struct FString>                             ContentFiles;                                             // 0x0040(0x000C) (NeedCtorLink)
	TArray<struct FAppIdLicenseInfo>                   CachedAppIdInfo;                                          // 0x004C(0x000C) (NeedCtorLink)
	struct FTOCInfo                                    TOCInfo;                                                  // 0x0058(0x0024) (NeedCtorLink)
};

// ScriptStruct Engine.OnlineSubsystem.OnlineContentNameInfo
// 0x0020
struct FOnlineContentNameInfo
{
	struct FString                                     ContentName;                                              // 0x0000(0x000C) (NeedCtorLink)
	int                                                EngineVersion;                                            // 0x000C(0x0004)
	struct FGuid                                       CookedVersionID;                                          // 0x0010(0x0010)
};

// ScriptStruct Engine.OnlineSubsystem.NamedOnlineContent
// 0x0021 (0x007C - 0x009D)
struct FNamedOnlineContent : public FOnlineContent
{
	struct FOnlineContentNameInfo                      NameInfo;                                                 // 0x007C(0x0020) (NeedCtorLink)
	unsigned char                                      NamedContentType;                                         // 0x009C(0x0001)
};

// ScriptStruct Engine.OnlineSubsystem.CompatibilityOnlineContent
// 0x00B0
struct FCompatibilityOnlineContent
{
	int                                                VersionNumber;                                            // 0x0000(0x0004)
	struct FNamedOnlineContent                         Container;                                                // 0x0004(0x00A0) (NeedCtorLink)
	TArray<struct FNamedOnlineContent>                 Content;                                                  // 0x00A4(0x000C) (NeedCtorLink)
};

// ScriptStruct Engine.DownloadableContentOfferEnumerator.MarketplaceOffer
// 0x002C
struct FMarketplaceOffer
{
	int                                                OfferId;                                                  // 0x0000(0x0004)
	int                                                ContentCategory;                                          // 0x0004(0x0004)
	struct FString                                     OfferName;                                                // 0x0008(0x000C) (NeedCtorLink)
	TArray<unsigned char>                              ContentId;                                                // 0x0014(0x000C) (NeedCtorLink)
	unsigned long                                      bIsUnrestrictedLicense : 1;                               // 0x0020(0x0004)
	int                                                LicenseMask;                                              // 0x0024(0x0004)
	unsigned long                                      bUserHasPurchased : 1;                                    // 0x0028(0x0004)
};

// ScriptStruct Engine.DownloadableContentManager.MarketplaceOfferDownloadState
// 0x0004
struct FMarketplaceOfferDownloadState
{
	unsigned long                                      bIsDownloaded : 1;                                        // 0x0000(0x0004)
	unsigned long                                      bIsInstalled : 1;                                         // 0x0000(0x0004)
};

// ScriptStruct Engine.OnlineSubsystem.MarketplaceContent
// 0x0080
struct FMarketplaceContent
{
	int                                                UserIndex;                                                // 0x0000(0x0004)
	int                                                OfferId;                                                  // 0x0004(0x0004)
	int                                                PreviewOfferId;                                           // 0x0008(0x0004)
	struct FString                                     OfferName;                                                // 0x000C(0x000C) (NeedCtorLink)
	int                                                OfferType;                                                // 0x0018(0x0004)
	TArray<unsigned char>                              ContentId;                                                // 0x001C(0x000C) (NeedCtorLink)
	unsigned long                                      bIsUnrestrictedLicense : 1;                               // 0x0028(0x0004)
	int                                                LicenseMask;                                              // 0x002C(0x0004)
	int                                                TitleId;                                                  // 0x0030(0x0004)
	int                                                ContentCategory;                                          // 0x0034(0x0004)
	struct FString                                     TitleName;                                                // 0x0038(0x000C) (NeedCtorLink)
	unsigned long                                      bUserHasPurchased : 1;                                    // 0x0044(0x0004)
	int                                                PackageSize;                                              // 0x0048(0x0004)
	int                                                InstallSize;                                              // 0x004C(0x0004)
	struct FString                                     SellText;                                                 // 0x0050(0x000C) (NeedCtorLink)
	int                                                AssetId;                                                  // 0x005C(0x0004)
	int                                                PurchaseQuantity;                                         // 0x0060(0x0004)
	int                                                PointsPrice;                                              // 0x0064(0x0004)
	struct FString                                     PriceText;                                                // 0x0068(0x000C) (NeedCtorLink)
	struct FString                                     OfferIdText;                                              // 0x0074(0x000C) (NeedCtorLink)
};

// ScriptStruct Engine.DownloadableContentManager.InstalledContentInfo
// 0x0040
struct FInstalledContentInfo
{
	unsigned char                                      ContentType;                                              // 0x0000(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	struct FString                                     ContentName;                                              // 0x0004(0x000C) (NeedCtorLink)
	struct FString                                     ContentPath;                                              // 0x0010(0x000C) (NeedCtorLink)
	struct FString                                     Filename;                                                 // 0x001C(0x000C) (NeedCtorLink)
	int                                                DeviceID;                                                 // 0x0028(0x0004)
	int                                                LicenseMask;                                              // 0x002C(0x0004)
	unsigned long                                      bHasSeen : 1;                                             // 0x0030(0x0004)
	TArray<struct FAppIdLicenseInfo>                   CachedAppIdInfo;                                          // 0x0034(0x000C) (NeedCtorLink)
};

// ScriptStruct Engine.DownloadableContentManager.RejectedContentInfo
// 0x0001 (0x0040 - 0x0041)
struct FRejectedContentInfo : public FInstalledContentInfo
{
	unsigned char                                      Result;                                                   // 0x0040(0x0001)
};

// ScriptStruct Engine.Engine.StatColorMapEntry
// 0x0008
struct FStatColorMapEntry
{
	float                                              In;                                                       // 0x0000(0x0004) (Config, GlobalConfig)
	struct FColor                                      Out;                                                      // 0x0004(0x0004) (Config, GlobalConfig)
};

// ScriptStruct Engine.Engine.StatColorMapping
// 0x001C
struct FStatColorMapping
{
	struct FString                                     StatName;                                                 // 0x0000(0x000C) (Config, GlobalConfig, NeedCtorLink)
	TArray<struct FStatColorMapEntry>                  ColorMap;                                                 // 0x000C(0x000C) (Config, GlobalConfig, NeedCtorLink)
	unsigned long                                      DisableBlend : 1;                                         // 0x0018(0x0004) (Config, GlobalConfig)
};

// ScriptStruct Engine.Engine.DropNoteInfo
// 0x0024
struct FDropNoteInfo
{
	struct FVector                                     Location;                                                 // 0x0000(0x000C)
	struct FRotator                                    Rotation;                                                 // 0x000C(0x000C)
	struct FString                                     Comment;                                                  // 0x0018(0x000C) (NeedCtorLink)
};

// ScriptStruct Engine.GameEngine.URL
// 0x0044
struct FURL
{
	struct FString                                     Protocol;                                                 // 0x0000(0x000C) (AlwaysInit, NeedCtorLink)
	struct FString                                     Host;                                                     // 0x000C(0x000C) (AlwaysInit, NeedCtorLink)
	int                                                Port;                                                     // 0x0018(0x0004) (AlwaysInit)
	struct FString                                     Map;                                                      // 0x001C(0x000C) (AlwaysInit, NeedCtorLink)
	TArray<struct FString>                             Op;                                                       // 0x0028(0x000C) (AlwaysInit, NeedCtorLink)
	struct FString                                     Portal;                                                   // 0x0034(0x000C) (AlwaysInit, NeedCtorLink)
	int                                                Valid;                                                    // 0x0040(0x0004) (AlwaysInit)
};

// ScriptStruct Engine.GameEngine.LevelStreamingStatus
// 0x000C
struct FLevelStreamingStatus
{
	struct FName                                       PackageName;                                              // 0x0000(0x0008)
	unsigned long                                      bShouldBeLoaded : 1;                                      // 0x0008(0x0004)
	unsigned long                                      bShouldBeVisible : 1;                                     // 0x0008(0x0004)
};

// ScriptStruct Engine.GameEngine.FullyLoadedPackagesInfo
// 0x0028
struct FFullyLoadedPackagesInfo
{
	unsigned char                                      FullyLoadType;                                            // 0x0000(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	struct FString                                     Tag;                                                      // 0x0004(0x000C) (NeedCtorLink)
	TArray<struct FName>                               PackagesToLoad;                                           // 0x0010(0x000C) (NeedCtorLink)
	TArray<class UObject*>                             LoadedObjects;                                            // 0x001C(0x000C) (NeedCtorLink)
};

// ScriptStruct Engine.GameEngine.NamedNetDriver
// 0x000C
struct FNamedNetDriver
{
	struct FName                                       NetDriverName;                                            // 0x0000(0x0008)
	struct FPointer                                    NetDriver;                                                // 0x0008(0x0004) (Const, Native)
};

// ScriptStruct Engine.GameEngine.AnimTag
// 0x0018
struct FAnimTag
{
	struct FString                                     Tag;                                                      // 0x0000(0x000C) (NeedCtorLink)
	TArray<struct FString>                             Contains;                                                 // 0x000C(0x000C) (NeedCtorLink)
};

// ScriptStruct Engine.DynamicBlockingVolume.CheckpointRecord
// 0x001C
struct ADynamicBlockingVolume_FCheckpointRecord
{
	struct FVector                                     Location;                                                 // 0x0000(0x000C)
	struct FRotator                                    Rotation;                                                 // 0x000C(0x000C)
	unsigned long                                      bCollideActors : 1;                                       // 0x0018(0x0004)
	unsigned long                                      bBlockActors : 1;                                         // 0x0018(0x0004)
	unsigned long                                      bNeedsReplication : 1;                                    // 0x0018(0x0004)
};

// ScriptStruct Engine.CullDistanceVolume.CullDistanceSizePair
// 0x0008
struct FCullDistanceSizePair
{
	float                                              Size;                                                     // 0x0000(0x0004) (Edit)
	float                                              CullDistance;                                             // 0x0004(0x0004) (Edit)
};

// ScriptStruct Engine.KMeshProps.KSphereElem
// 0x0048
struct FKSphereElem
{
	struct FMatrix                                     TM;                                                       // 0x0000(0x0040) (Edit, EditConst)
	float                                              Radius;                                                   // 0x0040(0x0004) (Edit, EditConst)
	unsigned long                                      bNoRBCollision : 1;                                       // 0x0044(0x0004) (Edit)
	unsigned long                                      bPerPolyShape : 1;                                        // 0x0044(0x0004) (Edit)
};

// ScriptStruct Engine.KMeshProps.KBoxElem
// 0x0050
struct FKBoxElem
{
	struct FMatrix                                     TM;                                                       // 0x0000(0x0040) (Edit, EditConst)
	float                                              X;                                                        // 0x0040(0x0004) (Edit, EditConst)
	float                                              Y;                                                        // 0x0044(0x0004) (Edit, EditConst)
	float                                              Z;                                                        // 0x0048(0x0004) (Edit, EditConst)
	unsigned long                                      bNoRBCollision : 1;                                       // 0x004C(0x0004) (Edit)
	unsigned long                                      bPerPolyShape : 1;                                        // 0x004C(0x0004) (Edit)
};

// ScriptStruct Engine.KMeshProps.KSphylElem
// 0x004C
struct FKSphylElem
{
	struct FMatrix                                     TM;                                                       // 0x0000(0x0040) (Edit, EditConst)
	float                                              Radius;                                                   // 0x0040(0x0004) (Edit, EditConst)
	float                                              Length;                                                   // 0x0044(0x0004) (Edit, EditConst)
	unsigned long                                      bNoRBCollision : 1;                                       // 0x0048(0x0004) (Edit)
	unsigned long                                      bPerPolyShape : 1;                                        // 0x0048(0x0004) (Edit)
};

// ScriptStruct Engine.KMeshProps.KAggregateGeom
// 0x0038
struct FKAggregateGeom
{
	TArray<struct FKSphereElem>                        SphereElems;                                              // 0x0000(0x000C) (Edit, EditFixedSize, NeedCtorLink)
	TArray<struct FKBoxElem>                           BoxElems;                                                 // 0x000C(0x000C) (Edit, EditFixedSize, NeedCtorLink)
	TArray<struct FKSphylElem>                         SphylElems;                                               // 0x0018(0x000C) (Edit, EditFixedSize, NeedCtorLink)
	TArray<struct FKConvexElem>                        ConvexElems;                                              // 0x0024(0x000C) (Edit, EditFixedSize, NeedCtorLink)
	struct FPointer                                    RenderInfo;                                               // 0x0030(0x0004) (Native, NoImport, NonTransactional)
	unsigned long                                      bSkipCloseAndParallelChecks : 1;                          // 0x0034(0x0004) (Edit)
};

// ScriptStruct Engine.KMeshProps.KConvexElem
// 0x0064
struct FKConvexElem
{
	TArray<struct FVector>                             VertexData;                                               // 0x0000(0x000C) (NeedCtorLink)
	TArray<struct FPlane>                              PermutedVertexData;                                       // 0x000C(0x000C) (NeedCtorLink)
	TArray<int>                                        FaceTriData;                                              // 0x0018(0x000C) (NeedCtorLink)
	TArray<struct FVector>                             EdgeDirections;                                           // 0x0024(0x000C) (NeedCtorLink)
	TArray<struct FVector>                             FaceNormalDirections;                                     // 0x0030(0x000C) (NeedCtorLink)
	TArray<struct FPlane>                              FacePlaneData;                                            // 0x003C(0x000C) (NeedCtorLink)
	struct FBox                                        ElemBox;                                                  // 0x0048(0x001C)
};

// ScriptStruct Engine.LevelStreamingVolume.CheckpointRecord
// 0x0004
struct ALevelStreamingVolume_FCheckpointRecord
{
	unsigned long                                      bDisabled : 1;                                            // 0x0000(0x0004)
};

// ScriptStruct Engine.PhysicsVolume.CheckpointRecord
// 0x0004
struct APhysicsVolume_FCheckpointRecord
{
	unsigned long                                      bPainCausing : 1;                                         // 0x0000(0x0004)
	unsigned long                                      bActive : 1;                                              // 0x0000(0x0004)
};

// ScriptStruct Engine.ShadowRelevanceVolume.ShadowRelevanceSizePair
// 0x0006
struct FShadowRelevanceSizePair
{
	float                                              Size;                                                     // 0x0000(0x0004) (Edit)
	unsigned char                                      DynamicShadowCastRelevance;                               // 0x0004(0x0001) (Edit, Const)
	unsigned char                                      OverrideStaticShadowSettings;                             // 0x0005(0x0001) (Edit, Const)
};

// ScriptStruct Engine.InterpActor.CheckpointRecord
// 0x0020
struct AInterpActor_FCheckpointRecord
{
