#pragma once
// Borderlands 2 (1.8.5) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x4)
#endif

#include "stdafx.h"

//---------------------------------------------------------------------------
//Constants
//---------------------------------------------------------------------------

#define CONST_FrontendGFxMovie_WPS_PushToTalk                    125
#define CONST_OptionsGFxMovie_WPS_VehicleSteering                146
#define CONST_WillowProfileSettings_WPS_CustomUnlocks_DLC35      335
#define CONST_WillowOnlineGameSearch_WPS_CustomUnlocks_LAST      350
#define CONST_MAIN_GAME_SKU_ID                                   0
#define CONST_MAX_MISSION_SUB_OBJECTIVE_SETS                     4
#define CONST_OptionsGFxMovie_PROPERTY_DLC_MAP_CONTENT_ID        0x1000000D
#define CONST_WillowProfileSettings_WPS_CustomUnlocks_DLC40      340
#define CONST_DAMAGEFLAG_CriticalHit                             1
#define CONST_MAX_ACTIVE_DYNAMIC_ICONS                           18
#define CONST_FrontendGFxMovie_WPS_Brightness                    112
#define CONST_LANServerBrowserGFxMovie_WPS_CustomUnlocks_DLC36   336
#define CONST_DAMAGEFLAG_Healing                                 2
#define CONST_WillowOnlineGameSettings_WPS_HUDScaleE             120
#define CONST_WillowProfileSettings_WPS_CustomUnlocks_DLC08      308
#define CONST_CONNECTION_QUALTIY_GOOD                            "two"
#define CONST_WillowProfileSettings_WPS_CustomUnlocks_DLC31      331

//enum class ENetworkActorChannelSortStyle : uint8_t
//{
//	NETACTORSORT_ActorNameAToZ     = 0,
//	NETACTORSORT_ActornameZToA     = 1,
//	NETACTORSORT_CountHighToLow    = 2,
//	NETACTORSORT_CountLowToHigh    = 3,
//	NETACTORSORT_MAX               = 4
//};


// Enum WillowGame.WillowUIInteraction.EGearBuilderSortMode
//enum class EGearBuilderSortMode : uint8_t
//{
//	GBSM_None                      = 0,
//	GBSM_WeightHighToLow           = 1,
//	GBSM_WeightLowToHigh           = 2,
//	GBSM_Invalid                   = 3,
//	GBSM_MAX                       = 4
//};


// Enum WillowGame.WillowVehicleBase.SightOriginOption
//enum class ESightOriginOption : uint8_t
//{
//	SIGHTORIGIN_LocationPlusOffset = 0,
//	SIGHTORIGIN_Socket             = 1,
//	SIGHTORIGIN_MAX                = 2
//};


// Enum WillowGame.WillowVehicleControlDefinition.EVehCamera
//enum class EVehCamera : uint8_t
//{
//	EVC_Free                       = 0,
//	EVC_Constrained                = 1,
//	EVC_FollowsSteering            = 2,
//	EVC_MAX                        = 3
//};


// Enum WillowGame.WillowVehicleControlDefinition.EVehSteering
//enum class EVehSteering : uint8_t
//{
//	EVS_VehicleRelative            = 0,
//	EVS_CameraRelative             = 1,
//	EVS_FollowsCamera              = 2,
//	EVS_MAX                        = 3
//};


// Enum WillowGame.WillowVehicle.EVehicleDeathStatus
//enum class EVehicleDeathStatus : uint8_t
//{
//	VEHDEATH_Alive                 = 0,
//	VEHDEATH_Instant               = 1,
//	VEHDEATH_Explode               = 2,
//	VEHDEATH_DeRez                 = 3,
//	VEHDEATH_MAX                   = 4
//};


// Enum WillowGame.WillowVehicle.EVehicleFOVState
//enum class EVehicleFOVState : uint8_t
//{
//	VEHICLE_FOV_Default            = 0,
//	VEHICLE_FOV_AfterburnerOn      = 1,
//	VEHICLE_FOV_AfterburnerOff     = 2,
//	VEHICLE_FOV_MAX                = 3
//};


// Enum WillowGame.WillowVehicle_Tank.TankSensorType
//enum class ETankSensorType : uint8_t
//{
//	TST_Front                      = 0,
//	TST_Right                      = 1,
//	TST_Left                       = 2,
//	TST_Back                       = 3,
//	TST_MAX                        = 4
//};


// Enum WillowGame.WillowVersusDuelGlobals.EDuelMsg
//enum class EDuelMsg : uint8_t
//{
//	DMSG_DUELINGDISABLED           = 0,
//	DMSG_ALREADYDUELING            = 1,
//	DMSG_ALREADYCHALLENGED         = 2,
//	DMSG_DUELTIMEOUT               = 3,
//	DMSG_ISSUEDCHALLENGE           = 4,
//	DMSG_RECEIVEDCHALLENGE         = 5,
//	DMSG_ACCEPTEDCHALLENGE         = 6,
//	DMSG_DUELSTART                 = 7,
//	DMSG_ARENAWARNING              = 8,
//	DMSG_DUELDRAW                  = 9,
//	DMSG_DUELWIN                   = 10,
//	DMSG_NOTRIGHTNOW               = 11,
//	DMSG_MAX                       = 12
//};



//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// ScriptStruct WillowGame.ActionSkill.ActionSkillCustomEventReplicationData
// 0x000C
struct FActionSkillCustomEventReplicationData
{
	unsigned char                                      EventCountForReplication;                                 // 0x0000(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	struct FName                                       EventName;                                                // 0x0004(0x0008)
};

// ScriptStruct WillowGame.IUpdatePostProcessOverride.MaterialEffectModifier
// 0x001C
struct FMaterialEffectModifier
{
	struct FName                                       EffectName;                                               // 0x0000(0x0008) (Edit)
	TArray<struct FAttributeScalarParam>               ScalarParams;                                             // 0x0008(0x000C) (Edit, NeedCtorLink)
	float                                              CachedValue;                                              // 0x0014(0x0004) (Edit)
	class UMaterialInstanceConstant*                   MaterialInstance;                                         // 0x0018(0x0004)
};

// ScriptStruct WillowGame.IUpdatePostProcessOverride.DOFEffectModifierData
// 0x000C
struct FDOFEffectModifierData
{
	unsigned long                                      AutoRelcalculateFocusDistance : 1;                        // 0x0000(0x0004) (Edit)
	float                                              RecalculateFocusDistanceRate;                             // 0x0004(0x0004) (Edit)
	float                                              FocusDistanceLerpRate;                                    // 0x0008(0x0004) (Edit)
};

// ScriptStruct WillowGame.IUpdatePostProcessOverride.PostProcessChainOptions
// 0x0018
struct FPostProcessChainOptions
{
	TArray<struct FMaterialEffectModifier>             MaterialEffectModifiers;                                  // 0x0000(0x000C) (Edit, NeedCtorLink)
	struct FDOFEffectModifierData                      DOFEffectModifier;                                        // 0x000C(0x000C) (Edit)
};

// ScriptStruct WillowGame.IUpdatePostProcessOverride.PostProcessOverlay
// 0x010C
struct FPostProcessOverlay
{
	struct FName                                       OverlayName;                                              // 0x0000(0x0008) (Edit, Const)
	struct FPostProcessSettings                        DestPostProcessOverlay;                                   // 0x0008(0x00E8) (Edit, Const, NeedCtorLink)
	float                                              MinTransitionInDuration;                                  // 0x00F0(0x0004) (Edit, Const)
	float                                              MinTransitionHoldDuration;                                // 0x00F4(0x0004) (Edit, Const)
	float                                              MinTransitionOutDuration;                                 // 0x00F8(0x0004) (Edit, Const)
	float                                              MaxTransitionInDuration;                                  // 0x00FC(0x0004) (Edit, Const)
	float                                              MaxTransitionHoldDuration;                                // 0x0100(0x0004) (Edit, Const)
	float                                              MaxTransitionOutDuration;                                 // 0x0104(0x0004) (Edit, Const)
	unsigned long                                      ClearOverlayQueueAfterTransition : 1;                     // 0x0108(0x0004) (Edit, Const)
};

// ScriptStruct WillowGame.IUpdatePostProcessOverride.AttributeDefinitionDefault
// 0x0008
struct FAttributeDefinitionDefault
{
	class UAttributeDefinition*                        Attribute;                                                // 0x0000(0x0004) (Edit)
	float                                              DefaultValue;                                             // 0x0004(0x0004) (Edit)
};

// ScriptStruct WillowGame.IUpdatePostProcessOverride.AttributeScalarParam
// 0x003C
struct FAttributeScalarParam
{
	struct FName                                       ParamName;                                                // 0x0000(0x0008) (Edit)
	unsigned long                                      bVectorParam : 1;                                         // 0x0008(0x0004) (Edit)
	unsigned long                                      bClampInput : 1;                                          // 0x0008(0x0004) (Edit)
	struct FAttributeDefinitionDefault                 Input;                                                    // 0x000C(0x0008) (Edit)
	struct FAttributeDefinitionDefault                 MinInput;                                                 // 0x0014(0x0008) (Edit)
	struct FAttributeDefinitionDefault                 MaxInput;                                                 // 0x001C(0x0008) (Edit)
	struct FAttributeDefinitionDefault                 MinOutput;                                                // 0x0024(0x0008) (Edit)
	struct FAttributeDefinitionDefault                 MaxOutput;                                                // 0x002C(0x0008) (Edit)
	unsigned char                                      ScalarParamOperand;                                       // 0x0034(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0035(0x0003) MISSED OFFSET
	float                                              CurrentValue;                                             // 0x0038(0x0004)
};

// ScriptStruct WillowGame.IScreenParticle.ScreenParticleModifier
// 0x0010
struct FScreenParticleModifier
{
	TArray<struct FAttributeScalarParam>               ScalarParams;                                             // 0x0000(0x000C) (Edit, NeedCtorLink)
	float                                              CachedValue;                                              // 0x000C(0x0004) (Edit)
};

// ScriptStruct WillowGame.IScreenParticle.ScreenParticleScalarParamOverTime
// 0x0018
struct FScreenParticleScalarParamOverTime
{
	struct FName                                       ParameterName;                                            // 0x0000(0x0008) (Edit)
	float                                              TotalTime;                                                // 0x0008(0x0004) (Edit)
	float                                              StartValue;                                               // 0x000C(0x0004) (Edit)
	float                                              EndValue;                                                 // 0x0010(0x0004) (Edit)
	float                                              LastValue;                                                // 0x0014(0x0004) (Transient)
};

// ScriptStruct WillowGame.IScreenParticle.ScreenParticleVectorParamOverTime
// 0x0030
struct FScreenParticleVectorParamOverTime
{
	struct FName                                       ParameterName;                                            // 0x0000(0x0008) (Edit)
	float                                              TotalTime;                                                // 0x0008(0x0004) (Edit)
	struct FVector                                     VectorStartValue;                                         // 0x000C(0x000C) (Edit)
	struct FVector                                     VectorEndValue;                                           // 0x0018(0x000C) (Edit)
	struct FVector                                     LastValue;                                                // 0x0024(0x000C) (Transient)
};

// ScriptStruct WillowGame.IScreenParticle.ScreenParticleParamOverTime
// 0x0018
struct FScreenParticleParamOverTime
{
	TArray<struct FScreenParticleScalarParamOverTime>  ScalarParams;                                             // 0x0000(0x000C) (Edit, NeedCtorLink)
	TArray<struct FScreenParticleVectorParamOverTime>  VectorParams;                                             // 0x000C(0x000C) (Edit, NeedCtorLink)
};

// ScriptStruct WillowGame.IScreenParticle.ScreenParticleInitParams
// 0x0054
struct FScreenParticleInitParams
{
	class UParticleSystem*                             Template;                                                 // 0x0000(0x0004) (Edit)
	TArray<struct FScreenParticleModifier>             ScreenParticleModifiers;                                  // 0x0004(0x000C) (Edit, NeedCtorLink)
	class UMaterialInterface*                          TemplateScreenParticleMaterial;                           // 0x0010(0x0004) (Edit)
	struct FName                                       MatParamName;                                             // 0x0014(0x0008) (Edit)
	unsigned long                                      bHideWhenFinished : 1;                                    // 0x001C(0x0004) (Edit)
	struct FName                                       ParticleTag;                                              // 0x0020(0x0008) (Edit)
	struct FVector2D                                   ContentDims;                                              // 0x0028(0x0008) (Edit)
	float                                              ParticleDepth;                                            // 0x0030(0x0004) (Edit)
	unsigned char                                      ScalingMode;                                              // 0x0034(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0035(0x0003) MISSED OFFSET
	struct FScreenParticleParamOverTime                StopParamsOT;                                             // 0x0038(0x0018) (Edit, NeedCtorLink)
	unsigned long                                      bOnlyOwnerSee : 1;                                        // 0x0050(0x0004)
};

// ScriptStruct WillowGame.AnemoneInfectionState.FDisplayTimer
// 0x0010
struct FFDisplayTimer
{
	unsigned long                                      bShowing : 1;                                             // 0x0000(0x0004)
	float                                              Timer;                                                    // 0x0004(0x0004)
	float                                              Speed;                                                    // 0x0008(0x0004)
	float                                              Value;                                                    // 0x000C(0x0004)
};

// ScriptStruct WillowGame.AssetLibraryManager.AssetLibConfig
// 0x0018
struct FAssetLibConfig
{
	int                                                SublibraryBits;                                           // 0x0000(0x0004)
	int                                                AssetBits;                                                // 0x0004(0x0004)
	struct FString                                     Desc;                                                     // 0x0008(0x000C) (NeedCtorLink)
	class UClass*                                      LibraryType;                                              // 0x0014(0x0004)
};

// ScriptStruct WillowGame.AssetLibraryManager.SKULibrarySet
// 0x0020
struct FSKULibrarySet
{
	int                                                Id;                                                       // 0x0000(0x0004)
	struct FString                                     NameID;                                                   // 0x0004(0x000C) (NeedCtorLink)
	struct FString                                     LibrarySetPackage;                                        // 0x0010(0x000C) (NeedCtorLink)
	class UObject*                                     CachedDlcALDefRef;                                        // 0x001C(0x0004)
};

// ScriptStruct WillowGame.AssetLibraryManager.SKURuntimeLibrarySet
// 0x001C
struct FSKURuntimeLibrarySet
{
	int                                                Id;                                                       // 0x0000(0x0004)
	class UPackageAssetLibrary*                        Libraries[0x6];                                           // 0x0004(0x0004)
};

// ScriptStruct WillowGame.AttributePresentationDefinition.ModifierValuePresentationData
// 0x0010
struct FModifierValuePresentationData
{
	class UAttributePresentationDefinition*            AttributePresentation;                                    // 0x0000(0x0004) (AlwaysInit)
	class UAttributePresentationDefinition*            OptionalConstraintPresentation;                           // 0x0004(0x0004) (AlwaysInit)
	float                                              ModifierValue;                                            // 0x0008(0x0004) (AlwaysInit)
	unsigned long                                      bShouldDisplay : 1;                                       // 0x000C(0x0004) (AlwaysInit)
};

// ScriptStruct WillowGame.AttributePresentationDefinition.AttributePresentationValueRemappingData
// 0x0044
struct FAttributePresentationValueRemappingData
{
	unsigned long                                      bUseContextOverride : 1;                                  // 0x0000(0x0004) (Edit, Const)
	struct FAttributeInitializationData                InputValueMn;                                             // 0x0004(0x0010) (Edit, Const)
	struct FAttributeInitializationData                InputValueMx;                                             // 0x0014(0x0010) (Edit, Const)
	struct FAttributeInitializationData                OutputValueMn;                                            // 0x0024(0x0010) (Edit, Const)
	struct FAttributeInitializationData                OutputValueMx;                                            // 0x0034(0x0010) (Edit, Const)
};

// ScriptStruct WillowGame.WeaponStatusEffectAttributePresentationDefinition.AttributePresentationDamageTypeMapping
// 0x0008
struct FAttributePresentationDamageTypeMapping
{
	class UAttributePresentationDefinition*            Presentation;                                             // 0x0000(0x0004) (Edit, Const)
	class UDamageTypeDefinition*                       DamageType;                                               // 0x0004(0x0004) (Edit, Const)
};

// ScriptStruct WillowGame.GlobalsDefinition.StatusEffectTypeCommonProperties
// 0x000C
struct FStatusEffectTypeCommonProperties
{
	unsigned char                                      StatusEffectType;                                         // 0x0000(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	class UAkEvent*                                    EffectStartAkEvent;                                       // 0x0004(0x0004) (Edit)
	class UAkEvent*                                    EffectStopAkEvent;                                        // 0x0008(0x0004) (Edit)
};

// ScriptStruct WillowGame.GlobalsDefinition.KillSkillDuration
// 0x0008
struct FKillSkillDuration
{
	int                                                Players;                                                  // 0x0000(0x0004) (Edit, Const, EditConst)
	float                                              Duration;                                                 // 0x0004(0x0004) (Edit, Const)
};

// ScriptStruct WillowGame.WillowExperiencePipeline.DamageTypeExpModifier
// 0x000C
struct FDamageTypeExpModifier
{
	class UClass*                                      DamageSource;                                             // 0x0000(0x0004) (Edit)
	class UDamageTypeDefinition*                       TypeDefinition;                                           // 0x0004(0x0004) (Edit)
	float                                              Multiplier;                                               // 0x0008(0x0004) (Edit)
};

// ScriptStruct WillowGame.GlobalsDefinition.LevelBasedExpScale
// 0x000C
struct FLevelBasedExpScale
{
	int                                                LevelDifference;                                          // 0x0000(0x0004) (Edit, Const, EditConst)
	float                                              HigherLevelEnemyExpScale;                                 // 0x0004(0x0004) (Edit)
	float                                              LowerLevelEnemyExpScale;                                  // 0x0008(0x0004) (Edit)
};

// ScriptStruct WillowGame.GlobalsDefinition.ExpAwardWeight
// 0x000C
struct FExpAwardWeight
{
	int                                                Players;                                                  // 0x0000(0x0004) (Edit, Const, EditConst)
	float                                              KillerExpBonus;                                           // 0x0004(0x0004) (Edit, Const)
	float                                              ExpWeight;                                                // 0x0008(0x0004) (Edit, Const)
};

// ScriptStruct WillowGame.GlobalsDefinition.RarityLevelColor
// 0x000E
struct FRarityLevelColor
{
	int                                                MinLevel;                                                 // 0x0000(0x0004) (Edit)
	int                                                MaxLevel;                                                 // 0x0004(0x0004) (Edit)
	struct FColor                                      Color;                                                    // 0x0008(0x0004) (Edit)
	unsigned char                                      DropLifeSpanType;                                         // 0x000C(0x0001) (Edit)
	unsigned char                                      RarityRating;                                             // 0x000D(0x0001) (Edit)
};

// ScriptStruct WillowGame.GlobalsDefinition.PlayThroughData
// 0x0010
struct FPlayThroughData
{
	int                                                PlayThroughNumber;                                        // 0x0000(0x0004) (Edit, Const, EditConst)
	TArray<class UGameBalanceDefinition*>              BalanceDefinitions;                                       // 0x0004(0x000C) (Edit, Const, NeedCtorLink)
};

// ScriptStruct WillowGame.GlobalsDefinition.LevelBasedDamageScale
// 0x000C
struct FLevelBasedDamageScale
{
	int                                                LevelDifference;                                          // 0x0000(0x0004) (Edit, Const, EditConst)
	float                                              HigherLevelAttackerDmgScale;                              // 0x0004(0x0004) (Edit)
	float                                              LowerLevelAttackerDmgScale;                               // 0x0008(0x0004) (Edit)
};

// ScriptStruct WillowGame.AchievementUtility.AchievementUnlockData
// 0x0014
struct FAchievementUnlockData
{
	unsigned char                                      UnlockType;                                               // 0x0000(0x0001) (Edit)
	unsigned char                                      Achievement;                                              // 0x0001(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0002(0x0002) MISSED OFFSET
	struct FString                                     StringData;                                               // 0x0004(0x000C) (Edit, NeedCtorLink)
	int                                                IntData;                                                  // 0x0010(0x0004) (Edit)
};

// ScriptStruct WillowGame.GlobalsDefinition.SlaughterMissionChain
// 0x000C
struct FSlaughterMissionChain
{
	TArray<class UMissionDefinition*>                  SlaughterMissions;                                        // 0x0000(0x000C) (Edit, NeedCtorLink)
};

// ScriptStruct WillowGame.GlobalsDefinition.InputContextData
// 0x000C
struct FInputContextData
{
	struct FName                                       ContextName;                                              // 0x0000(0x0008) (Edit)
	class UInputContextDefinition*                     Definition;                                               // 0x0008(0x0004) (Edit)
};

// ScriptStruct WillowGame.GlobalsDefinition.LevelBasedStatusEffectChanceScale
// 0x000C
struct FLevelBasedStatusEffectChanceScale
{
	int                                                LevelDifference;                                          // 0x0000(0x0004) (Edit, Const, EditConst)
	float                                              HigherLevelChanceScale;                                   // 0x0004(0x0004) (Edit)
	float                                              LowerLevelChanceScale;                                    // 0x0008(0x0004) (Edit)
};

// ScriptStruct WillowGame.BalanceModifierDefinition.BalanceModification
// 0x0090
struct FBalanceModification
{
	unsigned char                                      MinEffectiveLevel;                                        // 0x0000(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	float                                              EnemyHealthMultiplier;                                    // 0x0004(0x0004) (Edit)
	float                                              BadassEnemyHealthMultiplier;                              // 0x0008(0x0004) (Edit)
	float                                              EnemyShieldStrengthMultiplier;                            // 0x000C(0x0004) (Edit)
	float                                              BadassEnemyShieldStrengthMultiplier;                      // 0x0010(0x0004) (Edit)
	float                                              EnemyDamageMultiplier;                                    // 0x0014(0x0004) (Edit)
	float                                              BadassEnemyDamageMultiplier;                              // 0x0018(0x0004) (Edit)
	float                                              XPGainedFromCombatMultiplier;                             // 0x001C(0x0004) (Edit)
	float                                              XPGainedFromQuestsMultiplier;                             // 0x0020(0x0004) (Edit)
	float                                              BadassRankGainMultiplier;                                 // 0x0024(0x0004) (Edit)
	float                                              AmplifiedDamageMultiplier;                                // 0x0028(0x0004) (Edit)
	float                                              PlayerVehicleWeaponDamageMultiplier;                      // 0x002C(0x0004) (Edit)
	TArray<struct FAttributeEffectData>                AttributeEffectsForSpawnedEnemies;                        // 0x0030(0x000C) (Edit, NeedCtorLink)
	TArray<struct FAttributeEffectData>                AttributeEffectsForPlayers;                               // 0x003C(0x000C) (Edit, NeedCtorLink)
	struct FAttributeInitializationData                AmmoDropsPerPlayerMultiplier;                             // 0x0048(0x0010) (Edit)
	struct FAttributeInitializationData                GearDrops_CommonWeightModifier_PT3_BaseValueOverride;     // 0x0058(0x0010) (Edit)
	struct FAttributeInitializationData                ChestItemPool_Weight_2_Uncommon_PT3_Multiplier;           // 0x0068(0x0010) (Edit, Const)
	TArray<struct FLevelBasedStatusEffectChanceScale>  StatusEffectChanceScales;                                 // 0x0078(0x000C) (Edit, Const, NeedCtorLink)
	TArray<struct FLevelBasedDamageScale>              AIDamageScaleByLevelDifference;                           // 0x0084(0x000C) (Edit, Const, NeedCtorLink)
};

// ScriptStruct WillowGame.BalanceModifierDefinition.BlackMarketPostLaunchUpgradeData
// 0x0004
struct FBlackMarketPostLaunchUpgradeData
{
	int                                                EridiumCostForUpgrade;                                    // 0x0000(0x0004) (Edit)
};

// ScriptStruct WillowGame.BalanceModifierDefinition.MapSpecificBalanceModificationList
// 0x0014
struct FMapSpecificBalanceModificationList
{
	struct FName                                       MapName;                                                  // 0x0000(0x0008) (Edit)
	TArray<class UAIPawnBalanceModifierDefinition*>    AIPawnBalanceModifiers;                                   // 0x0008(0x000C) (Edit, NeedCtorLink)
};

// ScriptStruct WillowGame.IMissionDirector.MissionDirectorData
// 0x0009
struct FMissionDirectorData
{
	class UMissionDefinition*                          MissionDefinition;                                        // 0x0000(0x0004) (Edit)
	unsigned long                                      bBeginsMission : 1;                                       // 0x0004(0x0004) (Edit)
	unsigned long                                      bEndsMission : 1;                                         // 0x0004(0x0004) (Edit)
	unsigned char                                      BranchEnding;                                             // 0x0008(0x0001) (Edit)
};

// ScriptStruct WillowGame.Behavior_AIThrowProjectileAtTarget.AIThrowProjectileBehaviorSequenceStateData
// 0x000C
struct FAIThrowProjectileBehaviorSequenceStateData
{
	unsigned char                                      Action;                                                   // 0x0000(0x0001) (Edit, Const)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	struct FName                                       SequenceName;                                             // 0x0004(0x0008) (Edit, Const)
};

// ScriptStruct WillowGame.Behavior_AIThrowProjectileAtTarget.TrajectoryData
// 0x0020
struct FTrajectoryData
{
	float                                              Speed;                                                    // 0x0000(0x0004) (Edit)
	float                                              AnglePct;                                                 // 0x0004(0x0004) (Edit)
	float                                              Angle;                                                    // 0x0008(0x0004)
	float                                              Error;                                                    // 0x000C(0x0004) (Edit)
	struct FVector                                     Offset;                                                   // 0x0010(0x000C) (Edit)
	float                                              PredictDistMax;                                           // 0x001C(0x0004) (Edit)
};

// ScriptStruct WillowGame.Behavior_Conditional.BehaviorCondition
// 0x0014
struct FBehaviorCondition
{
	int                                                ConditionId;                                              // 0x0000(0x0004) (Const)
	class UExpressionEvaluator*                        Condition;                                                // 0x0004(0x0004) (Edit, Const, EditInline)
	TArray<class UBehaviorBase*>                       Behaviors;                                                // 0x0008(0x000C) (Edit, Const, NeedCtorLink, EditInline)
};

// ScriptStruct WillowGame.Behavior_RandomlySelectBehaviors.BehaviorsSelectionData
// 0x001C
struct FBehaviorsSelectionData
{
	struct FAttributeInitializationData                Weight;                                                   // 0x0000(0x0010) (Edit, Const)
	TArray<class UBehaviorBase*>                       Behaviors;                                                // 0x0010(0x000C) (Edit, Const, NeedCtorLink, EditInline)
};

// ScriptStruct WillowGame.Behavior_SpawnProjectile.ProjectileBehaviorSequenceStateData
// 0x000C
struct UBehavior_SpawnProjectile_FProjectileBehaviorSequenceStateData
{
	unsigned char                                      Action;                                                   // 0x0000(0x0001) (Edit, Const)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	struct FName                                       SequenceName;                                             // 0x0004(0x0008) (Edit, Const)
};

// ScriptStruct WillowGame.BehaviorSequenceEnableByMission.MissionStateSelectionData
// 0x0004
struct FMissionStateSelectionData
{
	unsigned long                                      bNotStarted : 1;                                          // 0x0000(0x0004) (Edit)
	unsigned long                                      bActive : 1;                                              // 0x0000(0x0004) (Edit)
	unsigned long                                      bRequiredObjectivesComplete : 1;                          // 0x0000(0x0004) (Edit)
	unsigned long                                      bReadyToTurnIn : 1;                                       // 0x0000(0x0004) (Edit)
	unsigned long                                      bComplete : 1;                                            // 0x0000(0x0004) (Edit)
	unsigned long                                      bFailed : 1;                                              // 0x0000(0x0004) (Edit)
};

// ScriptStruct WillowGame.BehaviorSequenceEnableByMission.MissionObjectiveStateSelectionData
// 0x0004
struct FMissionObjectiveStateSelectionData
{
	unsigned long                                      bNotStarted : 1;                                          // 0x0000(0x0004) (Edit)
	unsigned long                                      bActive : 1;                                              // 0x0000(0x0004) (Edit)
	unsigned long                                      bComplete : 1;                                            // 0x0000(0x0004) (Edit)
};

// ScriptStruct WillowGame.BlackMarketDefinition.BlackMarketUpgradeLevelData
// 0x0008
struct FBlackMarketUpgradeLevelData
{
	class UBlackMarketUpgradeDefinition*               UpgradeDefinition;                                        // 0x0000(0x0004) (Edit)
	int                                                MaxUpgradeLevel;                                          // 0x0004(0x0004) (Edit)
};

// ScriptStruct WillowGame.BodyClassDeathDefinition.TechDeathData
// 0x0010 (0x0008 - 0x0018)
struct FTechDeathData : public FSpecializedBehaviorEvent
{
	TArray<class UDamageTypeDefinition*>               DamageTypeTriggers;                                       // 0x0008(0x000C) (Edit, Const, NeedCtorLink)
	class USpecialMoveDefinition*                      DeathAnimation;                                           // 0x0014(0x0004) (Edit, Const)
};

// ScriptStruct WillowGame.WillowPhysicalMaterialProperty.RtpcParameterValue
// 0x0008
struct FRtpcParameterValue
{
	class UAkRtpc*                                     AkRtpc;                                                   // 0x0000(0x0004) (Edit)
	float                                              Value;                                                    // 0x0004(0x0004) (Edit)
};

// ScriptStruct WillowGame.WillowPhysicalMaterialProperty.ImpactResponseParameters
// 0x004C
struct FImpactResponseParameters
{
	TArray<struct FParticleSysParam>                   ParticleParameters;                                       // 0x0000(0x000C) (Edit, NeedCtorLink)
	TArray<struct FFontParameterValue>                 FontParameterValues;                                      // 0x000C(0x000C) (Edit, NeedCtorLink)
	TArray<struct FScalarParameterValue>               ScalarParameterValues;                                    // 0x0018(0x000C) (Edit, NeedCtorLink)
	TArray<struct FTextureParameterValue>              TextureParameterValues;                                   // 0x0024(0x000C) (Edit, NeedCtorLink)
	TArray<struct FVectorParameterValue>               VectorParameterValues;                                    // 0x0030(0x000C) (Edit, NeedCtorLink)
	TArray<struct FRtpcParameterValue>                 RtpcParameterValues;                                      // 0x003C(0x000C) (Edit, NeedCtorLink)
	unsigned long                                      bNoSound : 1;                                             // 0x0048(0x0004) (Edit)
};

// ScriptStruct WillowGame.WillowPhysicalMaterialProperty.ImpactResponseEffect
// 0x0094
struct FImpactResponseEffect
{
	unsigned long                                      bCensorThisEffect : 1;                                    // 0x0000(0x0004) (Edit, Const)
	class UWillowImpactDefinition*                     CensoredEffectAlternative;                                // 0x0004(0x0004) (Edit, Const)
	float                                              DamageModifierPercent;                                    // 0x0008(0x0004) (Edit, Const)
	class UAkEvent*                                    ImpactEvent;                                              // 0x000C(0x0004) (Edit, Const)
	float                                              AINoiseLevel;                                             // 0x0010(0x0004) (Edit, Const)
	class UParticleSystem*                             ParticleTemplate;                                         // 0x0014(0x0004) (Edit, Const)
	unsigned long                                      bAttachParticleToHitActor : 1;                            // 0x0018(0x0004) (Edit, Const)
	unsigned long                                      bHideEffectFromHitActor : 1;                              // 0x0018(0x0004) (Edit)
	float                                              MaxEffectDistance;                                        // 0x001C(0x0004) (Edit, Const)
	TArray<class UMaterialInterface*>                  DecalMaterials;                                           // 0x0020(0x000C) (Edit, Const, NeedCtorLink)
	float                                              DecalWidth;                                               // 0x002C(0x0004) (Edit, Const)
	float                                              DecalHeight;                                              // 0x0030(0x0004) (Edit, Const)
	float                                              DecalMinScale;                                            // 0x0034(0x0004) (Edit, Const)
	float                                              DecalMaxScale;                                            // 0x0038(0x0004) (Edit, Const)
	float                                              DecalDepth;                                               // 0x003C(0x0004) (Edit, Const)
	unsigned long                                      DecalRandomRotation : 1;                                  // 0x0040(0x0004) (Edit, Const)
	unsigned long                                      DecalCreateNewMaterialInstanceConstant : 1;               // 0x0040(0x0004) (Edit, Const)
	class UClass*                                      ImpactFlashLightClass;                                    // 0x0044(0x0004) (Edit, Const)
	struct FImpactResponseParameters                   EffectParameters;                                         // 0x0048(0x004C) (Edit, Const, NeedCtorLink)
};

// ScriptStruct WillowGame.WillowPhysicalMaterialProperty.ImpactResponseData
// 0x0098
struct FImpactResponseData
{
	class UWillowImpactDefinition*                     ImpactType;                                               // 0x0000(0x0004) (Edit, Const)
	struct FImpactResponseEffect                       ResponseEffect;                                           // 0x0004(0x0094) (Edit, Const, NeedCtorLink)
};

// ScriptStruct WillowGame.WillowPhysicalMaterialProperty.WheelSlipModifierData
// 0x0008
struct FWheelSlipModifierData
{
	float                                              LongSlipFactor;                                           // 0x0000(0x0004) (Edit, Const)
	float                                              LatSlipFactor;                                            // 0x0004(0x0004) (Edit, Const)
};

// ScriptStruct WillowGame.BodyHitRegionDefinition.DamageReactionData
// 0x0024 (0x0008 - 0x002C)
struct FDamageReactionData : public FSpecializedBehaviorEvent
{
	TArray<struct FGoreTriggerData>                    DamageTriggers;                                           // 0x0008(0x000C) (Edit, NeedCtorLink)
	float                                              PercentOfHealthTrigger;                                   // 0x0014(0x0004) (Edit)
	class USpecialMoveDefinition*                      DamageSpecialMove;                                        // 0x0018(0x0004) (Edit)
	TArray<class UBehaviorBase*>                       ReactionBehaviors;                                        // 0x001C(0x000C) (Edit, Const, EditConst, NeedCtorLink)
	unsigned long                                      bDamageThreshold : 1;                                     // 0x0028(0x0004) (Edit)
	unsigned long                                      bRepeatableEvent : 1;                                     // 0x0028(0x0004) (Edit)
	unsigned long                                      bCensored : 1;                                            // 0x0028(0x0004) (Edit)
	unsigned long                                      bOnlyTriggeredOnOwnerDeath : 1;                           // 0x0028(0x0004) (Edit)
};

// ScriptStruct WillowGame.BodyHitRegionDefinition.GoreTriggerData
// 0x000C
struct FGoreTriggerData
{
	class UDamageTypeDefinition*                       DamageTypeTrigger;                                        // 0x0000(0x0004) (Edit)
	class UClass*                                      DamageSourceTrigger;                                      // 0x0004(0x0004) (Edit)
	float                                              HealthPctDamageThreshold;                                 // 0x0008(0x0004) (Edit)
};

// ScriptStruct WillowGame.BodyClassDefinition.ExtraWeaponSlot
// 0x0024
struct FExtraWeaponSlot
{
	struct FName                                       Socket;                                                   // 0x0000(0x0008) (Edit)
	unsigned long                                      bShowWeaponMesh : 1;                                      // 0x0008(0x0004) (Edit)
	class USkeletalMeshComponent*                      Mesh;                                                     // 0x000C(0x0004) (ExportObject, Transient, Component, EditInline)
	class UParticleSystemComponent*                    MuzzleFlash;                                              // 0x0010(0x0004) (ExportObject, Transient, Component, EditInline)
	TArray<class UParticleSystemComponent*>            AltMuzzleFlashes;                                         // 0x0014(0x000C) (ExportObject, Transient, Component, NeedCtorLink, EditInline)
	class UWillowPointLight*                           MuzzleFlashLight;                                         // 0x0020(0x0004) (ExportObject, Transient, Component, EditInline)
};

// ScriptStruct WillowGame.BodyClassDefinition.PainDialogLine
// 0x0028
struct FPainDialogLine
{
	class UGearboxDialogEventTag*                      DET_Pain;                                                 // 0x0000(0x0004) (Edit, Const)
	float                                              DamageThresholdPct;                                       // 0x0004(0x0004) (Edit, Const)
	float                                              ChanceToPlay;                                             // 0x0008(0x0004) (Edit, Const)
	class UAkEvent*                                    AkEvent;                                                  // 0x000C(0x0004) (Edit, Const)
	unsigned long                                      bDeathSound : 1;                                          // 0x0010(0x0004) (Edit, Const)
	unsigned long                                      bCriticalHitSound : 1;                                    // 0x0010(0x0004) (Edit, Const)
	unsigned long                                      bRanOverSound : 1;                                        // 0x0010(0x0004) (Edit, Const)
	unsigned long                                      bGoreTechDeathSound : 1;                                  // 0x0010(0x0004) (Edit, Const)
	unsigned char                                      FlinchAnimType;                                           // 0x0014(0x0001) (Edit, Const)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0015(0x0003) MISSED OFFSET
	float                                              FlinchImpulseStrength;                                    // 0x0018(0x0004) (Edit, Const)
	TArray<class UBehaviorBase*>                       PainBehaviors;                                            // 0x001C(0x000C) (Edit, Const, NeedCtorLink, EditInline)
};

// ScriptStruct WillowGame.BodyClassDefinition.CustomCringeData
// 0x0014
struct FCustomCringeData
{
	unsigned long                                      bDOT : 1;                                                 // 0x0000(0x0004) (Edit, Const)
	unsigned char                                      DamageType;                                               // 0x0004(0x0001) (Edit, Const)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0005(0x0003) MISSED OFFSET
	TArray<class USpecialMove_Cringe*>                 Cringes;                                                  // 0x0008(0x000C) (Edit, Const, NeedCtorLink, EditInline)
};

// ScriptStruct WillowGame.BodyClassDefinition.BreathingLoopInfo
// 0x000C
struct FBreathingLoopInfo
{
	class UExpressionEvaluator*                        Condition;                                                // 0x0000(0x0004) (Edit, Const, EditInline)
	class UAkEvent*                                    StartAkEvent;                                             // 0x0004(0x0004) (Edit, Const)
	class UAkEvent*                                    StopAkEvent;                                              // 0x0008(0x0004) (Edit, Const)
};

// ScriptStruct WillowGame.BodyClassDefinition.InjuredLoopOverride
// 0x0008
struct FInjuredLoopOverride
{
	class UWillowDialogNameTag*                        NameTag;                                                  // 0x0000(0x0004) (Edit, Const)
	class UAkEvent*                                    StartAkEvent;                                             // 0x0004(0x0004) (Edit, Const)
};

// ScriptStruct WillowGame.BodyClassDefinition.VehicleCrewMappingStruct
// 0x000C
struct FVehicleCrewMappingStruct
{
	struct FName                                       VehicleArchetypeName;                                     // 0x0000(0x0008) (Edit, Const)
	class UAnimSet*                                    AnimSet;                                                  // 0x0008(0x0004) (Edit, Const)
};

// ScriptStruct WillowGame.BodyWeaponHoldDefinition.ConditionalAnimData
// 0x0008
struct FConditionalAnimData
{
	class UExpressionEvaluator*                        Expression;                                               // 0x0000(0x0004) (Edit, Const, EditInline)
	class USpecialMoveDefinition*                      SpecialMove;                                              // 0x0004(0x0004) (Edit, Const)
};

// ScriptStruct WillowGame.BodyWeaponHoldDefinition.BodyWeaponActionData
// 0x0014
struct FBodyWeaponActionData
{
	unsigned char                                      Action;                                                   // 0x0000(0x0001) (Edit, Const)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	class UExpressionEvaluator*                        Expression;                                               // 0x0004(0x0004) (Edit, Const, EditInline)
	TArray<struct FConditionalAnimData>                Animations;                                               // 0x0008(0x000C) (Edit, Const, NeedCtorLink)
};

// ScriptStruct WillowGame.BodyWeaponHoldDefinition.BodyWeaponActionPostureData
// 0x0010
struct FBodyWeaponActionPostureData
{
	unsigned char                                      Posture;                                                  // 0x0000(0x0001) (Edit, Const)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	TArray<struct FBodyWeaponActionData>               Actions;                                                  // 0x0004(0x000C) (Edit, Const, NeedCtorLink)
};

// ScriptStruct WillowGame.BodyWeaponHoldDefinition.BodyHandIKHoldData
// 0x0024
struct FBodyHandIKHoldData
{
	struct FVector                                     JointLocation;                                            // 0x0000(0x000C) (Edit, Const)
	struct FVector                                     HandLocation;                                             // 0x000C(0x000C) (Edit, Const)
	struct FRotator                                    HandRotation;                                             // 0x0018(0x000C) (Edit, Const)
};

// ScriptStruct WillowGame.BodyWeaponHoldDefinition.CustomBodyHandIKHoldData
// 0x002C
struct FCustomBodyHandIKHoldData
{
	struct FName                                       HoldName;                                                 // 0x0000(0x0008) (Edit, Const)
	struct FBodyHandIKHoldData                         IKData;                                                   // 0x0008(0x0024) (Edit, Const)
};

// ScriptStruct WillowGame.WillowDeclarations.CellInfo
// 0x0020
struct FCellInfo
{
	struct FVector                                     AbsolutePosition;                                         // 0x0000(0x000C)
	float                                              Width;                                                    // 0x000C(0x0004)
	float                                              Height;                                                   // 0x0010(0x0004)
	struct FString                                     CellName;                                                 // 0x0014(0x000C) (NeedCtorLink)
};

// ScriptStruct WillowGame.CellsNavigator.MoveToCellData
// 0x000C
struct FMoveToCellData
{
	int                                                IndexInCellsList;                                         // 0x0000(0x0004)
	float                                              DistanceFromCurrentCell;                                  // 0x0004(0x0004)
	float                                              CosAngle;                                                 // 0x0008(0x0004)
};

// ScriptStruct WillowGame.ChallengeDefinition.ConditionLevel
// 0x0040
struct FConditionLevel
{
	TArray<class UChallengeConditionDefinition*>       ConditionDefinitions;                                     // 0x0000(0x000C) (Edit, Const, NeedCtorLink, EditInline)
	TArray<float>                                      ProgressNotificationOverride;                             // 0x000C(0x000C) (Edit, Const, NeedCtorLink)
	TArray<struct FAttributeEffectData>                CompletedAttributeEffects;                                // 0x0018(0x000C) (Edit, Const, NeedCtorLink)
	struct FAttributeInitializationData                BadassPointReward;                                        // 0x0024(0x0010) (Edit, Const)
	class UItemPoolDefinition*                         RewardItemPool;                                           // 0x0034(0x0004) (Edit, Const)
	struct FName                                       RewardTextKey;                                            // 0x0038(0x0008) (Edit, Const)
};

// ScriptStruct WillowGame.ChallengeDefinition.ChallengeData
// 0x0008
struct FChallengeData
{
	class AWillowPlayerController*                     PCOwner;                                                  // 0x0000(0x0004)
	class UChallengeDefinition*                        ChallengeDefinition;                                      // 0x0004(0x0004)
};

// ScriptStruct WillowGame.CombatMusicManager.TargetedPlayerState
// 0x0014
struct FTargetedPlayerState
{
	class AWillowMind*                                 Enemy;                                                    // 0x0000(0x0004)
	class AActor*                                      Player;                                                   // 0x0004(0x0004)
	float                                              InitialThreat;                                            // 0x0008(0x0004)
	float                                              StoppedTargetingPlayerTime;                               // 0x000C(0x0004)
	unsigned long                                      bIsPlayerPet : 1;                                         // 0x0010(0x0004)
};

// ScriptStruct WillowGame.CoordinatedEffectDefinition.CoordinatedScalarParameter
// 0x0020
struct FCoordinatedScalarParameter
{
	struct FName                                       ParamName;                                                // 0x0000(0x0008) (Edit)
	struct FInterpCurveFloat                           ParamValueOverTime;                                       // 0x0008(0x0010) (Edit, NeedCtorLink)
	unsigned char                                      BoundsScale;                                              // 0x0018(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0019(0x0003) MISSED OFFSET
	unsigned long                                      bConvertAxisToWorldSpace : 1;                             // 0x001C(0x0004) (Edit)
};

// ScriptStruct WillowGame.CoordinatedEffectDefinition.CoordinatedVectorParameter
// 0x0018
struct FCoordinatedVectorParameter
{
	struct FName                                       ParamName;                                                // 0x0000(0x0008) (Edit)
	struct FInterpCurveVector                          ParamValueOverTime;                                       // 0x0008(0x0010) (Edit, NeedCtorLink)
};

// ScriptStruct WillowGame.CoordinatedEffectDefinition.CoordinatedParticleSystemDefinition
// 0x003D
struct FCoordinatedParticleSystemDefinition
{
	class UParticleSystem*                             ParticleSystem;                                           // 0x0000(0x0004) (Edit)
	struct FVector                                     LocationOffset;                                           // 0x0004(0x000C) (Edit)
	struct FRotator                                    RotationOffset;                                           // 0x0010(0x000C) (Edit)
	float                                              TriggerTime;                                              // 0x001C(0x0004) (Edit)
	float                                              ParticleScale;                                            // 0x0020(0x0004) (Edit)
	TArray<struct FCoordinatedScalarParameter>         Parameters;                                               // 0x0024(0x000C) (Edit, NeedCtorLink)
	TArray<struct FCoordinatedVectorParameter>         VectorParameters;                                         // 0x0030(0x000C) (Edit, NeedCtorLink)
	unsigned char                                      ScaleByObjectSize;                                        // 0x003C(0x0001) (Edit)
};

// ScriptStruct WillowGame.CoordinatedEffectDefinition.CoordinatedAudioDefinition
// 0x001C
struct FCoordinatedAudioDefinition
{
	class UAkEvent*                                    TriggerEvent;                                             // 0x0000(0x0004) (Edit)
	float                                              TriggerTime;                                              // 0x0004(0x0004) (Edit)
	class UAkRtpc*                                     RTPC;                                                     // 0x0008(0x0004) (Edit)
	struct FInterpCurveFloat                           RTPCOverTime;                                             // 0x000C(0x0010) (Edit, NeedCtorLink)
};

// ScriptStruct WillowGame.CurrencyListDefinition.CurrencyPresentation
// 0x0014
struct FCurrencyPresentation
{
	unsigned char                                      Type;                                                     // 0x0000(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	struct FString                                     WidgetFrame;                                              // 0x0004(0x000C) (Edit, NeedCtorLink)
	class USwfMovie*                                   WidgetClip;                                               // 0x0010(0x0004) (Edit)
};

// ScriptStruct WillowGame.DamageOverTimeManager.SourceObjectData
// 0x0068
struct FSourceObjectData
{
	int                                                UniqueId;                                                 // 0x0000(0x0004)
	class UObject*                                     SourceObject;                                             // 0x0004(0x0004)
	struct FVector                                     SourceLocation;                                           // 0x0008(0x000C)
	class AController*                                 InstigatedByController;                                   // 0x0014(0x0004)
	FScriptInterface                                   DamageContext;                                            // 0x0018(0x0008)
	float                                              StartDamageTime;                                          // 0x0020(0x0004)
	float                                              TimeElapsedSinceLastDamage;                               // 0x0024(0x0004)
	class UExplosionDefinition*                        ExplosionDef;                                             // 0x0028(0x0004)
	int                                                ExplosionScaleIndex;                                      // 0x002C(0x0004)
	float                                              InitialDamageRadius;                                      // 0x0030(0x0004)
	float                                              Damage;                                                   // 0x0034(0x0004)
	unsigned long                                      bFullDamage : 1;                                          // 0x0038(0x0004)
	float                                              Momentum;                                                 // 0x003C(0x0004)
	class UClass*                                      DamageSource;                                             // 0x0040(0x0004)
	class UDamageTypeDefinition*                       DamageTypeDef;                                            // 0x0044(0x0004)
	class UImpactDefinition*                           ImpactDefinition;                                         // 0x0048(0x0004)
	unsigned long                                      bCanDamageFriendlies : 1;                                 // 0x004C(0x0004)
	FScriptInterface                                   DamageCauser;                                             // 0x0050(0x0008)
	unsigned long                                      bSkipTraceTest : 1;                                       // 0x0058(0x0004)
	class UObject*                                     HitObject;                                                // 0x005C(0x0004)
	float                                              BarrelSourceTime;                                         // 0x0060(0x0004)
	float                                              PlantSourceTime;                                          // 0x0064(0x0004)
};

// ScriptStruct WillowGame.DamageOverTimeManager.DamageOnlyOnceData
// 0x0008
struct FDamageOnlyOnceData
{
	int                                                UniqueId;                                                 // 0x0000(0x0004)
	class AActor*                                      HurtActor;                                                // 0x0004(0x0004)
};

// ScriptStruct WillowGame.DamageTypeAttributeValueResolver.DamageTypeSelectorData
// 0x0018
struct FDamageTypeSelectorData
{
	struct FName                                       AssociatedDamageTypeName;                                 // 0x0000(0x0008) (Edit, Const, EditConst)
