#pragma once
#include "stdafx.h"
/*
#############################################################################################
# Borderlands 2 (1.7) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: Core_f_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function Core.Object.IsRelevantForDebugging
// [0x00020400] ( FUNC_Native )
struct UObject_execIsRelevantForDebugging_Parms
{
	class UObject*                                     Source;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.GetGlobalDebugTarget
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UObject_execGetGlobalDebugTarget_Parms
{
	class UObject*                                     ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.SetGlobalDebugTarget
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UObject_execSetGlobalDebugTarget_Parms
{
	class UObject*                                     Target;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Core.Object.LogContentDebug
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UObject_execLogContentDebug_Parms
{
	struct FString                                     Message;                                          		// 0x0000 (0x000C) [0x0000000000400880]              ( CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink )
};

// Function Core.Object.GetLanguage
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UObject_execGetLanguage_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function Core.Object.GetRandomOptionSumFrequency
// [0x00420003] ( FUNC_Final )
struct UObject_execGetRandomOptionSumFrequency_Parms
{
	TArray< float >                                    FreqList;                                         		// 0x0000 (0x000C) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	int                                                ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.GetBuildChangelistNumber
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UObject_execGetBuildChangelistNumber_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.GetEngineVersion
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UObject_execGetEngineVersion_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.GetSystemTime
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct UObject_execGetSystemTime_Parms
{
	int                                                Year;                                             		// 0x0000 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	int                                                Month;                                            		// 0x0004 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	int                                                DayOfWeek;                                        		// 0x0008 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	int                                                Day;                                              		// 0x000C (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	int                                                Hour;                                             		// 0x0010 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	int                                                Min;                                              		// 0x0014 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	int                                                Sec;                                              		// 0x0018 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	int                                                MSec;                                             		// 0x001C (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function Core.Object.TimeStamp
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UObject_execTimeStamp_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function Core.Object.TransformVectorByRotation
// [0x00024401] ( FUNC_Final | FUNC_Native )
struct UObject_execTransformVectorByRotation_Parms
{
	struct FRotator                                    SourceRotation;                                   		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     SourceVector;                                     		// 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bInverse : 1;                                     		// 0x0018 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	struct FVector                                     ReturnValue;                                      		// 0x001C (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.GetPackageName
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UObject_execGetPackageName_Parms
{
	struct FName                                       ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.IsPendingKill
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UObject_execIsPendingKill_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.ByteToFloat
// [0x00024103] ( FUNC_Final )
struct UObject_execByteToFloat_Parms
{
	unsigned char                                      inputByte;                                        		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bSigned : 1;                                      		// 0x0004 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	float                                              ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.FloatToByte
// [0x00024103] ( FUNC_Final )
struct UObject_execFloatToByte_Parms
{
	float                                              inputFloat;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bSigned : 1;                                      		// 0x0004 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	unsigned char                                      ReturnValue;                                      		// 0x0008 (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.UnwindHeading
// [0x00022103] ( FUNC_Final )
struct UObject_execUnwindHeading_Parms
{
	float                                              A;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.FindDeltaAngle
// [0x00022103] ( FUNC_Final )
struct UObject_execFindDeltaAngle_Parms
{
	float                                              A1;                                               		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              A2;                                               		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.GetHeadingAngle
// [0x00022103] ( FUNC_Final )
struct UObject_execGetHeadingAngle_Parms
{
	struct FVector                                     Dir;                                              		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.GetAngularDegreesFromRadians
// [0x00422103] ( FUNC_Final )
struct UObject_execGetAngularDegreesFromRadians_Parms
{
	struct FVector2D                                   OutFOV;                                           		// 0x0000 (0x0008) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function Core.Object.GetAngularFromDotDist
// [0x00422401] ( FUNC_Final | FUNC_Native )
struct UObject_execGetAngularFromDotDist_Parms
{
	struct FVector2D                                   OutAngDist;                                       		// 0x0000 (0x0008) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	struct FVector2D                                   DotDist;                                          		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function Core.Object.GetAngularDistance
// [0x00422401] ( FUNC_Final | FUNC_Native )
struct UObject_execGetAngularDistance_Parms
{
	struct FVector2D                                   OutAngularDist;                                   		// 0x0000 (0x0008) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	struct FVector                                     Direction;                                        		// 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     AxisX;                                            		// 0x0014 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     AxisY;                                            		// 0x0020 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     AxisZ;                                            		// 0x002C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0038 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.GetDotDistance
// [0x00422401] ( FUNC_Final | FUNC_Native )
struct UObject_execGetDotDistance_Parms
{
	struct FVector2D                                   OutDotDist;                                       		// 0x0000 (0x0008) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	struct FVector                                     Direction;                                        		// 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     AxisX;                                            		// 0x0014 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     AxisY;                                            		// 0x0020 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     AxisZ;                                            		// 0x002C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0038 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.PointProjectToPlane
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UObject_execPointProjectToPlane_Parms
{
	struct FVector                                     Point;                                            		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     A;                                                		// 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     B;                                                		// 0x0018 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     C;                                                		// 0x0024 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     ReturnValue;                                      		// 0x0030 (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.PointDistToPlane
// [0x00C24103] ( FUNC_Final )
struct UObject_execPointDistToPlane_Parms
{
	struct FVector                                     Point;                                            		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FRotator                                    Orientation;                                      		// 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     Origin;                                           		// 0x0018 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     out_ClosestPoint;                                 		// 0x0024 (0x000C) [0x0000000000000190]              ( CPF_OptionalParm | CPF_Parm | CPF_OutParm )
	float                                              ReturnValue;                                      		// 0x0030 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FVector                                  AxisX;                                            		// 0x0034 (0x000C) [0x0000000000000000]
	// struct FVector                                  AxisY;                                            		// 0x0040 (0x000C) [0x0000000000000000]
	// struct FVector                                  AxisZ;                                            		// 0x004C (0x000C) [0x0000000000000000]
	// struct FVector                                  PointNoZ;                                         		// 0x0058 (0x000C) [0x0000000000000000]
	// struct FVector                                  OriginNoZ;                                        		// 0x0064 (0x000C) [0x0000000000000000]
};

// Function Core.Object.PointDistToSegment
// [0x00424401] ( FUNC_Final | FUNC_Native )
struct UObject_execPointDistToSegment_Parms
{
	struct FVector                                     Point;                                            		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     StartPoint;                                       		// 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     EndPoint;                                         		// 0x0018 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     OutClosestPoint;                                  		// 0x0024 (0x000C) [0x0000000000000190]              ( CPF_OptionalParm | CPF_Parm | CPF_OutParm )
	float                                              ReturnValue;                                      		// 0x0030 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.PointDistToLine
// [0x00424401] ( FUNC_Final | FUNC_Native )
struct UObject_execPointDistToLine_Parms
{
	struct FVector                                     Point;                                            		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     Line;                                             		// 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     Origin;                                           		// 0x0018 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     OutClosestPoint;                                  		// 0x0024 (0x000C) [0x0000000000000190]              ( CPF_OptionalParm | CPF_Parm | CPF_OutParm )
	float                                              ReturnValue;                                      		// 0x0030 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.GetPerObjectConfigSections
// [0x00426401] ( FUNC_Final | FUNC_Native )
struct UObject_execGetPerObjectConfigSections_Parms
{
	class UClass*                                      SearchClass;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	TArray< struct FString >                           out_SectionNames;                                 		// 0x0004 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	class UObject*                                     ObjectOuter;                                      		// 0x0010 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	int                                                MaxResults;                                       		// 0x0014 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0018 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.StaticSaveConfig
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UObject_execStaticSaveConfig_Parms
{
};

// Function Core.Object.SaveConfig
// [0x00020401] ( FUNC_Final | FUNC_Native ) iNative [0x0218]
struct UObject_execSaveConfig_Parms
{
};

// Function Core.Object.GetAttributeModiferDescriptor
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UObject_execGetAttributeModiferDescriptor_Parms
{
	struct FName                                       AttributeName;                                    		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     ReturnValue;                                      		// 0x0008 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function Core.Object.GetAttributeValueByName
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UObject_execGetAttributeValueByName_Parms
{
	struct FName                                       AttributeName;                                    		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.RemoveModifier
// [0x00024401] ( FUNC_Final | FUNC_Native )
struct UObject_execRemoveModifier_Parms
{
	class UAttributeModifier*                          mod;                                              		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       AttributeName;                                    		// 0x0004 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bSuppressNotify : 1;                              		// 0x000C (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.AddModifier
// [0x00024401] ( FUNC_Final | FUNC_Native )
struct UObject_execAddModifier_Parms
{
	class UAttributeModifier*                          mod;                                              		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       AttributeName;                                    		// 0x0004 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bSuppressNotify : 1;                              		// 0x000C (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.FindObject
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UObject_execFindObject_Parms
{
	struct FString                                     ObjectName;                                       		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UClass*                                      ObjectClass;                                      		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UObject*                                     ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.DynamicLoadObject
// [0x00026401] ( FUNC_Final | FUNC_Native )
struct UObject_execDynamicLoadObject_Parms
{
	struct FString                                     ObjectName;                                       		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UClass*                                      ObjectClass;                                      		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      MayFail : 1;                                      		// 0x0010 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	class UObject*                                     ReturnValue;                                      		// 0x0014 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.GetEnum
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UObject_execGetEnum_Parms
{
	class UObject*                                     E;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                I;                                                		// 0x0004 (0x0004) [0x0000000000000880]              ( CPF_Parm | CPF_CoerceParm )
	struct FName                                       ReturnValue;                                      		// 0x0008 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.Disable
// [0x00020401] ( FUNC_Final | FUNC_Native ) iNative [0x0076]
struct UObject_execDisable_Parms
{
	struct FName                                       ProbeFunc;                                        		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function Core.Object.Enable
// [0x00020401] ( FUNC_Final | FUNC_Native ) iNative [0x0075]
struct UObject_execEnable_Parms
{
	struct FName                                       ProbeFunc;                                        		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function Core.Object.ContinuedState
// [0x00020800] ( FUNC_Event )
struct UObject_eventContinuedState_Parms
{
};

// Function Core.Object.PausedState
// [0x00020800] ( FUNC_Event )
struct UObject_eventPausedState_Parms
{
};

// Function Core.Object.PoppedState
// [0x00020800] ( FUNC_Event )
struct UObject_eventPoppedState_Parms
{
};

// Function Core.Object.PushedState
// [0x00020800] ( FUNC_Event )
struct UObject_eventPushedState_Parms
{
};

// Function Core.Object.EndState
// [0x00020800] ( FUNC_Event )
struct UObject_eventEndState_Parms
{
	struct FName                                       NextStateName;                                    		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function Core.Object.BeginState
// [0x00020800] ( FUNC_Event )
struct UObject_eventBeginState_Parms
{
	struct FName                                       PreviousStateName;                                		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function Core.Object.BreakPoint
// [0x00024401] ( FUNC_Final | FUNC_Native )
struct UObject_execBreakPoint_Parms
{
	class UObject*                                     SomeObject;                                       		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function Core.Object.PrintScriptStack
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UObject_execPrintScriptStack_Parms
{
};

// Function Core.Object.DumpStateStack
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UObject_execDumpStateStack_Parms
{
};

// Function Core.Object.PopState
// [0x00024401] ( FUNC_Final | FUNC_Native )
struct UObject_execPopState_Parms
{
	unsigned long                                      bPopAll : 1;                                      		// 0x0000 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
};

// Function Core.Object.PushState
// [0x00024401] ( FUNC_Final | FUNC_Native )
struct UObject_execPushState_Parms
{
	struct FName                                       NewState;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       NewLabel;                                         		// 0x0008 (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function Core.Object.GetStateName
// [0x00020401] ( FUNC_Final | FUNC_Native ) iNative [0x011C]
struct UObject_execGetStateName_Parms
{
	struct FName                                       ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.IsChildState
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UObject_execIsChildState_Parms
{
	struct FName                                       TestState;                                        		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       TestParentState;                                  		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.IsInState
// [0x00024401] ( FUNC_Final | FUNC_Native ) iNative [0x0119]
struct UObject_execIsInState_Parms
{
	struct FName                                       TestState;                                        		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bTestStateStack : 1;                              		// 0x0008 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.GotoState
// [0x00024401] ( FUNC_Final | FUNC_Native ) iNative [0x0071]
struct UObject_execGotoState_Parms
{
	struct FName                                       NewState;                                         		// 0x0000 (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	struct FName                                       Label;                                            		// 0x0008 (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bForceEvents : 1;                                 		// 0x0010 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bKeepStack : 1;                                   		// 0x0014 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
};

// Function Core.Object.IsUTracing
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UObject_execIsUTracing_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.SetUTracing
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UObject_execSetUTracing_Parms
{
	unsigned long                                      bShouldUTrace : 1;                                		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function Core.Object.GetFuncName
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UObject_execGetFuncName_Parms
{
	struct FName                                       ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.DebugBreak
// [0x00026401] ( FUNC_Final | FUNC_Native )
struct UObject_execDebugBreak_Parms
{
	int                                                UserFlags;                                        		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned char                                      DebuggerType;                                     		// 0x0004 (0x0001) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function Core.Object.GetScriptTrace
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UObject_execGetScriptTrace_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function Core.Object.ScriptTrace
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UObject_execScriptTrace_Parms
{
};

// Function Core.Object.ParseLocalizedPropertyPath
// [0x00022003] ( FUNC_Final )
struct UObject_execParseLocalizedPropertyPath_Parms
{
	struct FString                                     PathName;                                         		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     ReturnValue;                                      		// 0x000C (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
	// TArray< struct FString >                        Pieces;                                           		// 0x0018 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function Core.Object.Localize
// [0x00022400] ( FUNC_Native )
struct UObject_execLocalize_Parms
{
	struct FString                                     SectionName;                                      		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     KeyName;                                          		// 0x000C (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     PackageName;                                      		// 0x0018 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     ReturnValue;                                      		// 0x0024 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function Core.Object.LogIndentedInternal
// [0x00046401] ( FUNC_Final | FUNC_Native )
struct UObject_execLogIndentedInternal_Parms
{
	struct FString                                     S;                                                		// 0x0000 (0x000C) [0x0000000000400880]              ( CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink )
	struct FName                                       LogTag;                                           		// 0x000C (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                IndentationLevelChange;                           		// 0x0014 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function Core.Object.WarnInternal
// [0x00042401] ( FUNC_Final | FUNC_Native ) iNative [0x00E8]
struct UObject_execWarnInternal_Parms
{
	struct FString                                     S;                                                		// 0x0000 (0x000C) [0x0000000000400880]              ( CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink )
};

// Function Core.Object.LogInternal
// [0x00046401] ( FUNC_Final | FUNC_Native ) iNative [0x00E7]
struct UObject_execLogInternal_Parms
{
	struct FString                                     S;                                                		// 0x0000 (0x000C) [0x0000000000400880]              ( CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink )
	struct FName                                       Tag;                                              		// 0x000C (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function Core.Object.GetStringForNameBasedObjectPath
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UObject_execGetStringForNameBasedObjectPath_Parms
{
	struct FNameBasedObjectPath                        ObjectPath;                                       		// 0x0000 (0x0034) [0x0000000000000082]              ( CPF_Const | CPF_Parm )
	struct FString                                     ReturnValue;                                      		// 0x0034 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function Core.Object.SetNameBasedObjectPath
// [0x00422401] ( FUNC_Final | FUNC_Native )
struct UObject_execSetNameBasedObjectPath_Parms
{
	struct FNameBasedObjectPath                        ObjectPath;                                       		// 0x0000 (0x0034) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	class UObject*                                     Object;                                           		// 0x0034 (0x0004) [0x0000000000000082]              ( CPF_Const | CPF_Parm )
};

// Function Core.Object.FlagHasBeenTrueFor
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct UObject_execFlagHasBeenTrueFor_Parms
{
	struct FFlag                                       theFlag;                                          		// 0x0000 (0x0010) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	float                                              TimeSeconds;                                      		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.FlagTimeRemaining
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct UObject_execFlagTimeRemaining_Parms
{
	struct FFlag                                       theFlag;                                          		// 0x0000 (0x0010) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	float                                              ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.FlagTimeSinceRaised
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct UObject_execFlagTimeSinceRaised_Parms
{
	struct FFlag                                       theFlag;                                          		// 0x0000 (0x0010) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	float                                              ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.FlagSetValue
// [0x00424401] ( FUNC_Final | FUNC_Native )
struct UObject_execFlagSetValue_Parms
{
	struct FFlag                                       theFlag;                                          		// 0x0000 (0x0010) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      bNewValue : 1;                                    		// 0x0010 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	unsigned long                                      bForceTimeStamp : 1;                              		// 0x0014 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
};

// Function Core.Object.FlagIsLowered
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct UObject_execFlagIsLowered_Parms
{
	struct FFlag                                       theFlag;                                          		// 0x0000 (0x0010) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.FlagIsRaised
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct UObject_execFlagIsRaised_Parms
{
	struct FFlag                                       theFlag;                                          		// 0x0000 (0x0010) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.FlagIsFalse
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct UObject_execFlagIsFalse_Parms
{
	struct FFlag                                       theFlag;                                          		// 0x0000 (0x0010) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.FlagIsTrue
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct UObject_execFlagIsTrue_Parms
{
	struct FFlag                                       theFlag;                                          		// 0x0000 (0x0010) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.FlagSetTrueTimed
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct UObject_execFlagSetTrueTimed_Parms
{
	struct FFlag                                       theFlag;                                          		// 0x0000 (0x0010) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	float                                              Duration;                                         		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Core.Object.SmartVectTimeRemaining
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct UObject_execSmartVectTimeRemaining_Parms
{
	struct FSmartVector                                theSV;                                            		// 0x0000 (0x001C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	float                                              ReturnValue;                                      		// 0x001C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.SmartVectTimeSinceSet
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct UObject_execSmartVectTimeSinceSet_Parms
{
	struct FSmartVector                                theSV;                                            		// 0x0000 (0x001C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	float                                              ReturnValue;                                      		// 0x001C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.SmartVectGetVector
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct UObject_execSmartVectGetVector_Parms
{
	struct FSmartVector                                theSV;                                            		// 0x0000 (0x001C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	struct FVector                                     OutVector;                                        		// 0x001C (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0028 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.SmartVectIsSet
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct UObject_execSmartVectIsSet_Parms
{
	struct FSmartVector                                theSV;                                            		// 0x0000 (0x001C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x001C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.SmartVectSetVectorTimed
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct UObject_execSmartVectSetVectorTimed_Parms
{
	struct FSmartVector                                theSV;                                            		// 0x0000 (0x001C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	struct FVector                                     InVector;                                         		// 0x001C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	float                                              Duration;                                         		// 0x0028 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Core.Object.SmartVectValue
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct UObject_execSmartVectValue_Parms
{
	struct FSmartVector                                theSV;                                            		// 0x0000 (0x001C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	struct FVector                                     ReturnValue;                                      		// 0x001C (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.SmartVectReset
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct UObject_execSmartVectReset_Parms
{
	struct FSmartVector                                theSV;                                            		// 0x0000 (0x001C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function Core.Object.SmartVectSetVector
// [0x00424401] ( FUNC_Final | FUNC_Native )
struct UObject_execSmartVectSetVector_Parms
{
	struct FSmartVector                                theSV;                                            		// 0x0000 (0x001C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	struct FVector                                     InVector;                                         		// 0x001C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bUpdateTime : 1;                                  		// 0x0028 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
};

// Function Core.Object.Subtract_LinearColorLinearColor
// [0x00023003] ( FUNC_Final )
struct UObject_execSubtract_LinearColorLinearColor_Parms
{
	struct FLinearColor                                A;                                                		// 0x0000 (0x0010) [0x0000000000000080]              ( CPF_Parm )
	struct FLinearColor                                B;                                                		// 0x0010 (0x0010) [0x0000000000000080]              ( CPF_Parm )
	struct FLinearColor                                ReturnValue;                                      		// 0x0020 (0x0010) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.Multiply_LinearColorFloat
// [0x00023003] ( FUNC_Final )
struct UObject_execMultiply_LinearColorFloat_Parms
{
	struct FLinearColor                                LC;                                               		// 0x0000 (0x0010) [0x0000000000000080]              ( CPF_Parm )
	float                                              Mult;                                             		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FLinearColor                                ReturnValue;                                      		// 0x0014 (0x0010) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.ColorToLinearColor
// [0x00022003] ( FUNC_Final )
struct UObject_execColorToLinearColor_Parms
{
	struct FColor                                      OldColor;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FLinearColor                                ReturnValue;                                      		// 0x0004 (0x0010) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.MakeLinearColor
// [0x00822003] ( FUNC_Final )
struct UObject_execMakeLinearColor_Parms
{
	float                                              R;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              G;                                                		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              B;                                                		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              A;                                                		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FLinearColor                                ReturnValue;                                      		// 0x0010 (0x0010) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FLinearColor                             LC;                                               		// 0x0020 (0x0010) [0x0000000000000000]
};

// Function Core.Object.GetHTMLColor
// [0x00422401] ( FUNC_Final | FUNC_Native )
struct UObject_execGetHTMLColor_Parms
{
	struct FColor                                      C;                                                		// 0x0000 (0x0004) [0x0000000000000182]              ( CPF_Const | CPF_Parm | CPF_OutParm )
	struct FString                                     ReturnValue;                                      		// 0x0004 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function Core.Object.LerpColor
// [0x00822003] ( FUNC_Final )
struct UObject_execLerpColor_Parms
{
	struct FColor                                      A;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FColor                                      B;                                                		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              Alpha;                                            		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FColor                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FVector                                  FloatA;                                           		// 0x0010 (0x000C) [0x0000000000000000]
	// struct FVector                                  FloatB;                                           		// 0x001C (0x000C) [0x0000000000000000]
	// struct FVector                                  FloatResult;                                      		// 0x0028 (0x000C) [0x0000000000000000]
	// struct FColor                                   Result;                                           		// 0x0040 (0x0004) [0x0000000000000000]
};

// Function Core.Object.MakeColor
// [0x00826003] ( FUNC_Final )
struct UObject_execMakeColor_Parms
{
	unsigned char                                      R;                                                		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      G;                                                		// 0x0001 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      B;                                                		// 0x0002 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      A;                                                		// 0x0003 (0x0001) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	struct FColor                                      ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FColor                                   C;                                                		// 0x0008 (0x0004) [0x0000000000000000]
};

// Function Core.Object.Add_ColorColor
// [0x00023003] ( FUNC_Final )
struct UObject_execAdd_ColorColor_Parms
{
	struct FColor                                      A;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FColor                                      B;                                                		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FColor                                      ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.Multiply_ColorFloat
// [0x00023003] ( FUNC_Final )
struct UObject_execMultiply_ColorFloat_Parms
{
	struct FColor                                      A;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              B;                                                		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FColor                                      ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.Multiply_FloatColor
// [0x00023003] ( FUNC_Final )
struct UObject_execMultiply_FloatColor_Parms
{
	float                                              A;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FColor                                      B;                                                		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FColor                                      ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.Subtract_ColorColor
// [0x00023003] ( FUNC_Final )
struct UObject_execSubtract_ColorColor_Parms
{
	struct FColor                                      A;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FColor                                      B;                                                		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FColor                                      ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.EvalInterpCurveVector2D
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UObject_execEvalInterpCurveVector2D_Parms
{
	struct FInterpCurveVector2D                        Vector2DCurve;                                    		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	float                                              InVal;                                            		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector2D                                   ReturnValue;                                      		// 0x0014 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.EvalInterpCurveVector
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UObject_execEvalInterpCurveVector_Parms
{
	struct FInterpCurveVector                          VectorCurve;                                      		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	float                                              InVal;                                            		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     ReturnValue;                                      		// 0x0014 (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.EvalInterpCurveFloat
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UObject_execEvalInterpCurveFloat_Parms
{
	struct FInterpCurveFloat                           FloatCurve;                                       		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	float                                              InVal;                                            		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x0014 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.vect2d
// [0x00822003] ( FUNC_Final )
struct UObject_execvect2d_Parms
{
	float                                              InX;                                              		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              InY;                                              		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector2D                                   ReturnValue;                                      		// 0x0008 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FVector2D                                NewVect2d;                                        		// 0x0010 (0x0008) [0x0000000000000000]
};

// Function Core.Object.GetMappedRangeValue
// [0x00022501] ( FUNC_Final | FUNC_Native )
struct UObject_execGetMappedRangeValue_Parms
{
	struct FVector2D                                   InputRange;                                       		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FVector2D                                   OutputRange;                                      		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              Value;                                            		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x0014 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.GetRangePctByValue
// [0x00022103] ( FUNC_Final )
struct UObject_execGetRangePctByValue_Parms
{
	struct FVector2D                                   Range;                                            		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              Value;                                            		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Core.Object.GetRangeValueByPct
// [0x00022103] ( FUNC_Final )
struct UObject_execGetRangeValueByPct_Parms
{
	struct FVector2D                                   Range;                                            		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              Pct;                                              		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

