#include "BL2-SDK.h"
/*
#############################################################################################
# Borderlands 2 (1.7) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: Engine_f_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function Engine.IWorldBody.WorldBodyAttachComponent
// [0x00024400] ( FUNC_Native )
struct UIWorldBody_execWorldBodyAttachComponent_Parms
{
	class UActorComponent*                             Attachment;                                       		// 0x0000 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	struct FVector                                     AttachmentRelativeLocation;                       		// 0x0004 (0x000C) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	struct FRotator                                    AttachmentRelativeRotation;                       		// 0x0010 (0x000C) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	struct FName                                       AttachmentPointName;                              		// 0x001C (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0024 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.IWorldBody.WorldBodyAttachActor
// [0x00024400] ( FUNC_Native )
struct UIWorldBody_execWorldBodyAttachActor_Parms
{
	class AActor*                                      Attachment;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     AttachmentRelativeLocation;                       		// 0x0004 (0x000C) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	struct FRotator                                    AttachmentRelativeRotation;                       		// 0x0010 (0x000C) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	struct FName                                       AttachmentPointName;                              		// 0x001C (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0024 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.IWorldBody.WorldBodyAttachTo
// [0x00024400] ( FUNC_Native )
struct UIWorldBody_execWorldBodyAttachTo_Parms
{
	class UIWorldBody*                                 OtherWorldBody;                                   		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     AttachmentRelativeLocation;                       		// 0x0008 (0x000C) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	struct FRotator                                    AttachmentRelativeRotation;                       		// 0x0014 (0x000C) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	struct FName                                       AttachmentPointName;                              		// 0x0020 (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0028 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.IWorldBody.GetWorldBodyAttachmentBoneForComponent
// [0x00020400] ( FUNC_Native )
struct UIWorldBody_execGetWorldBodyAttachmentBoneForComponent_Parms
{
	class UActorComponent*                             AttachedComponent;                                		// 0x0000 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	struct FName                                       ReturnValue;                                      		// 0x0004 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.IWorldBody.GetWorldBodyAttachmentLocationAndRotation
// [0x00420400] ( FUNC_Native )
struct UIWorldBody_execGetWorldBodyAttachmentLocationAndRotation_Parms
{
	struct FName                                       AttachmentPointName;                              		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     OutLocation;                                      		// 0x0008 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	struct FRotator                                    OutRotation;                                      		// 0x0014 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0020 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.IWorldBody.GetWorldBodyAttachmentRotation
// [0x00420400] ( FUNC_Native )
struct UIWorldBody_execGetWorldBodyAttachmentRotation_Parms
{
	struct FName                                       AttachmentPointName;                              		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FRotator                                    OutRotation;                                      		// 0x0008 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.IWorldBody.GetWorldBodyAttachmentLocation
// [0x00420400] ( FUNC_Native )
struct UIWorldBody_execGetWorldBodyAttachmentLocation_Parms
{
	struct FName                                       AttachmentPointName;                              		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     OutLocation;                                      		// 0x0008 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.IWorldBody.GetWorldBodyAttachmentBase
// [0x00020400] ( FUNC_Native )
struct UIWorldBody_execGetWorldBodyAttachmentBase_Parms
{
	class UIWorldBody*                                 ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.IWorldBody.GetWorldBodyVelocity
// [0x00020400] ( FUNC_Native )
struct UIWorldBody_execGetWorldBodyVelocity_Parms
{
	struct FVector                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.IWorldBody.GetWorldBodyRotation
// [0x00020400] ( FUNC_Native )
struct UIWorldBody_execGetWorldBodyRotation_Parms
{
	struct FRotator                                    ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.IWorldBody.GetWorldBodyLocation
// [0x00020400] ( FUNC_Native )
struct UIWorldBody_execGetWorldBodyLocation_Parms
{
	struct FVector                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.IsWaterVolume
// [0x00020400] ( FUNC_Native )
struct AActor_execIsWaterVolume_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.GetControllerResponsibleForDamage
// [0x00020400] ( FUNC_Native )
struct AActor_execGetControllerResponsibleForDamage_Parms
{
	class AController*                                 ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.GetInstigator
// [0x00020400] ( FUNC_Native )
struct AActor_execGetInstigator_Parms
{
	class AActor*                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.GetInstigatorSelfDamageScale
// [0x00020400] ( FUNC_Native )
struct AActor_execGetInstigatorSelfDamageScale_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.GetFireIntervalChanceModifier
// [0x00020400] ( FUNC_Native )
struct AActor_execGetFireIntervalChanceModifier_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.GetStatusEffectBaseChanceModifier
// [0x00020400] ( FUNC_Native )
struct AActor_execGetStatusEffectBaseChanceModifier_Parms
{
	class UObject*                                     Context;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.GetStatusEffectChanceModifier
// [0x00020400] ( FUNC_Native )
struct AActor_execGetStatusEffectChanceModifier_Parms
{
	class UObject*                                     Context;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.GetStatusEffectBaseDamage
// [0x00020400] ( FUNC_Native )
struct AActor_execGetStatusEffectBaseDamage_Parms
{
	class UObject*                                     Context;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.WaitingForAttachmentBase
// [0x00020102]
struct AActor_execWaitingForAttachmentBase_Parms
{
	// class UIWorldBody*                              BaseInterface;                                    		// 0x0000 (0x0008) [0x0000000000000000]
	// class UIWorldBody*                              AttachmentBaseInterface;                          		// 0x0008 (0x0008) [0x0000000000000000]
};

// Function Engine.Actor.Behavior_ChangeVisibility
// [0x00020102]
struct AActor_execBehavior_ChangeVisibility_Parms
{
	unsigned long                                      bVisible : 1;                                     		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function Engine.Actor.Behavior_ToggleVisibility
// [0x00020102]
struct AActor_execBehavior_ToggleVisibility_Parms
{
};

// Function Engine.Actor.Behavior_ChangeCollisionSize
// [0x00020102]
struct AActor_execBehavior_ChangeCollisionSize_Parms
{
	float                                              NewRadius;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              NewHeight;                                        		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.Behavior_ChangeCollision
// [0x00020102]
struct AActor_execBehavior_ChangeCollision_Parms
{
	unsigned char                                      NewCollisionType;                                 		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.GetDamageVector
// [0x00020002]
struct AActor_execGetDamageVector_Parms
{
	struct FVector                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.GetRigidBodyMesh
// [0x00020002]
struct AActor_execGetRigidBodyMesh_Parms
{
	class UMeshComponent*                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000004000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_EditInline )
};

// Function Engine.Actor.ClientConsoleCommand
// [0x010201C2]
struct AActor_execClientConsoleCommand_Parms
{
	struct FString                                     Command;                                          		// 0x0000 (0x000C) [0x0000000000400082]              ( CPF_Const | CPF_Parm | CPF_NeedCtorLink )
};

// Function Engine.Actor.Behavior_ClientConsoleCommand
// [0x00020002]
struct AActor_execBehavior_ClientConsoleCommand_Parms
{
	struct FString                                     Command;                                          		// 0x0000 (0x000C) [0x0000000000400082]              ( CPF_Const | CPF_Parm | CPF_NeedCtorLink )
};

// Function Engine.Actor.Behavior_ConsoleCommand
// [0x00020002]
struct AActor_execBehavior_ConsoleCommand_Parms
{
	struct FString                                     Command;                                          		// 0x0000 (0x000C) [0x0000000000400082]              ( CPF_Const | CPF_Parm | CPF_NeedCtorLink )
};

// Function Engine.Actor.Behavior_StopSound
// [0x00024102]
struct AActor_execBehavior_StopSound_Parms
{
	class USoundCue*                                   Sound;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bNoRepToOwner : 1;                                		// 0x0004 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	float                                              FadeOutTime;                                      		// 0x0008 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function Engine.Actor.Behavior_PlaySoundForListener
// [0x00020102]
struct AActor_execBehavior_PlaySoundForListener_Parms
{
	class USoundCue*                                   Sound;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      Source;                                           		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class APlayerController*                           Listener;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.Behavior_PlaySound
// [0x00020102]
struct AActor_execBehavior_PlaySound_Parms
{
	class USoundCue*                                   Sound;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bReplicateSound : 1;                              		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function Engine.Actor.Behavior_PostAkEvent
// [0x00020102]
struct AActor_execBehavior_PostAkEvent_Parms
{
	class UAkEvent*                                    Event;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bReplicateEvent : 1;                              		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	struct FAkPlayingInfo                              ReturnValue;                                      		// 0x0008 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.Behavior_Destroy
// [0x00020102]
struct AActor_execBehavior_Destroy_Parms
{
};

// Function Engine.Actor.ClearResourcePoolReference
// [0x00422401] ( FUNC_Final | FUNC_Native )
struct AActor_execClearResourcePoolReference_Parms
{
	struct FResourcePoolReference                      PoolReference;                                    		// 0x0000 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function Engine.Actor.GetResourcePoolCurrentValueOrDefault
// [0x00422401] ( FUNC_Final | FUNC_Native )
struct AActor_execGetResourcePoolCurrentValueOrDefault_Parms
{
	struct FResourcePoolReference                      PoolReference;                                    		// 0x0000 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	float                                              DefaultValue;                                     		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.IsResourcePoolValid
// [0x00422401] ( FUNC_Final | FUNC_Native )
struct AActor_execIsResourcePoolValid_Parms
{
	struct FResourcePoolReference                      PoolReference;                                    		// 0x0000 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.GetCanTargetCheat
// [0x00020400] ( FUNC_Native )
struct AActor_execGetCanTargetCheat_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.GetCanTarget
// [0x00020400] ( FUNC_Native )
struct AActor_execGetCanTarget_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.SetCanTargetCheat
// [0x00020400] ( FUNC_Native )
struct AActor_execSetCanTargetCheat_Parms
{
	unsigned long                                      bCanTargetIn : 1;                                 		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function Engine.Actor.CanTarget
// [0x00020400] ( FUNC_Native )
struct AActor_execCanTarget_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.SetCanTarget
// [0x00020400] ( FUNC_Native )
struct AActor_execSetCanTarget_Parms
{
	unsigned long                                      bCanTargetIn : 1;                                 		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function Engine.Actor.WorldBodyAttachComponent
// [0x00024401] ( FUNC_Final | FUNC_Native )
struct AActor_execWorldBodyAttachComponent_Parms
{
	class UActorComponent*                             Attachment;                                       		// 0x0000 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	struct FVector                                     AttachmentRelativeLocation;                       		// 0x0004 (0x000C) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	struct FRotator                                    AttachmentRelativeRotation;                       		// 0x0010 (0x000C) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	struct FName                                       AttachmentPointName;                              		// 0x001C (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0024 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.WorldBodyAttachActor
// [0x00024401] ( FUNC_Final | FUNC_Native )
struct AActor_execWorldBodyAttachActor_Parms
{
	class AActor*                                      Attachment;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     AttachmentRelativeLocation;                       		// 0x0004 (0x000C) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	struct FRotator                                    AttachmentRelativeRotation;                       		// 0x0010 (0x000C) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	struct FName                                       AttachmentPointName;                              		// 0x001C (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0024 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.WorldBodyAttachTo
// [0x00024401] ( FUNC_Final | FUNC_Native )
struct AActor_execWorldBodyAttachTo_Parms
{
	class UIWorldBody*                                 OtherWorldBody;                                   		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     AttachmentRelativeLocation;                       		// 0x0008 (0x000C) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	struct FRotator                                    AttachmentRelativeRotation;                       		// 0x0014 (0x000C) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	struct FName                                       AttachmentPointName;                              		// 0x0020 (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0028 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.GetWorldBodyAttachmentBase
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct AActor_execGetWorldBodyAttachmentBase_Parms
{
	class UIWorldBody*                                 ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.GetWorldBodyAttachmentBoneForComponent
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct AActor_execGetWorldBodyAttachmentBoneForComponent_Parms
{
	class UActorComponent*                             AttachedComponent;                                		// 0x0000 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	struct FName                                       ReturnValue;                                      		// 0x0004 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.GetWorldBodyAttachmentLocationAndRotation
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct AActor_execGetWorldBodyAttachmentLocationAndRotation_Parms
{
	struct FName                                       AttachmentPointName;                              		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     OutLocation;                                      		// 0x0008 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	struct FRotator                                    OutRotation;                                      		// 0x0014 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0020 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.GetWorldBodyAttachmentRotation
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct AActor_execGetWorldBodyAttachmentRotation_Parms
{
	struct FName                                       AttachmentPointName;                              		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FRotator                                    OutRotation;                                      		// 0x0008 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.GetWorldBodyAttachmentLocation
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct AActor_execGetWorldBodyAttachmentLocation_Parms
{
	struct FName                                       AttachmentPointName;                              		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     OutLocation;                                      		// 0x0008 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.GetWorldBodyVelocity
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct AActor_execGetWorldBodyVelocity_Parms
{
	struct FVector                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.GetWorldBodyRotation
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct AActor_execGetWorldBodyRotation_Parms
{
	struct FRotator                                    ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.GetWorldBodyLocation
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct AActor_execGetWorldBodyLocation_Parms
{
	struct FVector                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.GetSpawnOwner
// [0x00020002]
struct AActor_execGetSpawnOwner_Parms
{
	class AActor*                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.GetActorMetrics
// [0x00020500] ( FUNC_Native )
struct AActor_execGetActorMetrics_Parms
{
	unsigned char                                      MetricsType;                                      		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.ShouldBeHiddenBySHOW_NavigationNodes
// [0x00020400] ( FUNC_Native )
struct AActor_execShouldBeHiddenBySHOW_NavigationNodes_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.WillOverlap
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct AActor_execWillOverlap_Parms
{
	struct FVector                                     PosA;                                             		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     VelA;                                             		// 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     PosB;                                             		// 0x0018 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     VelB;                                             		// 0x0024 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	float                                              StepSize;                                         		// 0x0030 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              Radius;                                           		// 0x0034 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              Time;                                             		// 0x0038 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x003C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.ReplicationEnded
// [0x00020900] ( FUNC_Event )
struct AActor_eventReplicationEnded_Parms
{
};

// Function Engine.Actor.SetDebugBeaconState
// [0x00024002]
struct AActor_execSetDebugBeaconState_Parms
{
	unsigned long                                      bEnabled : 1;                                     		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	struct FColor                                      BeaconColor;                                      		// 0x0004 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	// class UArrowComponent*                          BeaconArrow;                                      		// 0x0008 (0x0004) [0x0000000004000000]              ( CPF_EditInline )
};

// Function Engine.Actor.PostDemoRewind
// [0x00020900] ( FUNC_Event )
struct AActor_eventPostDemoRewind_Parms
{
};

// Function Engine.Actor.AnimTreeUpdated
// [0x00020900] ( FUNC_Event )
struct AActor_eventAnimTreeUpdated_Parms
{
	class USkeletalMeshComponent*                      SkelMesh;                                         		// 0x0000 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
};

// Function Engine.Actor.SupportsKismetModification
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct AActor_execSupportsKismetModification_Parms
{
	class USequenceOp*                                 AskingOp;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     Reason;                                           		// 0x0004 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.TrailsNotifyEnd
// [0x00020800] ( FUNC_Event )
struct AActor_eventTrailsNotifyEnd_Parms
{
	class UAnimNotify_Trails*                          AnimNotifyData;                                   		// 0x0000 (0x0004) [0x0000000000000082]              ( CPF_Const | CPF_Parm )
};

// Function Engine.Actor.TrailsNotifyTick
// [0x00020800] ( FUNC_Event )
struct AActor_eventTrailsNotifyTick_Parms
{
	class UAnimNotify_Trails*                          AnimNotifyData;                                   		// 0x0000 (0x0004) [0x0000000000000082]              ( CPF_Const | CPF_Parm )
};

// Function Engine.Actor.TrailsNotify
// [0x00020800] ( FUNC_Event )
struct AActor_eventTrailsNotify_Parms
{
	class UAnimNotify_Trails*                          AnimNotifyData;                                   		// 0x0000 (0x0004) [0x0000000000000082]              ( CPF_Const | CPF_Parm )
};

// Function Engine.Actor.CreateForceField
// [0x00020802] ( FUNC_Event )
struct AActor_eventCreateForceField_Parms
{
	class UAnimNotify_ForceField*                      AnimNotifyData;                                   		// 0x0000 (0x0004) [0x0000000000000082]              ( CPF_Const | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.PlayParticleEffect
// [0x00020802] ( FUNC_Event )
struct AActor_eventPlayParticleEffect_Parms
{
	class UAnimNotify_PlayParticleEffect*              AnimNotifyData;                                   		// 0x0000 (0x0004) [0x0000000000000082]              ( CPF_Const | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.IsInPersistentLevel
// [0x00024401] ( FUNC_Final | FUNC_Native )
struct AActor_execIsInPersistentLevel_Parms
{
	unsigned long                                      bIncludeLevelStreamingPersistent : 1;             		// 0x0000 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.OnRigidBodySpringOverextension
// [0x00020900] ( FUNC_Event )
struct AActor_eventOnRigidBodySpringOverextension_Parms
{
	class URB_BodyInstance*                            BodyInstance;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.GetPackageGuid
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct AActor_execGetPackageGuid_Parms
{
	struct FName                                       PackageName;                                      		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FGuid                                       ReturnValue;                                      		// 0x0008 (0x0010) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.PostInitAnimTree
// [0x00020800] ( FUNC_Event )
struct AActor_eventPostInitAnimTree_Parms
{
	class USkeletalMeshComponent*                      SkelComp;                                         		// 0x0000 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
};

// Function Engine.Actor.TraceTouch
// [0x00020800] ( FUNC_Event )
struct AActor_eventTraceTouch_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UComponent*                                  ComponentHit;                                     		// 0x0004 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	struct FVector                                     TouchLocation;                                    		// 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     TouchNormal;                                      		// 0x0014 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     End;                                              		// 0x0020 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     Start;                                            		// 0x002C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     Extent;                                           		// 0x0038 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	int                                                TraceFlags;                                       		// 0x0044 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              TouchTime;                                        		// 0x0048 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.RootMotionExtracted
// [0x00420900] ( FUNC_Event )
struct AActor_eventRootMotionExtracted_Parms
{
	class USkeletalMeshComponent*                      SkelComp;                                         		// 0x0000 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	struct FBoneAtom                                   ExtractedRootMotionDelta;                         		// 0x0010 (0x0020) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function Engine.Actor.RootMotionProcessed
// [0x00020900] ( FUNC_Event )
struct AActor_eventRootMotionProcessed_Parms
{
	class USkeletalMeshComponent*                      SkelComp;                                         		// 0x0000 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
};

// Function Engine.Actor.RootMotionModeChanged
// [0x00020900] ( FUNC_Event )
struct AActor_eventRootMotionModeChanged_Parms
{
	class USkeletalMeshComponent*                      SkelComp;                                         		// 0x0000 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
};

// Function Engine.Actor.PostRenderFor
// [0x00020900] ( FUNC_Event )
struct AActor_eventPostRenderFor_Parms
{
	class APlayerController*                           PC;                                               		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UCanvas*                                     Canvas;                                           		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     CameraPosition;                                   		// 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     CameraDir;                                        		// 0x0014 (0x000C) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.NativePostRenderFor
// [0x00020500] ( FUNC_Native )
struct AActor_execNativePostRenderFor_Parms
{
	class APlayerController*                           PC;                                               		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UCanvas*                                     Canvas;                                           		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     CameraPosition;                                   		// 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     CameraDir;                                        		// 0x0014 (0x000C) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.SetHUDLocation
// [0x00020500] ( FUNC_Native )
struct AActor_execSetHUDLocation_Parms
{
	struct FVector                                     NewHUDLocation;                                   		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.OnRanOver
// [0x00020800] ( FUNC_Event )
struct AActor_eventOnRanOver_Parms
{
	class ASVehicle*                                   Vehicle;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UPrimitiveComponent*                         RunOverComponent;                                 		// 0x0004 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	int                                                WheelIndex;                                       		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.RigidBodyCollision
// [0x00420800] ( FUNC_Event )
struct AActor_eventRigidBodyCollision_Parms
{
	class UPrimitiveComponent*                         HitComponent;                                     		// 0x0000 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	class UPrimitiveComponent*                         OtherComponent;                                   		// 0x0004 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	struct FCollisionImpactData                        RigidCollisionData;                               		// 0x0008 (0x0024) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	int                                                ContactIndex;                                     		// 0x002C (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.InterpolationChanged
// [0x00020900] ( FUNC_Event )
struct AActor_eventInterpolationChanged_Parms
{
	class USeqAct_Interp*                              InterpAction;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.InterpolationFinished
// [0x00020900] ( FUNC_Event )
struct AActor_eventInterpolationFinished_Parms
{
	class USeqAct_Interp*                              InterpAction;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.InterpolationStarted
// [0x00020900] ( FUNC_Event )
struct AActor_eventInterpolationStarted_Parms
{
	class USeqAct_Interp*                              InterpAction;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UInterpGroupInst*                            GroupInst;                                        		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.SpawnedByKismet
// [0x00020800] ( FUNC_Event )
struct AActor_eventSpawnedByKismet_Parms
{
};

// Function Engine.Actor.GetTargetLocation
// [0x00024500] ( FUNC_Native )
struct AActor_execGetTargetLocation_Parms
{
	class AActor*                                      RequestedBy;                                      		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bRequestAlternateLoc : 1;                         		// 0x0004 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	struct FVector                                     ReturnValue;                                      		// 0x0008 (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.FindGoodEndView
// [0x00420102]
struct AActor_execFindGoodEndView_Parms
{
	class APlayerController*                           PC;                                               		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FRotator                                    GoodRotation;                                     		// 0x0004 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function Engine.Actor.NotifyLocalPlayerTeamReceived
// [0x00020100]
struct AActor_execNotifyLocalPlayerTeamReceived_Parms
{
};

// Function Engine.Actor.ScriptGetTeamNum
// [0x00020902] ( FUNC_Event )
struct AActor_eventScriptGetTeamNum_Parms
{
	unsigned char                                      ReturnValue;                                      		// 0x0000 (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.GetTeamNum
// [0x00020500] ( FUNC_Native )
struct AActor_execGetTeamNum_Parms
{
	unsigned char                                      ReturnValue;                                      		// 0x0000 (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.PawnBaseDied
// [0x00020000]
struct AActor_execPawnBaseDied_Parms
{
};

// Function Engine.Actor.IsPlayerOwned
// [0x00020500] ( FUNC_Native )
struct AActor_execIsPlayerOwned_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.GetSpotOthersShouldLookAt
// [0x00020902] ( FUNC_Event )
struct AActor_eventGetSpotOthersShouldLookAt_Parms
{
	struct FVector                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.GetActorEyesViewPoint
// [0x00420500] ( FUNC_Native )
struct AActor_execGetActorEyesViewPoint_Parms
{
	struct FVector                                     out_Location;                                     		// 0x0000 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	struct FRotator                                    out_Rotation;                                     		// 0x000C (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function Engine.Actor.GetActorFaceFXAsset
// [0x00020800] ( FUNC_Event )
struct AActor_eventGetActorFaceFXAsset_Parms
{
	class UFaceFXAsset*                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.CanActorPlayFaceFXAnim
// [0x00020102]
struct AActor_execCanActorPlayFaceFXAnim_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.IsActorPlayingFaceFXAnim
// [0x00020102]
struct AActor_execIsActorPlayingFaceFXAnim_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.TickSkelControl
// [0x00020800] ( FUNC_Event )
struct AActor_eventTickSkelControl_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class USkeletalMeshComponent*                      SkelComp;                                         		// 0x0004 (0x0004) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	class USkelControlBase*                            SkelCtrl;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.SetSkelControlScale
// [0x00020800] ( FUNC_Event )
struct AActor_eventSetSkelControlScale_Parms
{
	struct FName                                       SkelControlName;                                  		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              Scale;                                            		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.SetMorphWeight
// [0x00020800] ( FUNC_Event )
struct AActor_eventSetMorphWeight_Parms
{
	struct FName                                       MorphNodeName;                                    		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              MorphWeight;                                      		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.StopActorFaceFXAnim
// [0x00020800] ( FUNC_Event )
struct AActor_eventStopActorFaceFXAnim_Parms
{
};

// Function Engine.Actor.PlayActorFaceFXAnim
// [0x00020800] ( FUNC_Event )
struct AActor_eventPlayActorFaceFXAnim_Parms
{
	class UFaceFXAnimSet*                              AnimSet;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     GroupName;                                        		// 0x0004 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     SeqName;                                          		// 0x0010 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class USoundCue*                                   SoundCueToPlay;                                   		// 0x001C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UAkEvent*                                    AkEventToPlay;                                    		// 0x0020 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0024 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function Engine.Actor.FinishAnimControl
// [0x00020800] ( FUNC_Event )
struct AActor_eventFinishAnimControl_Parms
{
	class UInterpGroup*                                InInterpGroup;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.LastMatineeAnimFinished
// [0x00020400] ( FUNC_Native )
struct AActor_execLastMatineeAnimFinished_Parms
{
};

// Function Engine.Actor.SetAnimPosition
// [0x00020800] ( FUNC_Event )
struct AActor_eventSetAnimPosition_Parms
{
	struct FName                                       SlotName;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                ChannelIndex;                                     		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       InAnimSeqName;                                    		// 0x000C (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              InPosition;                                       		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bFireNotifies : 1;                                		// 0x0018 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	unsigned long                                      bLooping : 1;                                     		// 0x001C (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	unsigned long                                      bEnableRootMotion : 1;                            		// 0x0020 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function Engine.Actor.BeginAnimControl
// [0x00020800] ( FUNC_Event )
struct AActor_eventBeginAnimControl_Parms
{
	class UInterpGroup*                                InInterpGroup;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.OnAnimPlay
// [0x00020800] ( FUNC_Event )
struct AActor_eventOnAnimPlay_Parms
{
	class UAnimNodeSequence*                           SeqNode;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.OnAnimEnd
// [0x00020800] ( FUNC_Event )
struct AActor_eventOnAnimEnd_Parms
{
	class UAnimNodeSequence*                           SeqNode;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              PlayedTime;                                       		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ExcessTime;                                       		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.DoKismetAttachment
// [0x00820002]
struct AActor_execDoKismetAttachment_Parms
{
	class AActor*                                      Attachment;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class USeqAct_AttachToActor*                       Action;                                           		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// struct FVector                                  X;                                                		// 0x0010 (0x000C) [0x0000000000000000]
	// struct FVector                                  Y;                                                		// 0x001C (0x000C) [0x0000000000000000]
	// struct FVector                                  Z;                                                		// 0x0028 (0x000C) [0x0000000000000000]
};

// Function Engine.Actor.OnAttachToActor
// [0x00020002]
struct AActor_execOnAttachToActor_Parms
{
	class USeqAct_AttachToActor*                       Action;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// TArray< class UObject* >                        objVars;                                          		// 0x0010 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function Engine.Actor.OnToggleHidden
// [0x00020102]
struct AActor_execOnToggleHidden_Parms
{
	class USeqAct_ToggleHidden*                        Action;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.OnChangeCollision
// [0x00020002]
struct AActor_execOnChangeCollision_Parms
{
	class USeqAct_ChangeCollision*                     Action;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.OnSetPhysics
// [0x00020102]
struct AActor_execOnSetPhysics_Parms
{
	class USeqAct_SetPhysics*                          Action;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.OnSetBlockRigidBody
// [0x00020102]
struct AActor_execOnSetBlockRigidBody_Parms
{
	class USeqAct_SetBlockRigidBody*                   Action;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.OnSetVelocity
// [0x00820102]
struct AActor_execOnSetVelocity_Parms
{
	class USeqAct_SetVelocity*                         Action;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// struct FVector                                  V;                                                		// 0x0004 (0x000C) [0x0000000000000000]
};

// Function Engine.Actor.OnTeleport
// [0x00820102]
struct AActor_execOnTeleport_Parms
{
	class USeqAct_Teleport*                            Action;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// TArray< class UObject* >                        objVars;                                          		// 0x0004 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// struct FVector                                  Extent;                                           		// 0x0034 (0x000C) [0x0000000000000000]
};

// Function Engine.Actor.ModifyHealth
// [0x00020802] ( FUNC_Event )
struct AActor_eventModifyHealth_Parms
{
	unsigned long                                      bHeal : 1;                                        		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	float                                              DamageAmount;                                     		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AController*                                 EventInstigator;                                  		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HitLocation;                                      		// 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     Momentum;                                         		// 0x0018 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	class UClass*                                      DamageType;                                       		// 0x0024 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UDamageTypeDefinition*                       DamageTypeDefinition;                             		// 0x0028 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UImpactDefinition*                           ImpactDefinition;                                 		// 0x002C (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.OnModifyHealth
// [0x00020102]
struct AActor_execOnModifyHealth_Parms
{
	class USeqAct_ModifyHealth*                        Action;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.PrestreamTextures
// [0x00024400] ( FUNC_Native )
struct AActor_execPrestreamTextures_Parms
{
	float                                              Seconds;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bEnableStreaming : 1;                             		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	int                                                CinematicTextureGroups;                           		// 0x0008 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function Engine.Actor.ShutDown
// [0x00020902] ( FUNC_Event )
struct AActor_eventShutDown_Parms
{
};

// Function Engine.Actor.SetNetUpdateTime
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct AActor_execSetNetUpdateTime_Parms
{
	float                                              NewUpdateTime;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function Engine.Actor.ForceNetRelevant
// [0x00020802] ( FUNC_Event )
struct AActor_eventForceNetRelevant_Parms
{
};

// Function Engine.Actor.OnDestroy
