#include "BL2-SDK.h"
/*
#############################################################################################
# Borderlands 2 (1.7) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: GearboxFramework_f_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function GearboxFramework.AIDebugCamera.ToggleAITree
// [0x00020002] 
struct UAIDebugCamera_execToggleAITree_Parms
{
};

// Function GearboxFramework.AIDebugCamera.ToggleTargetViewCones
// [0x00020002] 
struct UAIDebugCamera_execToggleTargetViewCones_Parms
{
};

// Function GearboxFramework.AIDebugCamera.ToggleAwarenessZones
// [0x00020002] 
struct UAIDebugCamera_execToggleAwarenessZones_Parms
{
};

// Function GearboxFramework.AIDebugCamera.ToggleRuleEngineLoadBalance
// [0x00020002] 
struct UAIDebugCamera_execToggleRuleEngineLoadBalance_Parms
{
};

// Function GearboxFramework.AIDebugCamera.ToggleCombat
// [0x00020002] 
struct UAIDebugCamera_execToggleCombat_Parms
{
};

// Function GearboxFramework.AIDebugCamera.ToggleShowTimers
// [0x00020002] 
struct UAIDebugCamera_execToggleShowTimers_Parms
{
};

// Function GearboxFramework.AIDebugCamera.ToggleResources
// [0x00020002] 
struct UAIDebugCamera_execToggleResources_Parms
{
};

// Function GearboxFramework.AIDebugCamera.ToggleInactiveRules
// [0x00020002] 
struct UAIDebugCamera_execToggleInactiveRules_Parms
{
};

// Function GearboxFramework.AIDebugCamera.ToggleRules
// [0x00020002] 
struct UAIDebugCamera_execToggleRules_Parms
{
};

// Function GearboxFramework.AIDebugCamera.ToggleFlags
// [0x00020002] 
struct UAIDebugCamera_execToggleFlags_Parms
{
};

// Function GearboxFramework.AIDebugCamera.GetTracker
// [0x00020400] ( FUNC_Native )
struct UAIDebugCamera_execGetTracker_Parms
{
	class UAITracker*                                  ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GearboxFramework.AIDebugCamera.SetMind
// [0x00020400] ( FUNC_Native )
struct UAIDebugCamera_execSetMind_Parms
{
	class AGearboxMind*                                NewMind;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GearboxFramework.AIDebugCamera.InitDummies
// [0x00020400] ( FUNC_Native )
struct UAIDebugCamera_execInitDummies_Parms
{
	int                                                NewNumDummies;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GearboxFramework.AIDebugCamera.WantsToDoCameraInspection
// [0x00020400] ( FUNC_Native )
struct UAIDebugCamera_execWantsToDoCameraInspection_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GearboxFramework.AIDebugCamera.SetCurrentInspectedTarget
// [0x00020400] ( FUNC_Native )
struct UAIDebugCamera_execSetCurrentInspectedTarget_Parms
{
	struct FName                                       NewName;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function GearboxFramework.AIDebugCamera.CompareRuleSetAndAdjustRuleIdx
// [0x00020400] ( FUNC_Native )
struct UAIDebugCamera_execCompareRuleSetAndAdjustRuleIdx_Parms
{
	class USnapshotRecord*                             OldSnapshot;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class USnapshotRecord*                             NewSnapshot;                                      		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GearboxFramework.AIDebugCamera.SetRuleEngine
// [0x00020400] ( FUNC_Native )
struct UAIDebugCamera_execSetRuleEngine_Parms
{
	class URuleEngine*                                 NewRuleEngine;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GearboxFramework.AIDebugCamera.SetPrevSnapshotRule
// [0x00020400] ( FUNC_Native )
struct UAIDebugCamera_execSetPrevSnapshotRule_Parms
{
};

// Function GearboxFramework.AIDebugCamera.SetNextSnapshotRule
// [0x00020400] ( FUNC_Native )
struct UAIDebugCamera_execSetNextSnapshotRule_Parms
{
};

// Function GearboxFramework.AIDebugCamera.SetPrevSnapshot
// [0x00020400] ( FUNC_Native )
struct UAIDebugCamera_execSetPrevSnapshot_Parms
{
};

// Function GearboxFramework.AIDebugCamera.SetNextSnapshot
// [0x00020400] ( FUNC_Native )
struct UAIDebugCamera_execSetNextSnapshot_Parms
{
};

// Function GearboxFramework.AIDebugCamera.NotifyGameUnPaused
// [0x00020400] ( FUNC_Native )
struct UAIDebugCamera_execNotifyGameUnPaused_Parms
{
};

// Function GearboxFramework.AIDebugCamera.NotifyGamePaused
// [0x00020400] ( FUNC_Native )
struct UAIDebugCamera_execNotifyGamePaused_Parms
{
};

// Function GearboxFramework.AIDebugCamera.Display
// [0x00020400] ( FUNC_Native )
struct UAIDebugCamera_execDisplay_Parms
{
	class AHUD*                                        HUD;                                              		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GearboxFramework.AnimNodeSpecialMoveBlend.IsPlaying
// [0x00020400] ( FUNC_Native )
struct UAnimNodeSpecialMoveBlend_execIsPlaying_Parms
{
	class UGearboxAnimDefinition*                      AnimSMD;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GearboxFramework.AnimNodeSpecialMoveBlend.SetRootMotion
// [0x00020400] ( FUNC_Native )
struct UAnimNodeSpecialMoveBlend_execSetRootMotion_Parms
{
	class URootMotionDefinition*                       RMDef;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GearboxFramework.AnimNodeSpecialMoveBlend.GetCurrentAnimDef
// [0x00020400] ( FUNC_Native )
struct UAnimNodeSpecialMoveBlend_execGetCurrentAnimDef_Parms
{
	class UGearboxAnimDefinition*                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GearboxFramework.AnimNodeSpecialMoveBlend.GetCurrentAnimName
// [0x00020400] ( FUNC_Native )
struct UAnimNodeSpecialMoveBlend_execGetCurrentAnimName_Parms
{
	struct FName                                       ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GearboxFramework.AnimNodeSpecialMoveBlend.Finish
// [0x00020400] ( FUNC_Native )
struct UAnimNodeSpecialMoveBlend_execFinish_Parms
{
	unsigned long                                      bInterrupted : 1;                                 		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function GearboxFramework.AnimNodeSpecialMoveBlend.Stop
// [0x00020400] ( FUNC_Native )
struct UAnimNodeSpecialMoveBlend_execStop_Parms
{
	unsigned long                                      bInterrupted : 1;                                 		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function GearboxFramework.AnimNodeSpecialMoveBlend.PlayData
// [0x00424400] ( FUNC_Native )
struct UAnimNodeSpecialMoveBlend_execPlayData_Parms
{
	struct FSpecialMoveData                            SMData;                                           		// 0x0000 (0x001C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	struct FName                                       AnimNameOverride;                                 		// 0x001C (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	float                                              PlayRateScale;                                    		// 0x0024 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	float                                              BlendInOverride;                                  		// 0x0028 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	float                                              BlendOutOverride;                                 		// 0x002C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	float                                              ReturnValue;                                      		// 0x0030 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GearboxFramework.AnimNodeSpecialMoveBlend.Play
// [0x00024400] ( FUNC_Native )
struct UAnimNodeSpecialMoveBlend_execPlay_Parms
{
	class UGearboxAnimDefinition*                      CustomAnimSMD;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       AnimNameOverride;                                 		// 0x0004 (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	float                                              PlayRateScale;                                    		// 0x000C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	float                                              BlendInOverride;                                  		// 0x0010 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	float                                              BlendOutOverride;                                 		// 0x0014 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	float                                              ReturnValue;                                      		// 0x0018 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GearboxFramework.AttributeExpressionEvaluator.Evaluate
// [0x00020400] ( FUNC_Native )
struct UAttributeExpressionEvaluator_execEvaluate_Parms
{
	class UObject*                                     ContextSource;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GearboxFramework.Behavior_CallFunction.CallFunction
// [0x00020500] ( FUNC_Native )
struct UBehavior_CallFunction_execCallFunction_Parms
{
	class AActor*                                      inActor;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       InFunctionName;                                   		// 0x0004 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function GearboxFramework.Behavior_CallFunction.ApplyBehaviorToContext
// [0x00480002] 
struct UBehavior_CallFunction_execApplyBehaviorToContext_Parms
{
	class UObject*                                     ContextObject;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FBehaviorKernelInfo                         KernelInfo;                                       		// 0x0004 (0x001C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	class UObject*                                     SelfObject;                                       		// 0x0020 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UObject*                                     MyInstigatorObject;                               		// 0x0024 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UObject*                                     OtherEventParticipantObject;                      		// 0x0028 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FBehaviorParameters                         EventData;                                        		// 0x002C (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function GearboxFramework.Behavior_ChangeRemoteBehaviorSequenceState.ApplyBehaviorToContext
// [0x00C80002] 
struct UBehavior_ChangeRemoteBehaviorSequenceState_execApplyBehaviorToContext_Parms
{
	class UObject*                                     ContextObject;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FBehaviorKernelInfo                         KernelInfo;                                       		// 0x0004 (0x001C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	class UObject*                                     SelfObject;                                       		// 0x0020 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UObject*                                     MyInstigatorObject;                               		// 0x0024 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UObject*                                     OtherEventParticipantObject;                      		// 0x0028 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FBehaviorParameters                         EventData;                                        		// 0x002C (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	// class UIBehaviorConsumer*                       Consumer;                                         		// 0x0038 (0x0008) [0x0000000000000000]              
	// struct FBehaviorConsumerHandle                  ConsumerHandle;                                   		// 0x0040 (0x0004) [0x0000000000000000]              
};

// Function GearboxFramework.Behavior_ChangeTimer.ApplyBehaviorToContext
// [0x00C80002] 
struct UBehavior_ChangeTimer_execApplyBehaviorToContext_Parms
{
	class UObject*                                     ContextObject;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FBehaviorKernelInfo                         KernelInfo;                                       		// 0x0004 (0x001C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	class UObject*                                     SelfObject;                                       		// 0x0020 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UObject*                                     MyInstigatorObject;                               		// 0x0024 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UObject*                                     OtherEventParticipantObject;                      		// 0x0028 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FBehaviorParameters                         EventData;                                        		// 0x002C (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	// class UITimerBehavior*                          ContextInterface;                                 		// 0x0038 (0x0008) [0x0000000000000000]              
	// struct FBehaviorTimerState                      TimerState;                                       		// 0x0040 (0x000C) [0x0000000000000000]              
};

// Function GearboxFramework.Behavior_IsSequenceEnabled.ApplyBehaviorToContext
// [0x00C80002] 
struct UBehavior_IsSequenceEnabled_execApplyBehaviorToContext_Parms
{
	class UObject*                                     ContextObject;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FBehaviorKernelInfo                         KernelInfo;                                       		// 0x0004 (0x001C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	class UObject*                                     SelfObject;                                       		// 0x0020 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UObject*                                     MyInstigatorObject;                               		// 0x0024 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UObject*                                     OtherEventParticipantObject;                      		// 0x0028 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FBehaviorParameters                         EventData;                                        		// 0x002C (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	// class UIBehaviorConsumer*                       Consumer;                                         		// 0x0038 (0x0008) [0x0000000000000000]              
	// struct FBehaviorConsumerHandle                  ConsumerHandle;                                   		// 0x0040 (0x0004) [0x0000000000000000]              
};

// Function GearboxFramework.Behavior_PostAkEvent.ApplyBehaviorToContext
// [0x00480002] 
struct UBehavior_PostAkEvent_execApplyBehaviorToContext_Parms
{
	class UObject*                                     ContextObject;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FBehaviorKernelInfo                         KernelInfo;                                       		// 0x0004 (0x001C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	class UObject*                                     SelfObject;                                       		// 0x0020 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UObject*                                     MyInstigatorObject;                               		// 0x0024 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UObject*                                     OtherEventParticipantObject;                      		// 0x0028 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FBehaviorParameters                         EventData;                                        		// 0x002C (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	// class UISoundBehavior*                          ContextInterface;                                 		// 0x0038 (0x0008) [0x0000000000000000]              
	// class UIWorldBody*                              WorldBodyInterface;                               		// 0x0040 (0x0008) [0x0000000000000000]              
};

// Function GearboxFramework.BehaviorHelpers.RunAllBehaviorsForEvent
// [0x00026501] ( FUNC_Final | FUNC_Native )
struct UBehaviorHelpers_execRunAllBehaviorsForEvent_Parms
{
	struct FName                                       EventName;                                        		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FScriptDelegate                             SetStrategy;                                      		// 0x0008 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FScriptDelegate                             Strategy;                                         		// 0x0014 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UObject*                                     SelfObject;                                       		// 0x0020 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UObject*                                     MyInstigatorObject;                               		// 0x0024 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	class UObject*                                     OtherEventParticipantObject;                      		// 0x0028 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	struct FBehaviorParameters                         EventData;                                        		// 0x002C (0x000C) [0x0000000000400090]              ( CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink )
	unsigned char                                      EnumValue;                                        		// 0x0038 (0x0001) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function GearboxFramework.BehaviorHelpers.BehaviorStrategy
// [0x00524000] 
struct UBehaviorHelpers_execBehaviorStrategy_Parms
{
	struct FPointer                                    BehaviorSet;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       EventName;                                        		// 0x0004 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	TArray< class UBehaviorBase* >                     BehaviorList;                                     		// 0x000C (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned char                                      EnumValue;                                        		// 0x0018 (0x0001) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function GearboxFramework.BehaviorHelpers.BehaviorSetStrategy
// [0x00520000] 
struct UBehaviorHelpers_execBehaviorSetStrategy_Parms
{
	TArray< struct FPointer >                          BehaviorSetList;                                  		// 0x0000 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function GearboxFramework.BehaviorHelpers.ResolveBehaviorProviderDefinitionReference
// [0x00422400] ( FUNC_Native )
struct UBehaviorHelpers_execResolveBehaviorProviderDefinitionReference_Parms
{
	class UBehaviorBase*                               SourceBehavior;                                   		// 0x0000 (0x0004) [0x0000000000000082]              ( CPF_Const | CPF_Parm )
	class UObject*                                     ProviderReference;                                		// 0x0004 (0x0004) [0x0000000000000082]              ( CPF_Const | CPF_Parm )
	struct FNameBasedObjectPath                        PathName;                                         		// 0x0008 (0x0034) [0x0000000000000182]              ( CPF_Const | CPF_Parm | CPF_OutParm )
	class UBehaviorProviderDefinition*                 ReturnValue;                                      		// 0x003C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GearboxFramework.BehaviorHelpers.IsBehaviorsV2
// [0x00422400] ( FUNC_Native )
struct UBehaviorHelpers_execIsBehaviorsV2_Parms
{
	struct FBehaviorKernelInfo                         KernelInfo;                                       		// 0x0000 (0x001C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x001C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GearboxFramework.BehaviorHelpers.ShouldContinueExecution
// [0x00422002] 
struct UBehaviorHelpers_execShouldContinueExecution_Parms
{
	struct FBehaviorKernelInfo                         KernelInfo;                                       		// 0x0000 (0x001C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	float                                              TimeBetweenSteps;                                 		// 0x001C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                NumSteps;                                         		// 0x0020 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	int                                                MaxSteps;                                         		// 0x0024 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0028 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GearboxFramework.BehaviorHelpers.GetNextFireLocationSocket
// [0x00422002] 
struct UBehaviorHelpers_execGetNextFireLocationSocket_Parms
{
	unsigned char                                      FireSocketSelection;                              		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	TArray< struct FName >                             FireLocationSocketNames;                          		// 0x0004 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	TArray< struct FName >                             FireLocationSocketsRemaining;                     		// 0x0010 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	struct FName                                       ReturnValue;                                      		// 0x001C (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FName                                    retVal;                                           		// 0x0024 (0x0008) [0x0000000000000000]              
};

// Function GearboxFramework.BehaviorHelpers.GetRotationFromAttachmentLocationData
// [0x00422400] ( FUNC_Native )
struct UBehaviorHelpers_execGetRotationFromAttachmentLocationData_Parms
{
	struct FAttachmentLocationData                     AttachmentLocation;                               		// 0x0000 (0x001C) [0x0000000000000082]              ( CPF_Const | CPF_Parm )
	struct FRotator                                    AttachmentLocationRotation;                       		// 0x001C (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0028 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GearboxFramework.BehaviorHelpers.GetRelativeDirection
// [0x00026400] ( FUNC_Native )
struct UBehaviorHelpers_execGetRelativeDirection_Parms
{
	struct FRelativeDirectionData                      DesiredDirection;                                 		// 0x0000 (0x0020) [0x0000000000000080]              ( CPF_Parm )
	class UIWorldBody*                                 Source;                                           		// 0x0020 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     DefaultDirection;                                 		// 0x0028 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       SpawnSocketName;                                  		// 0x0034 (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	struct FVector                                     ReturnValue;                                      		// 0x003C (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GearboxFramework.CompoundExpressionEvaluator.Evaluate
// [0x00020400] ( FUNC_Native )
struct UCompoundExpressionEvaluator_execEvaluate_Parms
{
	class UObject*                                     ContextSource;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GearboxFramework.GBXActorList.RemoveAndDeleteActorsOfClassFromLevel
// [0x00020400] ( FUNC_Native )
struct UGBXActorList_execRemoveAndDeleteActorsOfClassFromLevel_Parms
{
	class UClass*                                      TheClass;                                         		// 0x0000 (0x0004) [0x0000000000000082]              ( CPF_Const | CPF_Parm )
	class ULevel*                                      Level;                                            		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GearboxFramework.GBXActorList.RemoveActorsOfClassFromLevel
// [0x00020400] ( FUNC_Native )
struct UGBXActorList_execRemoveActorsOfClassFromLevel_Parms
{
	class UClass*                                      TheClass;                                         		// 0x0000 (0x0004) [0x0000000000000082]              ( CPF_Const | CPF_Parm )
	class ULevel*                                      Level;                                            		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GearboxFramework.GBXActorList.RemoveAndDeleteActorsFromLevel
// [0x00020400] ( FUNC_Native )
struct UGBXActorList_execRemoveAndDeleteActorsFromLevel_Parms
{
	class ULevel*                                      Level;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GearboxFramework.GBXActorList.RemoveActorsFromLevel
// [0x00020400] ( FUNC_Native )
struct UGBXActorList_execRemoveActorsFromLevel_Parms
{
	class ULevel*                                      Level;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GearboxFramework.GBXActorList.FindNextActorByLevel
// [0x00420400] ( FUNC_Native )
struct UGBXActorList_execFindNextActorByLevel_Parms
{
	class ULevel*                                      Level;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                Index;                                            		// 0x0004 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	class AActor*                                      ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GearboxFramework.GBXActorList.FindFirstActorByLevel
// [0x00420400] ( FUNC_Native )
struct UGBXActorList_execFindFirstActorByLevel_Parms
{
	class ULevel*                                      Level;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                Index;                                            		// 0x0004 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	class AActor*                                      ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GearboxFramework.GBXActorList.FindNextActorByClass
// [0x00420400] ( FUNC_Native )
struct UGBXActorList_execFindNextActorByClass_Parms
{
	class UClass*                                      TheClass;                                         		// 0x0000 (0x0004) [0x0000000000000082]              ( CPF_Const | CPF_Parm )
	int                                                Index;                                            		// 0x0004 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	class AActor*                                      ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GearboxFramework.GBXActorList.FindFirstActorByClass
// [0x00420400] ( FUNC_Native )
struct UGBXActorList_execFindFirstActorByClass_Parms
{
	class UClass*                                      TheClass;                                         		// 0x0000 (0x0004) [0x0000000000000082]              ( CPF_Const | CPF_Parm )
	int                                                Index;                                            		// 0x0004 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	class AActor*                                      ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GearboxFramework.GBXActorList.RemoveActor
// [0x00020400] ( FUNC_Native )
struct UGBXActorList_execRemoveActor_Parms
{
	class AActor*                                      Actor;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GearboxFramework.GBXActorList.AddActor
// [0x00020400] ( FUNC_Native )
struct UGBXActorList_execAddActor_Parms
{
	class AActor*                                      Actor;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class ULevel*                                      Level;                                            		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GearboxFramework.GBXObjectList.RemoveObjectsOfClass
// [0x00020400] ( FUNC_Native )
struct UGBXObjectList_execRemoveObjectsOfClass_Parms
{
	class UClass*                                      TheClass;                                         		// 0x0000 (0x0004) [0x0000000000000082]              ( CPF_Const | CPF_Parm )
};

// Function GearboxFramework.GBXObjectList.FindNextObjectByClass
// [0x00420400] ( FUNC_Native )
struct UGBXObjectList_execFindNextObjectByClass_Parms
{
	class UClass*                                      TheClass;                                         		// 0x0000 (0x0004) [0x0000000000000082]              ( CPF_Const | CPF_Parm )
	int                                                Index;                                            		// 0x0004 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	class UObject*                                     ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GearboxFramework.GBXObjectList.FindFirstObjectByClass
// [0x00420400] ( FUNC_Native )
struct UGBXObjectList_execFindFirstObjectByClass_Parms
{
	class UClass*                                      TheClass;                                         		// 0x0000 (0x0004) [0x0000000000000082]              ( CPF_Const | CPF_Parm )
	int                                                Index;                                            		// 0x0004 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	class UObject*                                     ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GearboxFramework.GBXObjectList.RemoveObject
// [0x00020400] ( FUNC_Native )
struct UGBXObjectList_execRemoveObject_Parms
{
	class UObject*                                     TheObject;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GearboxFramework.GBXObjectList.AddObject
// [0x00020400] ( FUNC_Native )
struct UGBXObjectList_execAddObject_Parms
{
	class UObject*                                     TheObject;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GearboxFramework.GearboxAIController.ForceMoveToActor
// [0x00020002] 
struct AGearboxAIController_execForceMoveToActor_Parms
{
	class AActor*                                      destActor;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GearboxFramework.GearboxAIMoveNode.DoesPatrolPathExistToPoint
// [0x00020400] ( FUNC_Native )
struct AGearboxAIMoveNode_execDoesPatrolPathExistToPoint_Parms
{
	class AGearboxAIMoveNode*                          PatrolPoint;                                      		// 0x0000 (0x0004) [0x0000000000000082]              ( CPF_Const | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GearboxFramework.GearboxAIMoveNode.GetAllLinkedNodes
// [0x00420400] ( FUNC_Native )
struct AGearboxAIMoveNode_execGetAllLinkedNodes_Parms
{
	TArray< class AGearboxAIMoveNode* >                OutNodes;                                         		// 0x0000 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function GearboxFramework.GearboxAIMoveNode.GetNextMoveNodeClosestToPoint
// [0x00020400] ( FUNC_Native )
struct AGearboxAIMoveNode_execGetNextMoveNodeClosestToPoint_Parms
{
	struct FVector                                     TestPoint;                                        		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	class AGearboxAIMoveNode*                          ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GearboxFramework.GearboxAIMoveNode.GetNextMoveNode
// [0x00020400] ( FUNC_Native )
struct AGearboxAIMoveNode_execGetNextMoveNode_Parms
{
	class AGearboxAIMoveNode*                          ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GearboxFramework.GearboxAIMoveNode.RemoveNode
// [0x00020400] ( FUNC_Native )
struct AGearboxAIMoveNode_execRemoveNode_Parms
{
	class AGearboxAIMoveNode*                          OldNode;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GearboxFramework.GearboxAIMoveNode.AddNode
// [0x00020400] ( FUNC_Native )
struct AGearboxAIMoveNode_execAddNode_Parms
{
	class AGearboxAIMoveNode*                          NewNode;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GearboxFramework.GearboxAIMoveNode.ClearLinks
// [0x00020400] ( FUNC_Native )
struct AGearboxAIMoveNode_execClearLinks_Parms
{
};

// Function GearboxFramework.GearboxAIMoveNode.OnToggle
// [0x00020102] 
struct AGearboxAIMoveNode_execOnToggle_Parms
{
	class USeqAct_Toggle*                              Action;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GearboxFramework.GearboxCameraBasic.FinishCameraLookAt
// [0x00020800] ( FUNC_Event )
struct AGearboxCameraBasic_eventFinishCameraLookAt_Parms
{
};

// Function GearboxFramework.GearboxCameraBasic.EnableThirdPersonLookAt
// [0x00020800] ( FUNC_Event )
struct AGearboxCameraBasic_eventEnableThirdPersonLookAt_Parms
{
	float                                              LookAtXOffset;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              LookAtYOffset;                                    		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              LookAtZOffset;                                    		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      LookAtMode;                                       		// 0x000C (0x0001) [0x0000000000000080]              ( CPF_Parm )
};

// Function GearboxFramework.GearboxCameraBasic.BeginCameraLookAt
// [0x00020100] 
struct AGearboxCameraBasic_execBeginCameraLookAt_Parms
{
	class AActor*                                      LookAtTarget;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       LookAtBone;                                       		// 0x0004 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     TargetLocation;                                   		// 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	float                                              Zoom;                                             		// 0x0018 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector2D                                   FOV;                                              		// 0x001C (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              Duration;                                         		// 0x0024 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              TransitionTimeIn;                                 		// 0x0028 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              TransitionTimeOut;                                		// 0x002C (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GearboxFramework.GearboxCameraBasic.CalcSimpleThirdPersonView
// [0x00C20102] 
struct AGearboxCameraBasic_execCalcSimpleThirdPersonView_Parms
{
	struct FTViewTarget                                OutVT;                                            		// 0x0000 (0x002C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	float                                              DeltaTime;                                        		// 0x002C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// struct FVector                                  Loc;                                              		// 0x0030 (0x000C) [0x0000000000000000]              
	// struct FVector                                  pos;                                              		// 0x003C (0x000C) [0x0000000000000000]              
	// struct FVector                                  HitLocation;                                      		// 0x0048 (0x000C) [0x0000000000000000]              
	// struct FVector                                  HitNormal;                                        		// 0x0054 (0x000C) [0x0000000000000000]              
	// struct FRotator                                 Rot;                                              		// 0x0060 (0x000C) [0x0000000000000000]              
};

// Function GearboxFramework.GearboxCameraBasic.CalcBaseView
// [0x00420102] 
struct AGearboxCameraBasic_execCalcBaseView_Parms
{
	struct FTViewTarget                                OutVT;                                            		// 0x0000 (0x002C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	float                                              DeltaTime;                                        		// 0x002C (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GearboxFramework.GearboxCameraBasic.UpdateViewTarget
// [0x00C20102] 
struct AGearboxCameraBasic_execUpdateViewTarget_Parms
{
	struct FTViewTarget                                OutVT;                                            		// 0x0000 (0x002C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	float                                              DeltaTime;                                        		// 0x002C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// struct FTPOV                                    OrigPOV;                                          		// 0x0034 (0x001C) [0x0000000000000000]              
};

// Function GearboxFramework.GearboxCameraModifier.LerpFOV
// [0x00080002] 
struct UGearboxCameraModifier_execLerpFOV_Parms
{
	float                                              Src;                                              		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              Dest;                                             		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              T;                                                		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GearboxFramework.GearboxCameraModifier.LerpRotation
// [0x00080002] 
struct UGearboxCameraModifier_execLerpRotation_Parms
{
	struct FRotator                                    Src;                                              		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FRotator                                    Dest;                                             		// 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	float                                              T;                                                		// 0x0018 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FRotator                                    ReturnValue;                                      		// 0x001C (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GearboxFramework.GearboxCameraModifier.LerpLocation
// [0x00080002] 
struct UGearboxCameraModifier_execLerpLocation_Parms
{
	struct FVector                                     Src;                                              		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     Dest;                                             		// 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	float                                              T;                                                		// 0x0018 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     ReturnValue;                                      		// 0x001C (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GearboxFramework.GearboxCameraModifier.UpdateAllLerps
// [0x00C80002] 
struct UGearboxCameraModifier_execUpdateAllLerps_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FTPOV                                       OutPOV;                                           		// 0x0004 (0x001C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	// struct FTPOV                                    PrelimPOV;                                        		// 0x0020 (0x001C) [0x0000000000000000]              
};

// Function GearboxFramework.GearboxCameraModifier.UpdateMasterFadePercentage
// [0x00040003] ( FUNC_Final )
struct UGearboxCameraModifier_execUpdateMasterFadePercentage_Parms
{
	float                                              AdjustedDeltaTime;                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GearboxFramework.GearboxCameraModifier.IsFadingDownwards
// [0x00080002] 
struct UGearboxCameraModifier_execIsFadingDownwards_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GearboxFramework.GearboxCameraModifier.IsFadingUpwards
// [0x00080002] 
struct UGearboxCameraModifier_execIsFadingUpwards_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GearboxFramework.GearboxCameraModifier.IsFadeInProgress
// [0x00080002] 
struct UGearboxCameraModifier_execIsFadeInProgress_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GearboxFramework.GearboxCameraModifier.StartFadeOut
// [0x00084002] 
struct UGearboxCameraModifier_execStartFadeOut_Parms
{
	float                                              NewTimeSpan;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      NewDisableWhenFadedOut : 1;                       		// 0x0004 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	unsigned char                                      NewFadeMode;                                      		// 0x0008 (0x0001) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function GearboxFramework.GearboxCameraModifier.StartFadeIn
// [0x00084002] 
struct UGearboxCameraModifier_execStartFadeIn_Parms
{
	float                                              NewTimeSpan;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      NewFadeMode;                                      		// 0x0004 (0x0001) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function GearboxFramework.GearboxCameraModifier.SetDesiredCamera
// [0x00080102] 
struct UGearboxCameraModifier_execSetDesiredCamera_Parms
{
	struct FVector                                     DesiredLoc;                                       		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FRotator                                    DesiredRot;                                       		// 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	float                                              DesiredFOV;                                       		// 0x0018 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GearboxFramework.GearboxCameraModifier.SetGBXCameraOwner
// [0x00080102] 
struct UGearboxCameraModifier_execSetGBXCameraOwner_Parms
{
	class AGearboxCameraBasic*                         InCamera;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GearboxFramework.GearboxCameraModifier.AddCameraModifier
// [0x00020102] 
struct UGearboxCameraModifier_execAddCameraModifier_Parms
{
	class ACamera*                                     Camera;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GearboxFramework.GearboxDialogInterface.ServerDialog_TriggerEvent
// [0x00224840] ( FUNC_Event )
struct UGearboxDialogInterface_eventServerDialog_TriggerEvent_Parms
{
	class UGearboxDialogEventTag*                      EventTag;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      Other;                                            		// 0x0004 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	class UObject*                                     ObjectParameter;                                  		// 0x0008 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function GearboxFramework.GearboxDialogInterface.SetDialogNameTag
// [0x00020400] ( FUNC_Native )
struct UGearboxDialogInterface_execSetDialogNameTag_Parms
{
	class UGearboxDialogNameTag*                       NewName;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GearboxFramework.GearboxDialogInterface.GetReplicatedDialogData
// [0x00020400] ( FUNC_Native )
struct UGearboxDialogInterface_execGetReplicatedDialogData_Parms
{
	struct FGearboxDialogReplicatedData                ReturnValue;                                      		// 0x0000 (0x0014) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GearboxFramework.GearboxDialogInterface.SetReplicatedDialogData
// [0x00420400] ( FUNC_Native )
struct UGearboxDialogInterface_execSetReplicatedDialogData_Parms
{
	class UGearboxDialogAct_Talk*                      TalkAct;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FGearboxDialogData                          Data;                                             		// 0x0004 (0x0010) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function GearboxFramework.GearboxDialogInterface.GetDialogGroups
// [0x00420500] ( FUNC_Native )
struct UGearboxDialogInterface_execGetDialogGroups_Parms
{
	TArray< class UGearboxDialogGroup* >               Groups;                                           		// 0x0000 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function GearboxFramework.GearboxDialogInterface.GetDialogComponent
// [0x00020500] ( FUNC_Native )
struct UGearboxDialogInterface_execGetDialogComponent_Parms
{
	class UGearboxDialogComponent*                     ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000004000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_EditInline )
};

// Function GearboxFramework.GearboxDialogInterface.GetDialogNameTag
// [0x00020500] ( FUNC_Native )
struct UGearboxDialogInterface_execGetDialogNameTag_Parms
{
	class UGearboxDialogNameTag*                       ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GearboxFramework.GearboxDialogInterface.GetActor
// [0x00020500] ( FUNC_Native )
struct UGearboxDialogInterface_execGetActor_Parms
{
	class AActor*                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GearboxFramework.GearboxDialogInterface.CanTalk
// [0x00020500] ( FUNC_Native )
struct UGearboxDialogInterface_execCanTalk_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GearboxFramework.GearboxEditorNode.IsChild
// [0x00020400] ( FUNC_Native )
struct UGearboxEditorNode_execIsChild_Parms
{
	class UGearboxEditorNode*                          TestNode;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GearboxFramework.GearboxEngine.GetSparkInterface
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UGearboxEngine_execGetSparkInterface_Parms
{
	class USparkInterface*                             ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GearboxFramework.GearboxEngine.IsCurrentDeviceValid
// [0x00024802] ( FUNC_Event )
struct UGearboxEngine_eventIsCurrentDeviceValid_Parms
{
	int                                                SizeNeeded;                                       		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GearboxFramework.GearboxEngine.HasStorageDeviceBeenRemoved
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UGearboxEngine_execHasStorageDeviceBeenRemoved_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GearboxFramework.GearboxEngine.GetCurrentDeviceID
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UGearboxEngine_execGetCurrentDeviceID_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GearboxFramework.GearboxEngine.SetCurrentDeviceID
// [0x00024401] ( FUNC_Final | FUNC_Native )
struct UGearboxEngine_execSetCurrentDeviceID_Parms
{
	int                                                NewDeviceID;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bProfileSignedOut : 1;                            		// 0x0004 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
};

// Function GearboxFramework.GearboxGameInfo.PostLogin
// [0x00020802] ( FUNC_Event )
struct AGearboxGameInfo_eventPostLogin_Parms
{
	class APlayerController*                           NewPlayer;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function GearboxFramework.GearboxGFxMovie.extSetLanguageExt
// [0x00020002] 
struct UGearboxGFxMovie_execextSetLanguageExt_Parms
{
	struct FString                                     ClipPath;                                         		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function GearboxFramework.GearboxGFxMovie.OnClosedOnDeath
// [0x00020000] 
struct UGearboxGFxMovie_execOnClosedOnDeath_Parms
{
};

// Function GearboxFramework.GearboxGFxMovie.IsShowingFlashMouse
// [0x00020400] ( FUNC_Native )
struct UGearboxGFxMovie_execIsShowingFlashMouse_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GearboxFramework.GearboxGFxMovie.extIsMouseablePlatform
// [0x00020002] 
struct UGearboxGFxMovie_execextIsMouseablePlatform_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function GearboxFramework.GearboxGFxMovie.SetMouseableFlag
// [0x00020C00] ( FUNC_Event | FUNC_Native )
struct UGearboxGFxMovie_eventSetMouseableFlag_Parms
{
};

// Function GearboxFramework.GearboxGFxMovie.GetStyleDebugString
// [0x00020002] 
struct UGearboxGFxMovie_execGetStyleDebugString_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
