#include "BL2-SDK.h"
/*
#############################################################################################
# Borderlands 2 (1.7) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: WillowGame_classes.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_DAMAGEFLAG_CriticalHit                             1
#define CONST_DAMAGEFLAG_Healing                                 2
#define CONST_DAMAGEFLAG_Resist                                  4
#define CONST_MAX_BEAMS                                          20
#define CONST_MAX_PROJECTILES                                    16
#define CONST_DISPLAY_DEBUG_STATS_PER_PAGE                       10
#define CONST_MAX_ACTIVE_DYNAMIC_ICONS                           18
#define CONST_MAX_ACTIVE_SKILL_STATION_ICONS                     28

	EVS_CameraRelative                                 = 1,
	EVS_FollowsCamera                                  = 2,
	EVS_MAX                                            = 3
};*/

// Enum WillowGame.WillowVehicle.EVehicleDeathStatus
/*enum EVehicleDeathStatus
{
	VEHDEATH_Alive                                     = 0,
	VEHDEATH_Instant                                   = 1,
	VEHDEATH_Explode                                   = 2,
	VEHDEATH_DeRez                                     = 3,
	VEHDEATH_MAX                                       = 4
};*/

// Enum WillowGame.WillowVehicle.EVehicleFOVState
/*enum EVehicleFOVState
{
	VEHICLE_FOV_Default                                = 0,
	VEHICLE_FOV_AfterburnerOn                          = 1,
	VEHICLE_FOV_AfterburnerOff                         = 2,
	VEHICLE_FOV_MAX                                    = 3
};*/

// Enum WillowGame.WillowVehicle_Tank.TankSensorType
/*enum TankSensorType
{
	TST_Front                                          = 0,
	TST_Right                                          = 1,
	TST_Left                                           = 2,
	TST_Back                                           = 3,
	TST_MAX                                            = 4
};*/

// Enum WillowGame.WillowVersusDuelGlobals.EDuelMsg
/*enum EDuelMsg
{
	DMSG_DUELINGDISABLED                               = 0,
	DMSG_ALREADYDUELING                                = 1,
	DMSG_ALREADYCHALLENGED                             = 2,
	DMSG_DUELTIMEOUT                                   = 3,
	DMSG_ISSUEDCHALLENGE                               = 4,
	DMSG_RECEIVEDCHALLENGE                             = 5,
	DMSG_ACCEPTEDCHALLENGE                             = 6,
	DMSG_DUELSTART                                     = 7,
	DMSG_ARENAWARNING                                  = 8,
	DMSG_DUELDRAW                                      = 9,
	DMSG_DUELWIN                                       = 10,
	DMSG_NOTRIGHTNOW                                   = 11,
	DMSG_MAX                                           = 12
};*/

// Enum WillowGame.SeqAct_SetNameList.EListDefinitionSetType
/*enum EListDefinitionSetType
{
	ListDefSet_Set                                     = 0,
	ListDefSet_Clear                                   = 1,
	ListDefSet_MAX                                     = 2
};*/

// Enum WillowGame.WillowSkelControl_RotationRateBySpeed.ESpeedComponent
/*enum ESpeedComponent
{
	ESC_Forward                                        = 0,
	ESC_Strafe                                         = 1,
	ESC_Horizontal                                     = 2,
	ESC_Vertical                                       = 3,
	ESC_Full                                           = 4,
	ESC_MAX                                            = 5
};*/

/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class WillowGame.AchievementUtility
// 0x0000 (0x003C - 0x003C)
class UAchievementUtility : public UObject
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = (UClass*)UObject::GObjObjects()->Data[3590];

		return pClassPointer;
	};

	TArray< unsigned char > ShouldUnlockAchievementFromUnlockType(unsigned char UnlockType, struct FString StringData, int IntData, unsigned long bCanBeGreater, unsigned long bCheckStringAndIntData, unsigned long bCanBeLess);
};

UClass* UAchievementUtility::pClassPointer = NULL;

// Class WillowGame.ActionSkill
// 0x00AC (0x0234 - 0x0188)
class AActionSkill : public AActor
{
public:
	struct FPointer                                    VfTable_IIInstanceData;                           		// 0x0188 (0x0004) [0x0000000000801002]              ( CPF_Const | CPF_Native | CPF_NoExport )
	struct FPointer                                    VfTable_IITimerBehavior;                          		// 0x018C (0x0004) [0x0000000000801002]              ( CPF_Const | CPF_Native | CPF_NoExport )
	struct FPointer                                    VfTable_IICustomEvent;                            		// 0x0190 (0x0004) [0x0000000000801002]              ( CPF_Const | CPF_Native | CPF_NoExport )
	struct FPointer                                    VfTable_IIBehaviorConsumer;                       		// 0x0194 (0x0004) [0x0000000000801002]              ( CPF_Const | CPF_Native | CPF_NoExport )
	struct FPointer                                    VfTable_IIBehaviorProvider;                       		// 0x0198 (0x0004) [0x0000000000801002]              ( CPF_Const | CPF_Native | CPF_NoExport )
	struct FPointer                                    VfTable_IIConstructObject;                        		// 0x019C (0x0004) [0x0000000000801002]              ( CPF_Const | CPF_Native | CPF_NoExport )
	float                                              TickRate;                                         		// 0x01A0 (0x0004) [0x0000000000000000]
	float                                              NextTick;                                         		// 0x01A4 (0x0004) [0x0000000000000000]
	class AController*                                 MyController;                                     		// 0x01A8 (0x0004) [0x0000000000000000]
	class AWillowPawn*                                 MyWillowPawn;                                     		// 0x01AC (0x0004) [0x0000000000000000]
	class AWillowPlayerPawn*                           MyWillowPlayerPawn;                               		// 0x01B0 (0x0004) [0x0000000000000000]
	class AWillowPlayerController*                     MyWillowPC;                                       		// 0x01B4 (0x0004) [0x0000000000000000]
	class AWillowMind*                                 MyWillowMind;                                     		// 0x01B8 (0x0004) [0x0000000000000000]
	class AWillowPawn*                                 TargetPawn;                                       		// 0x01BC (0x0004) [0x0000000000000020]              ( CPF_Net )
	struct FInstanceDataSet                            InstanceState;                                    		// 0x01C0 (0x000C) [0x0000000000482000]              ( CPF_Transient | CPF_Component | CPF_NeedCtorLink )
	struct FBehaviorConsumerHandle                     ConsumerHandle;                                   		// 0x01CC (0x0004) [0x0000000000000000]
	struct FReplicatedBehaviorConsumerState            ReplicatedBehaviorConsumerState;                  		// 0x01D0 (0x000C) [0x0000000000000020]              ( CPF_Net )
	struct FReplicatedBehaviorEvent                    ReplicatedBehaviorEvent;                          		// 0x01DC (0x0004) [0x0000000000000020]              ( CPF_Net )
	class UBehaviorProviderDefinition*                 BehaviorProviderDefinition;                       		// 0x01E0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FTimerBehaviorUserState                     ActionSkillTimers;                                		// 0x01E4 (0x0024) [0x0000000000000000]
	struct FActionSkillCustomEventReplicationData      CustomEventReplication;                           		// 0x0208 (0x000C) [0x0000000000000020]              ( CPF_Net )
	unsigned long                                      bInitialized : 1;                                 		// 0x0214 (0x0004) [0x0000000000000000] [0x00000001]
	unsigned long                                      bDebugEnabled : 1;                                		// 0x0214 (0x0004) [0x0000000000000000] [0x00000002]
	unsigned long                                      bBlockDeactivate : 1;                             		// 0x0214 (0x0004) [0x0000000000000000] [0x00000004]
	unsigned long                                      bWantsDeactivate : 1;                             		// 0x0214 (0x0004) [0x0000000000000000] [0x00000008]
	unsigned long                                      bWantsDestroy : 1;                                		// 0x0214 (0x0004) [0x0000000000000000] [0x00000010]
	unsigned long                                      bActionSkillNearingCompletionEventFired : 1;      		// 0x0214 (0x0004) [0x0000000000000000] [0x00000020]
	unsigned long                                      bAllowAutomaticActiveAbilityActivation : 1;       		// 0x0214 (0x0004) [0x0000000000000003] [0x00000040] ( CPF_Edit | CPF_Const )
	unsigned long                                      bRestrictActiveAbilityByCount : 1;                		// 0x0214 (0x0004) [0x0000000000000003] [0x00000080] ( CPF_Edit | CPF_Const )
	unsigned long                                      bRestrictActiveAbilityByTimeFrequency : 1;        		// 0x0214 (0x0004) [0x0000000000000003] [0x00000100] ( CPF_Edit | CPF_Const )
	unsigned long                                      bAllowAutomaticCooldownAbilityActivation : 1;     		// 0x0214 (0x0004) [0x0000000000000003] [0x00000200] ( CPF_Edit | CPF_Const )
	unsigned long                                      bRestrictCooldownAbilityByCount : 1;              		// 0x0214 (0x0004) [0x0000000000000003] [0x00000400] ( CPF_Edit | CPF_Const )
	unsigned long                                      bRestrictCooldownAbilityByTimeFrequency : 1;      		// 0x0214 (0x0004) [0x0000000000000003] [0x00000800] ( CPF_Edit | CPF_Const )
	float                                              ActionSkillNearingCompletionTime;                 		// 0x0218 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                MaxActivationCountPerActiveCycle;                 		// 0x021C (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	float                                              ActiveAbilityActivationTimeFrequency;             		// 0x0220 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	int                                                MaxActivationCountPerCooldownCycle;               		// 0x0224 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	float                                              CooldownAbilityActivationTimeFrequency;           		// 0x0228 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	class USkillDefinition*                            MeleeOverrideSkill;                               		// 0x022C (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	int                                                TimeStarted;                                      		// 0x0230 (0x0004) [0x0000000000000000]

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = (UClass*)UObject::GObjObjects()->Data[3592];

		return pClassPointer;
	};

	bool ShouldResetOnInterruptedGrenadeThrow();
	bool CanResetActionSkill();
	bool eventOverrideCrosshairVisibility(unsigned long bVisible, unsigned long bForScope);
	float eventGetDeferredActionSkillTime();
	void eventTickActionSkillHUD(class UWillowHUDGFxMovie* HUDMovie, float ActionSkillTime, float DeltaTime);
	void eventDisableActionSkillHUD(class UWillowHUDGFxMovie* HUDMovie);
	void eventEnableActionSkillHUD(class UWillowHUDGFxMovie* HUDMovie);
	struct FBehaviorConsumerHandle GetBehaviorConsumerHandle();
	class UObject* GetActionSkillEventContextObject();
	void eventRunCustomEvent(struct FName EventName, class UObject* EventInstigator, class UObject* OtherEventParticipantObject, struct FBehaviorParameters EventData);
	void eventHandleTimerEvent(unsigned char EventType, struct FBehaviorParameters EventData);
	bool SetTimerState(unsigned char TimerId, struct FBehaviorTimerState TimerState);
	bool GetTimerState(unsigned char TimerId, struct FBehaviorTimerState* TimerState);
	float GetTimeSeconds();
	bool GetReplicatedInstanceDataState(struct FReplicatedInstanceDataState* OutReplicatedInstanceDataState);
	bool GetInstanceDataState(struct FInstanceDataSet* OutInstanceDataState);
	void DestroyOwnedInstanceData();
	bool eventRemoveInstanceDataObject(class UObject* InstanceDataObject);
	bool eventRemoveInstanceData(struct FName DataName);
	bool eventGetInstanceData(struct FName DataName, TArray< struct FInstanceDataUnion >* InstanceData);
	bool SetInstanceData(struct FInstanceDataUnion InstanceData, unsigned long bAllowDuplicateNames);
	void EnableDebug(unsigned long DebugEnabled);
	void NotifyActionSkillActiveAbility(class AWillowPawn* TheWillowPawn, class AController* TheController, float ActionSkillDuration, float ActiveTimeRemaining, class AWillowPawn* TheTargetPawn);
	void StartActionSkillActiveAbility(class AWillowPawn* TheWillowPawn, class AController* TheController, float ActionSkillDuration, float ActiveTimeRemaining, class AWillowPawn* TheTargetPawn);
	void ClientStartActionSkillActiveAbility(class AWillowPawn* TheWillowPawn, class AController* TheController, float ActionSkillDuration, float ActiveTimeRemaining, class AWillowPawn* TheTargetPawn);
	bool AllowNewActiveAbilityActivation(int* CurrentActionSkillActiveAbilityCount, float* NextActionSkillActiveAbilityTime);
	bool AllowAutomaticActiveAbilityActivation();
	bool AllowNewCooldownAbilityActivation(int* CurrentActionSkillCooldownAbilityCount, float* NextActionSkillCooldownAbilityTime);
	bool AllowAutomaticCooldownAbilityActivation();
	void eventOnActionSkillTick(float DeltaTime);
	bool OverridesStandardMelee();
	bool ReadyToInterceptMelee(class AWillowPawn* AutoAimTarget);
	void OnActionSkillOwnerMelee(class AWillowPawn* TargetIfAvailable);
	void OnActionSkillWeaponsRestricted(unsigned long bWeaponsRestricted);
	void OnActionSkillOwnerInjured();
	void OnActionSkillKilledEnemy(class AWillowPawn* KilledPawn);
	void OnActionSkillShowBackMenu(unsigned long bOpened);
	void OnActionSkillFakePause(unsigned long bPaused);
	void OnActionSkillOwnerTouchedActor(class AActor* Other, class UPrimitiveComponent* OtherComp, struct FVector HitLocation, struct FVector HitNormal);
	void OnActionSkillOwnerHitWall(struct FVector HitNormal, class AActor* Wall, class UPrimitiveComponent* WallComp);
	void OnActionSkillOwnerStoppedWalking();
	void OnActionSkillOwnerBeganWalking(unsigned char PreviousPhysics);
	void OnActionSkillOwnerBeganFalling(unsigned char PreviousPhysics);
	void eventOnActionSkillOwnerAllieganceChanged(class UPawnAllegiance* NewAllegiance);
	void OnActionSkillOwnerWeaponSwitched(class AWeapon* OldWeapon, class AWeapon* NewWeapon);
	void OnActionSkillOwnerDied();
	void eventOwnerLostAutoAimTarget(class UITargetable* OldTargetable);
	void eventOwnerAcquiredAutoAimTarget(class UITargetable* NewTargetable);
	void eventTornOff();
	void TearOff();
	void OnActionSkillEnded();
	bool eventIsDeactivateBlocked();
	void ClientActionSkillWantsToDeactivate();
	void eventOnActionSkillWantsToDeactivate();
	void OnActionSkillStarted(class AWillowPawn* TheWillowPawn, class AController* TheController, class AWillowPawn* TheTargetPawn);
	void eventReplicatedEvent(struct FName VarName);
	void OnActionSkillOwnerShowBackMenu(class APawn* SkillInstigator, unsigned long bOpened, struct FBehaviorConsumerHandle* TheConsumerHandle);
	void OnTimerEvent(struct FName SpecializedEventName, struct FBehaviorConsumerHandle* TheConsumerHandle);
	void OnActionSkillNearingCompletion(class APawn* SkillInstigator, class APawn* SkillTargetIfAvailable, struct FBehaviorConsumerHandle* TheConsumerHandle);
	void OnActionSkillOwnerMeleeOverridden(class APawn* SkillInstigator, class APawn* SkillTargetIfAvailable, struct FBehaviorConsumerHandle* TheConsumerHandle);
	void OnOwnerLostAutoAimTarget(class APawn* SkillOwner, class AActor* OldTargetIfAvailable, struct FBehaviorConsumerHandle* TheConsumerHandle);
	void OnOwnerAcquiredAutoAimTarget(class APawn* SkillOwner, class AActor* NewTargetIfAvailable, struct FBehaviorConsumerHandle* TheConsumerHandle);
	void OnActionSkillDeactivated(class APawn* SkillInstigator, struct FBehaviorConsumerHandle* TheConsumerHandle);
	void OnActionSkillActivated(class APawn* SkillInstigator, class APawn* SkillTargetIfAvailable, struct FBehaviorConsumerHandle* TheConsumerHandle);
	void OnActionSkillActiveAbilityNotified(class APawn* SkillInstigator, float ActiveTimeRemaining, class APawn* SkillTargetIfAvailable, struct FBehaviorConsumerHandle* TheConsumerHandle);
	void OnActionSkillActiveAbilityActivated(class APawn* SkillInstigator, float ActiveTimeRemaining, class APawn* SkillTargetIfAvailable, struct FBehaviorConsumerHandle* TheConsumerHandle);
	void SetBehaviorProviderDefinition(class UBehaviorProviderDefinition* NewBehaviorProviderDefinition);
	class UBehaviorProviderDefinition* GetBehaviorProviderDefinition();
};

UClass* AActionSkill::pClassPointer = NULL;

// Class WillowGame.ScorpioActionSkill
// 0x0014 (0x0248 - 0x0234)
class AScorpioActionSkill : public AActionSkill
{
public:
	class ADeployableTurretActor*                      ScorpioSpawnedActor;                              		// 0x0234 (0x0004) [0x0000000000000000]
	class ADeployableTurretActor*                      GeminiSpawnedActor;                               		// 0x0238 (0x0004) [0x0000000000000000]
	class AWillowProjectile*                           ActiveProjectile;                                 		// 0x023C (0x0004) [0x0000000000000000]
	class USkillDefinition*                            GeminiSkill;                                      		// 0x0240 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	class USpecialMoveDefinition*                      ThrowScorpioSMD;                                  		// 0x0244 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = (UClass*)UObject::GObjObjects()->Data[3594];

		return pClassPointer;
	};

	bool ShouldResetOnInterruptedGrenadeThrow();
	bool CanResetActionSkill();
	void NotifySkillActorDied(class AActor* SkillActor);
	class UObject* GetActionSkillEventContextObject();
	void ClientDeployScorpio();
	void DeployScorpio();
	void PlayThrowAnimation();
	void DestroyOwnedInstanceData();
	bool RemoveInstanceData(struct FName DataName);
	bool eventGetInstanceData(struct FName DataName, TArray< struct FInstanceDataUnion >* InstanceData);
	bool SetInstanceData(struct FInstanceDataUnion InstanceData, unsigned long bAllowDuplicateNames);
	bool AllowNewActiveAbilityActivation(int* CurrentActionSkillActiveAbilityCount, float* NextActionSkillActiveAbilityTime);
	void StartActionSkillActiveAbility(class AWillowPawn* TheWillowPawn, class AController* TheController, float ActionSkillDuration, float ActiveTimeRemaining, class AWillowPawn* AutoAimTarget);
	void OnActionSkillOwnerDied();
	void OnActionSkillEnded();
	void OnActionSkillStarted(class AWillowPawn* TheWillowPawn, class AController* TheController, class AWillowPawn* TheTargetPawn);
};

UClass* AScorpioActionSkill::pClassPointer = NULL;

// Class WillowGame.ActorFactoryInteractiveObject
// 0x0004 (0x0080 - 0x007C)
class UActorFactoryInteractiveObject : public UActorFactory
{
public:
	class UInteractiveObjectDefinition*                Definition;                                       		// 0x007C (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = (UClass*)UObject::GObjObjects()->Data[3596];

		return pClassPointer;
	};
};

UClass* UActorFactoryInteractiveObject::pClassPointer = NULL;

// Class WillowGame.ActorFactoryWillowElevatorButton
// 0x0000 (0x0080 - 0x0080)
class UActorFactoryWillowElevatorButton : public UActorFactoryInteractiveObject
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = (UClass*)UObject::GObjObjects()->Data[3598];

		return pClassPointer;
	};
};

UClass* UActorFactoryWillowElevatorButton::pClassPointer = NULL;

// Class WillowGame.ActorFactoryMissionPickupSpawner
// 0x0004 (0x0080 - 0x007C)
class UActorFactoryMissionPickupSpawner : public UActorFactory
{
public:
	class UMissionItemDefinition*                      Definition;                                       		// 0x007C (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = (UClass*)UObject::GObjObjects()->Data[3600];

		return pClassPointer;
	};
};

UClass* UActorFactoryMissionPickupSpawner::pClassPointer = NULL;

// Class WillowGame.ActorFactoryMissionPickupFailsafe
// 0x0000 (0x0080 - 0x0080)
class UActorFactoryMissionPickupFailsafe : public UActorFactoryMissionPickupSpawner
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = (UClass*)UObject::GObjObjects()->Data[3602];

		return pClassPointer;
	};
};

UClass* UActorFactoryMissionPickupFailsafe::pClassPointer = NULL;

// Class WillowGame.ActorFactoryPopulationOpportunityArea
// 0x0000 (0x007C - 0x007C)
class UActorFactoryPopulationOpportunityArea : public UActorFactory
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = (UClass*)UObject::GObjObjects()->Data[3604];

		return pClassPointer;
	};
};

UClass* UActorFactoryPopulationOpportunityArea::pClassPointer = NULL;

// Class WillowGame.ActorFactoryPopulationOpportunityDen
// 0x0000 (0x007C - 0x007C)
class UActorFactoryPopulationOpportunityDen : public UActorFactory
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = (UClass*)UObject::GObjObjects()->Data[3606];

		return pClassPointer;
	};
};

UClass* UActorFactoryPopulationOpportunityDen::pClassPointer = NULL;

// Class WillowGame.ActorFactoryWillowCoopPlayerStart
// 0x0000 (0x007C - 0x007C)
class UActorFactoryWillowCoopPlayerStart : public UActorFactory
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = (UClass*)UObject::GObjObjects()->Data[3608];

		return pClassPointer;
	};
};

UClass* UActorFactoryWillowCoopPlayerStart::pClassPointer = NULL;

// Class WillowGame.ActorFactoryWillowElevator
// 0x0000 (0x0094 - 0x0094)
class UActorFactoryWillowElevator : public UActorFactoryMover
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = (UClass*)UObject::GObjObjects()->Data[3610];

		return pClassPointer;
	};
};

UClass* UActorFactoryWillowElevator::pClassPointer = NULL;

// Class WillowGame.ActorFactoryWillowPawn
// 0x0004 (0x0080 - 0x007C)
class UActorFactoryWillowPawn : public UActorFactory
{
public:
	class AWillowPawn*                                 PawnArchetype;                                    		// 0x007C (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = (UClass*)UObject::GObjObjects()->Data[3612];

		return pClassPointer;
	};
};

UClass* UActorFactoryWillowPawn::pClassPointer = NULL;

// Class WillowGame.ActorFactoryWillowTrigger
// 0x0000 (0x007C - 0x007C)
class UActorFactoryWillowTrigger : public UActorFactory
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = (UClass*)UObject::GObjObjects()->Data[3614];

		return pClassPointer;
	};
};

UClass* UActorFactoryWillowTrigger::pClassPointer = NULL;

// Class WillowGame.ActorFactoryWillowVehicle
// 0x0004 (0x0080 - 0x007C)
class UActorFactoryWillowVehicle : public UActorFactory
{
public:
	class AWillowVehicle*                              VehicleArchetype;                                 		// 0x007C (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = (UClass*)UObject::GObjObjects()->Data[3616];

		return pClassPointer;
	};
};

UClass* UActorFactoryWillowVehicle::pClassPointer = NULL;

// Class WillowGame.ActorFactoryWillowVehicleFactory
// 0x0000 (0x0080 - 0x0080)
class UActorFactoryWillowVehicleFactory : public UActorFactoryWillowVehicle
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = (UClass*)UObject::GObjObjects()->Data[3618];

		return pClassPointer;
	};
};

UClass* UActorFactoryWillowVehicleFactory::pClassPointer = NULL;

// Class WillowGame.ActorFactoryWillowWaypoint
// 0x0000 (0x007C - 0x007C)
class UActorFactoryWillowWaypoint : public UActorFactory
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = (UClass*)UObject::GObjObjects()->Data[3620];

		return pClassPointer;
	};
};

UClass* UActorFactoryWillowWaypoint::pClassPointer = NULL;

// Class WillowGame.AdvancedAxisDefinition
// 0x001C (0x0058 - 0x003C)
class UAdvancedAxisDefinition : public UGBXDefinition
{
public:
	float                                              Speed;                                            		// 0x003C (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	float                                              ZoomSpeed;                                        		// 0x0040 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	float                                              DeadZone;                                         		// 0x0044 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	float                                              AccelThreshold;                                   		// 0x0048 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	float                                              AccelRate;                                        		// 0x004C (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	float                                              AccelSpeed;                                       		// 0x0050 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	float                                              AccelWarmup;                                      		// 0x0054 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = (UClass*)UObject::GObjObjects()->Data[3622];

		return pClassPointer;
	};
};

UClass* UAdvancedAxisDefinition::pClassPointer = NULL;

// Class WillowGame.AIPawnBalanceModifierDefinition
// 0x001C (0x0058 - 0x003C)
class UAIPawnBalanceModifierDefinition : public UGBXDefinition
{
public:
	struct FString                                     AIPawnBalanceDefinitionPath;                      		// 0x003C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	unsigned long                                      bEmptyAttributeStartingValues : 1;                		// 0x0048 (0x0004) [0x0000000000000003] [0x00000001] ( CPF_Edit | CPF_Const )
	TArray< struct FAttributeBaseValueData >           AttributeStartingValues;                          		// 0x004C (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = (UClass*)UObject::GObjObjects()->Data[3624];

		return pClassPointer;
	};
};

UClass* UAIPawnBalanceModifierDefinition::pClassPointer = NULL;

// Class WillowGame.AIResourceAttributeValueResolver
// 0x0004 (0x0040 - 0x003C)
class UAIResourceAttributeValueResolver : public UAttributeValueResolver
{
public:
	class UAIResource*                                 Resource;                                         		// 0x003C (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = (UClass*)UObject::GObjObjects()->Data[3626];

		return pClassPointer;
	};
};

UClass* UAIResourceAttributeValueResolver::pClassPointer = NULL;

// Class WillowGame.AmmoDropWeightAttributeValueResolver
// 0x0054 (0x0090 - 0x003C)
class UAmmoDropWeightAttributeValueResolver : public UAttributeValueResolver
{
public:
	class UResourceDefinition*                         Resource;                                         		// 0x003C (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FAttributeInitializationData                ResourceThreshold;                                		// 0x0040 (0x0010) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FAttributeInitializationData                AboveThresholdWeight;                             		// 0x0050 (0x0010) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FAttributeInitializationData                NoPoolWeight;                                     		// 0x0060 (0x0010) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FAttributeInitializationData                MinBelowThresholdWeight;                          		// 0x0070 (0x0010) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FAttributeInitializationData                MaxBelowThresholdWeight;                          		// 0x0080 (0x0010) [0x0000000000000003]              ( CPF_Edit | CPF_Const )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = (UClass*)UObject::GObjObjects()->Data[3628];

		return pClassPointer;
	};
};

UClass* UAmmoDropWeightAttributeValueResolver::pClassPointer = NULL;

// Class WillowGame.AmmoResourcePool
// 0x0000 (0x0118 - 0x0118)
class UAmmoResourcePool : public UResourcePool
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = (UClass*)UObject::GObjObjects()->Data[3630];

		return pClassPointer;
	};

	void GetDebugText(TArray< struct FString >* DebugText);
	float GetExtraAmmoRegen();
};

UClass* UAmmoResourcePool::pClassPointer = NULL;

// Class WillowGame.AmmoResourceUpgradeAttributeValueResolver
// 0x0008 (0x0044 - 0x003C)
class UAmmoResourceUpgradeAttributeValueResolver : public UAttributeValueResolver
{
public:
	class UResourceDefinition*                         AssociatedResource;                               		// 0x003C (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	int                                                AmmoResourceUpgradesArrayIndex;                   		// 0x0040 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = (UClass*)UObject::GObjObjects()->Data[3632];

		return pClassPointer;
	};
};

UClass* UAmmoResourceUpgradeAttributeValueResolver::pClassPointer = NULL;

// Class WillowGame.AssetLibraryManager
// 0x00A8 (0x00E4 - 0x003C)
class UAssetLibraryManager : public UObject
{
public:
	struct FAssetLibConfig                             LibraryConfigs[0x6];                            		// 0x003C (0x0090) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FSKULibrarySet >                    EditorAssetLibraries;                             		// 0x00CC (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FSKURuntimeLibrarySet >             RuntimeAssetLibraries;                            		// 0x00D8 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = (UClass*)UObject::GObjObjects()->Data[3634];

		return pClassPointer;
	};

	int DetermineObjLibraryType(class UObject* Obj);
	int DetermineLibraryType(class UClass* LibraryType);
	bool DecodeTyped(int EncodedObj, unsigned char ObjType, int Revision, int SKUID, class UObject** DecodedResult);
	bool Decode(int EncodedObj, int Revision, int SKUID, class UObject** DecodedResult);
	int EncodeSKUID(int SKUID);
	int EncodeTyped(class UObject* Obj, unsigned char ObjType, int SKUID);
	int Encode(class UObject* Obj, int SKUID);
};

UClass* UAssetLibraryManager::pClassPointer = NULL;

// Class WillowGame.AttributePresentationDefinition
// 0x0098 (0x00D4 - 0x003C)
class UAttributePresentationDefinition : public UGBXDefinition
{
public:
	float                                              BasePriority;                                     		// 0x003C (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	class UAttributeDefinition*                        Attribute;                                        		// 0x0040 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FString                                     Description;                                      		// 0x0044 (0x000C) [0x0000000000408003]              ( CPF_Edit | CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     NoConstraintText;                                 		// 0x0050 (0x000C) [0x0000000000408003]              ( CPF_Edit | CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     Suffix;                                           		// 0x005C (0x000C) [0x0000000000408003]              ( CPF_Edit | CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     Prefix;                                           		// 0x0068 (0x000C) [0x0000000000408003]              ( CPF_Edit | CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	unsigned long                                      bIncludeSuffixInTranslation : 1;                  		// 0x0074 (0x0004) [0x0000000000000003] [0x00000001] ( CPF_Edit | CPF_Const )
	unsigned long                                      bIncludePrefixInTranslation : 1;                  		// 0x0074 (0x0004) [0x0000000000000003] [0x00000002] ( CPF_Edit | CPF_Const )
	unsigned long                                      bBiggerIsBetter : 1;                              		// 0x0074 (0x0004) [0x0000000000000003] [0x00000004] ( CPF_Edit | CPF_Const )
	unsigned long                                      bDisplayAsPercentage : 1;                         		// 0x0074 (0x0004) [0x0000000000000003] [0x00000008] ( CPF_Edit | CPF_Const )
	unsigned long                                      bDisplayPercentAsFloat : 1;                       		// 0x0074 (0x0004) [0x0000000000000003] [0x00000010] ( CPF_Edit | CPF_Const )
	unsigned long                                      bDisplayAsInverse : 1;                            		// 0x0074 (0x0004) [0x0000000000000003] [0x00000020] ( CPF_Edit | CPF_Const )
	unsigned long                                      bDontDisplayNumber : 1;                           		// 0x0074 (0x0004) [0x0000000000000003] [0x00000040] ( CPF_Edit | CPF_Const )
	unsigned long                                      bDontDisplayPlusSign : 1;                         		// 0x0074 (0x0004) [0x0000000000000003] [0x00000080] ( CPF_Edit | CPF_Const )
	unsigned long                                      bUseCustomNumberPlacement : 1;                    		// 0x0074 (0x0004) [0x0000000000000003] [0x00000100] ( CPF_Edit | CPF_Const )
	unsigned long                                      bEnableTextColor : 1;                             		// 0x0074 (0x0004) [0x0000000000000003] [0x00000200] ( CPF_Edit | CPF_Const )
	unsigned long                                      bValueRemappingEnabled : 1;                       		// 0x0074 (0x0004) [0x0000000000000002] [0x00000400] ( CPF_Const )
	unsigned long                                      bUseOneAsBaseValueForPresentationIfContextFailsToResolve : 1;		// 0x0074 (0x0004) [0x0000000000000003] [0x00000800] ( CPF_Edit | CPF_Const )
	unsigned long                                      bUseTwoAsBaseValueForPresentationIfContextFailsToResolve : 1;		// 0x0074 (0x0004) [0x0000000000000003] [0x00001000] ( CPF_Edit | CPF_Const )
	unsigned char                                      RoundingMode;                                     		// 0x0078 (0x0001) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	unsigned char                                      SignStyle;                                        		// 0x0079 (0x0001) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FColor                                      TextColor;                                        		// 0x007C (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	int                                                FloatPrecision;                                   		// 0x0080 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FString                                     Icon;                                             		// 0x0084 (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
	struct FAttributePresentationValueRemappingData    RemappingData;                                    		// 0x0090 (0x0044) [0x0000000000000003]              ( CPF_Edit | CPF_Const )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = (UClass*)UObject::GObjObjects()->Data[3636];

		return pClassPointer;
	};

	bool IncludePrefixInTranslation();
	bool IncludeSuffixInTranslation();
	bool IsTextColorEnabled();
	struct FColor GetTextColor();
	unsigned char GetSignStyle();
	unsigned char GetEffectiveRoundingMode(unsigned char Style);
	unsigned char GetRoundingMode();
	bool ShouldUseCustomNumberPlacement();
	bool ShouldDisplayPlusSign();
	bool ShouldDisplayNumberInTranslation();
	bool ShouldDisplayAsInverse();
	bool ShouldDisplayAsPercentage();
	bool IsBiggerBetter();
	struct FString GetIconFramename();
	struct FString GetPrefix();
	struct FString GetSuffix();
	struct FString GetNoConstraintText();
	struct FString GetDescription();
	float GetBasePriority();
	float RemapValue(float InputValue, class UObject* ContextSourceOverride);
	float RoundValue(float InputValue, int PrecisionAferDecimalPoint, unsigned char EffectiveRoundingMode);
	float ApplyPresentationRulesToValue(float ModifierValue, unsigned char Style, unsigned long bAllowZero, class UObject* ContextSourceOverride);
	struct FString ValueToString(float ModifierValue, unsigned char Style, class UObject* ContextSourceOverride);
	struct FString TranslateValue(float Value, unsigned char Style, class UAttributePresentationDefinition* ConstraintPresentation);
	struct FString TranslateStatData(unsigned char Style, struct FModifierValuePresentationData* StatData);
};

UClass* UAttributePresentationDefinition::pClassPointer = NULL;

// Class WillowGame.WeaponStatusEffectAttributePresentationDefinition
// 0x000C (0x00E0 - 0x00D4)
class UWeaponStatusEffectAttributePresentationDefinition : public UAttributePresentationDefinition
{
public:
	TArray< struct FAttributePresentationDamageTypeMapping > MappingData;                                      		// 0x00D4 (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = (UClass*)UObject::GObjObjects()->Data[3638];

		return pClassPointer;
	};
};

UClass* UWeaponStatusEffectAttributePresentationDefinition::pClassPointer = NULL;

// Class WillowGame.AttributePresentationListDefinition
// 0x000C (0x0048 - 0x003C)
class UAttributePresentationListDefinition : public UGBXDefinition
{
public:
	TArray< class UAttributePresentationDefinition* >  Attributes;                                       		// 0x003C (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = (UClass*)UObject::GObjObjects()->Data[3640];

		return pClassPointer;
	};

	class UAttributePresentationDefinition* FindAttributePresentation(class UAttributeDefinition* Attribute);
};

UClass* UAttributePresentationListDefinition::pClassPointer = NULL;

// Class WillowGame.AttributeSlotEffectAttributeValueResolver
// 0x000C (0x0048 - 0x003C)
class UAttributeSlotEffectAttributeValueResolver : public UAttributeValueResolver
{
public:
	unsigned char                                      SlotProperty;                                     		// 0x003C (0x0001) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FName                                       SlotName;                                         		// 0x0040 (0x0008) [0x0000000000000003]              ( CPF_Edit | CPF_Const )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = (UClass*)UObject::GObjObjects()->Data[3642];

		return pClassPointer;
	};
};

UClass* UAttributeSlotEffectAttributeValueResolver::pClassPointer = NULL;

// Class WillowGame.AvatarAwardUtility
// 0x0000 (0x003C - 0x003C)
class UAvatarAwardUtility : public UObject
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = (UClass*)UObject::GObjObjects()->Data[3644];

		return pClassPointer;
	};
};

UClass* UAvatarAwardUtility::pClassPointer = NULL;

// Class WillowGame.BadassAttributeValueResolver
// 0x0004 (0x0040 - 0x003C)
class UBadassAttributeValueResolver : public UAttributeValueResolver
{
public:
	class UBadassRewardDefinition*                     AssociatedBadassReward;                           		// 0x003C (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = (UClass*)UObject::GObjObjects()->Data[3646];

		return pClassPointer;
	};
};

UClass* UBadassAttributeValueResolver::pClassPointer = NULL;

// Class WillowGame.BadassRewardDefinition
// 0x0030 (0x006C - 0x003C)
class UBadassRewardDefinition : public UGBXDefinition
{
public:
	struct FString                                     RewardName;                                       		// 0x003C (0x000C) [0x0000000000408003]              ( CPF_Edit | CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     Description;                                      		// 0x0048 (0x000C) [0x0000000000408003]              ( CPF_Edit | CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     RewardString;                                     		// 0x0054 (0x000C) [0x0000000000408003]              ( CPF_Edit | CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	class UAttributeInitializationDefinition*          AttrInitDef;                                      		// 0x0060 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	class UAttributePresentationDefinition*            Presentation;                                     		// 0x0064 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	int                                                CachedRewardIndex;                                		// 0x0068 (0x0004) [0x0000000000002000]              ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = (UClass*)UObject::GObjObjects()->Data[3648];

		return pClassPointer;
	};

	void UpdateCachedRewardIndex();
};

UClass* UBadassRewardDefinition::pClassPointer = NULL;

// Class WillowGame.BalanceModifierDefinition
// 0x00B0 (0x00EC - 0x003C)
class UBalanceModifierDefinition : public UGBXDefinition
{
public:
	int                                                PlaythroughToBalance;                             		// 0x003C (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	TArray< struct FBalanceModification >              BalanceModifiers;                                 		// 0x0040 (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
	float                                              ModifierToXPGainedTowardsNewLevelsInEarlierPlaythroughs[0x2];		// 0x004C (0x0008) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	TArray< struct FBlackMarketPostLaunchUpgradeData > AdditionalAmmoSDUUpgrades;                        		// 0x0054 (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
	TArray< struct FBlackMarketPostLaunchUpgradeData > AdditionalBankStorageUpgrades;                    		// 0x0060 (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
	TArray< struct FBlackMarketPostLaunchUpgradeData > AdditionalBackpackSDUUpgrades;                    		// 0x006C (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
	TArray< struct FMapSpecificBalanceModificationList > MapSpecificBalanceModifiers;                      		// 0x0078 (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
	TArray< struct FMapSpecificBalanceModificationList > BalanceModifiersForPlayersWithOneLevelCapUpgrade; 		// 0x0084 (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
	TArray< struct FMapSpecificBalanceModificationList > BalanceModifiersForPlayersWithTwoLevelCapUpgrades;		// 0x0090 (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
	TArray< struct FMapSpecificBalanceModificationList > BalanceModifiersForPlayersWithTwoLevelCapUpgradesAndOverpower;		// 0x009C (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
	class UDownloadableFixupAIPawnNamesDefinition*     NewAIPawnNamesForThisPlayThrough;                 		// 0x00A8 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FAttributeInitializationData                GearDrops_CommonWeightModifier_PT1_BaseValueOverride;		// 0x00AC (0x0010) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FAttributeInitializationData                GearDrops_CommonWeightModifier_PT2_BaseValueOverride;		// 0x00BC (0x0010) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FAttributeInitializationData                ChestItemPool_Weight_2_Uncommon_PT1_Multiplier;   		// 0x00CC (0x0010) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FAttributeInitializationData                ChestItemPool_Weight_2_Uncommon_PT2_Multiplier;   		// 0x00DC (0x0010) [0x0000000000000003]              ( CPF_Edit | CPF_Const )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = (UClass*)UObject::GObjObjects()->Data[3650];

		return pClassPointer;
	};

	float GetAIDamageScaleBasedOnExpLevelDifferences(int ExpLevelOfInstigator, int ExpLevelOfTarget, int GameStage, float DefaultReturnValue);
	float GetStatusEffectChanceBasedOnExpLevelDifferences(int ExpLevelOfInstigator, int ExpLevelOfTarget, int GameStage, float DefaultReturnValue);
	float GetUncommonChestItemPoolWeightMultiplier(int GameStage);
	float GetCommonGearDropWeightBaseValue();
	class UDownloadableFixupAIPawnNamesDefinition* GetNewAIPawnNamesForThisPlayThrough();
	void UpdatePlayerVehicleDamage(class AWillowVehicle* PlayerVehicle);
	float GetAmmoDropsPerPlayerMultiplier(class UObject* ContextSource, int GameStage);
	float GetAmplifiedDamageMultiplier();
	float GetAdditionalEnemyDamageMultiplier(int EnemyGameStage, unsigned long bIsChampion);
	void ApplyPlayThroughBasedPlayerAttributeEffects(class AWillowPlayerController* Player);
	void UpdateSpawnedPlayerEnemyAIPawn(class AWillowAIPawn* SpawnedAIPawn, class AWillowMind* WMind);
	float GetXPEarnedMultiplier(class AWillowPlayerController* PlayerGettingXP, unsigned char ExperienceType);
};

UClass* UBalanceModifierDefinition::pClassPointer = NULL;

// Class WillowGame.Behavior_ActivateInstancedMissionBehaviorSequence
// 0x0010 (0x005C - 0x004C)
class UBehavior_ActivateInstancedMissionBehaviorSequence : public UBehaviorBase
{
public:
	class UMissionDefinition*                          Mission;                                          		// 0x004C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UMissionObjectiveDefinition*                 MissionObjective;                                 		// 0x0050 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       SequenceName;                                     		// 0x0054 (0x0008) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = (UClass*)UObject::GObjObjects()->Data[3652];

		return pClassPointer;
	};

	void ApplyBehaviorToContext(class UObject* ContextObject, class UObject* SelfObject, class UObject* MyInstigatorObject, class UObject* OtherEventParticipantObject, struct FBehaviorParameters EventData, struct FBehaviorKernelInfo* KernelInfo);
};

UClass* UBehavior_ActivateInstancedMissionBehaviorSequence::pClassPointer = NULL;

// Class WillowGame.Behavior_ActivateMission
// 0x0000 (0x004C - 0x004C)
class UBehavior_ActivateMission : public UBehaviorBase
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = (UClass*)UObject::GObjObjects()->Data[3654];

		return pClassPointer;
	};

	void ApplyBehaviorToContext(class UObject* ContextObject, class UObject* SelfObject, class UObject* MyInstigatorObject, class UObject* OtherEventParticipantObject, struct FBehaviorParameters EventData, struct FBehaviorKernelInfo* KernelInfo);
};

UClass* UBehavior_ActivateMission::pClassPointer = NULL;

// Class WillowGame.Behavior_AddMissionDirectives
// 0x000C (0x0058 - 0x004C)
class UBehavior_AddMissionDirectives : public UBehaviorBase
{
public:
	TArray< struct FMissionDirectorData >              MissionDirectives;                                		// 0x004C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = (UClass*)UObject::GObjObjects()->Data[3656];

		return pClassPointer;
	};

	void ApplyBehaviorToContext(class UObject* ContextObject, class UObject* SelfObject, class UObject* MyInstigatorObject, class UObject* OtherEventParticipantObject, struct FBehaviorParameters EventData, struct FBehaviorKernelInfo* KernelInfo);
};

UClass* UBehavior_AddMissionDirectives::pClassPointer = NULL;

// Class WillowGame.Behavior_AddMissionTime
// 0x0004 (0x0050 - 0x004C)
class UBehavior_AddMissionTime : public UBehaviorBase
{
public:
	float                                              SecondsToAdd;                                     		// 0x004C (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = (UClass*)UObject::GObjObjects()->Data[3658];

		return pClassPointer;
	};

	void ApplyBehaviorToContext(class UObject* ContextObject, class UObject* SelfObject, class UObject* MyInstigatorObject, class UObject* OtherEventParticipantObject, struct FBehaviorParameters EventData, struct FBehaviorKernelInfo* KernelInfo);
};

UClass* UBehavior_AddMissionTime::pClassPointer = NULL;

// Class WillowGame.Behavior_AdvanceObjectiveSet
// 0x0004 (0x0050 - 0x004C)
class UBehavior_AdvanceObjectiveSet : public UBehaviorBase
{
public:
	class UMissionObjectiveSetDefinition*              ObjectiveSetToAdvanceTo;                          		// 0x004C (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = (UClass*)UObject::GObjObjects()->Data[3660];

		return pClassPointer;
	};

	void ApplyBehaviorToContext(class UObject* ContextObject, class UObject* SelfObject, class UObject* MyInstigatorObject, class UObject* OtherEventParticipantObject, struct FBehaviorParameters EventData, struct FBehaviorKernelInfo* KernelInfo);
};

UClass* UBehavior_AdvanceObjectiveSet::pClassPointer = NULL;

// Class WillowGame.Behavior_AICloak
// 0x0008 (0x0054 - 0x004C)
class UBehavior_AICloak : public UBehaviorBase
{
public:
	unsigned char                                      NewCloakBehavior;                                 		// 0x004C (0x0001) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	unsigned long                                      bImmediate : 1;                                   		// 0x0050 (0x0004) [0x0000000000000003] [0x00000001] ( CPF_Edit | CPF_Const )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = (UClass*)UObject::GObjObjects()->Data[3662];

		return pClassPointer;
	};

	void ApplyBehaviorToContext(class UObject* ContextObject, class UObject* SelfObject, class UObject* MyInstigatorObject, class UObject* OtherEventParticipantObject, struct FBehaviorParameters EventData, struct FBehaviorKernelInfo* KernelInfo);
};

UClass* UBehavior_AICloak::pClassPointer = NULL;

// Class WillowGame.Behavior_AIThrowProjectileAtTarget
// 0x005C (0x00A8 - 0x004C)
class UBehavior_AIThrowProjectileAtTarget : public UBehaviorBase
{
public:
	int                                                NumProjectiles;                                   		// 0x004C (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FTrajectoryData                             Options;                                          		// 0x0050 (0x0020) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FVector                                     StartOffset;                                      		// 0x0070 (0x000C) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FName                                       StartSocket;                                      		// 0x007C (0x0008) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	TArray< struct FAttributeBaseValueData >           ChildProjectileBaseValues;                        		// 0x0084 (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
	class UProjectileDefinition*                       ProjectileDef;                                    		// 0x0090 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      bGrenade : 1;                                     		// 0x0094 (0x0004) [0x0000000000000003] [0x00000001] ( CPF_Edit | CPF_Const )
	class AWillowProjectile*                           ExistingProjectile;                               		// 0x0098 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	TArray< struct FAIThrowProjectileBehaviorSequenceStateData > SetProjectileSequenceState;                       		// 0x009C (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = (UClass*)UObject::GObjObjects()->Data[3664];

		return pClassPointer;
	};

	void PublishBehaviorOutput(class AWillowProjectile* SpawnedProjectile, struct FBehaviorKernelInfo* KernelInfo);
	void ThrowExisting(class UObject* ContextObject);
	void ThrowProjectile(class AWillowProjectile* NewProjectile, class UIAIInterface* AI, class UObject* ContextObject, int ExpLevel);
	void ApplyBehaviorToContext(class UObject* ContextObject, class UObject* SelfObject, class UObject* MyInstigatorObject, class UObject* OtherEventParticipantObject, struct FBehaviorParameters EventData, struct FBehaviorKernelInfo* KernelInfo);
};

UClass* UBehavior_AIThrowProjectileAtTarget::pClassPointer = NULL;

// Class WillowGame.Behavior_AttemptItemCallout
// 0x0010 (0x005C - 0x004C)
class UBehavior_AttemptItemCallout : public UBehaviorBase
{
public:
	class UGearboxDialogEventTag*                      DET_CallOut;                                      		// 0x004C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       InstanceDataName;                                 		// 0x0050 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      bMarkAsDiscovered : 1;                            		// 0x0058 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bTestVisibility : 1;                              		// 0x0058 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if (!pClassPointer)
			pClassPointer = (UClass*)UObject::GObjObjects()->Data[3666];

		return pClassPointer;
	};

	bool TestTargetVisibility(class UObject* Target, class APawn* Viewer);
	void ApplyBehaviorToContext(class UObject* ContextObject, class UObject* SelfObject, class UObject* MyInstigatorObject, class UObject* OtherEventParticipantObject, struct FBehaviorParameters EventData, struct FBehaviorKernelInfo* KernelInfo);
};

UClass* UBehavior_AttemptItemCallout::pClassPointer = NULL;

// Class WillowGame.Behavior_AttemptStatusEffect
// 0x0044 (0x0090 - 0x004C)
class UBehavior_AttemptStatusEffect : public UBehaviorBase
{
public:
	struct FPointer                                    VfTable_IIDamageCauser;                           		// 0x004C (0x0004) [0x0000000000801002]              ( CPF_Const | CPF_Native | CPF_NoExport )
	class UStatusEffectDefinition*                     StatusEffect;                                     		// 0x0050 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	TArray< struct FBehaviorContextData >              TargetContext;                                    		// 0x0054 (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
	struct FAttributeInitializationData                InstigatorChanceModifier;                         		// 0x0060 (0x0010) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
