#pragma once
// Borderlands 2 (1.8.5) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x4)
#endif

#include "stdafx.h"

//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class WillowGame.AchievementUtility
// 0x0000 (0x003C - 0x003C)
class UAchievementUtility : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AchievementUtility");
		return ptr;
	}


	static TArray<unsigned char> ShouldUnlockAchievementFromUnlockType(unsigned char UnlockType, const struct FString& StringData, int IntData, bool bCanBeGreater, bool bCheckStringAndIntData, bool bCanBeLess);
};


// Class WillowGame.ActionSkill
// 0x00AC (0x0188 - 0x0234)
class AActionSkill : public AActor
{
public:
	struct FPointer                                    VfTable_IIInstanceData;                                   // 0x0188(0x0004) (Const, Native, NoExport)
	struct FPointer                                    VfTable_IITimerBehavior;                                  // 0x018C(0x0004) (Const, Native, NoExport)
	struct FPointer                                    VfTable_IICustomEvent;                                    // 0x0190(0x0004) (Const, Native, NoExport)
	struct FPointer                                    VfTable_IIBehaviorConsumer;                               // 0x0194(0x0004) (Const, Native, NoExport)
	struct FPointer                                    VfTable_IIBehaviorProvider;                               // 0x0198(0x0004) (Const, Native, NoExport)
	struct FPointer                                    VfTable_IIConstructObject;                                // 0x019C(0x0004) (Const, Native, NoExport)
	float                                              TickRate;                                                 // 0x01A0(0x0004)
	float                                              NextTick;                                                 // 0x01A4(0x0004)
	class AController*                                 MyController;                                             // 0x01A8(0x0004)
	class AWillowPawn*                                 MyWillowPawn;                                             // 0x01AC(0x0004)
	class AWillowPlayerPawn*                           MyWillowPlayerPawn;                                       // 0x01B0(0x0004)
	class AWillowPlayerController*                     MyWillowPC;                                               // 0x01B4(0x0004)
	class AWillowMind*                                 MyWillowMind;                                             // 0x01B8(0x0004)
	class AWillowPawn*                                 TargetPawn;                                               // 0x01BC(0x0004) (Net)
	struct FInstanceDataSet                            InstanceState;                                            // 0x01C0(0x000C) (Transient, Component, NeedCtorLink)
	struct FBehaviorConsumerHandle                     ConsumerHandle;                                           // 0x01CC(0x0004)
	struct FReplicatedBehaviorConsumerState            ReplicatedBehaviorConsumerState;                          // 0x01D0(0x000C) (Net, RepNotify)
	struct FReplicatedBehaviorEvent                    ReplicatedBehaviorEvent;                                  // 0x01DC(0x0004) (Net, RepNotify)
	class UBehaviorProviderDefinition*                 BehaviorProviderDefinition;                               // 0x01E0(0x0004) (Edit)
	struct FTimerBehaviorUserState                     ActionSkillTimers;                                        // 0x01E4(0x0024)
	struct FActionSkillCustomEventReplicationData      CustomEventReplication;                                   // 0x0208(0x000C) (Net, RepNotify)
	unsigned long                                      bInitialized : 1;                                         // 0x0214(0x0004)
	unsigned long                                      bDebugEnabled : 1;                                        // 0x0214(0x0004)
	unsigned long                                      bBlockDeactivate : 1;                                     // 0x0214(0x0004)
	unsigned long                                      bWantsDeactivate : 1;                                     // 0x0214(0x0004)
	unsigned long                                      bWantsDestroy : 1;                                        // 0x0214(0x0004)
	unsigned long                                      bActionSkillNearingCompletionEventFired : 1;              // 0x0214(0x0004)
	unsigned long                                      bAllowAutomaticActiveAbilityActivation : 1;               // 0x0214(0x0004) (Edit, Const)
	unsigned long                                      bRestrictActiveAbilityByCount : 1;                        // 0x0214(0x0004) (Edit, Const)
	unsigned long                                      bRestrictActiveAbilityByTimeFrequency : 1;                // 0x0214(0x0004) (Edit, Const)
	unsigned long                                      bAllowAutomaticCooldownAbilityActivation : 1;             // 0x0214(0x0004) (Edit, Const)
	unsigned long                                      bRestrictCooldownAbilityByCount : 1;                      // 0x0214(0x0004) (Edit, Const)
	unsigned long                                      bRestrictCooldownAbilityByTimeFrequency : 1;              // 0x0214(0x0004) (Edit, Const)
	float                                              ActionSkillNearingCompletionTime;                         // 0x0218(0x0004) (Edit)
	int                                                MaxActivationCountPerActiveCycle;                         // 0x021C(0x0004) (Edit, Const)
	float                                              ActiveAbilityActivationTimeFrequency;                     // 0x0220(0x0004) (Edit, Const)
	int                                                MaxActivationCountPerCooldownCycle;                       // 0x0224(0x0004) (Edit, Const)
	float                                              CooldownAbilityActivationTimeFrequency;                   // 0x0228(0x0004) (Edit, Const)
	class USkillDefinition*                            MeleeOverrideSkill;                                       // 0x022C(0x0004) (Edit, Const)
	int                                                TimeStarted;                                              // 0x0230(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("ActionSkill");
		return ptr;
	}


	bool ShouldResetOnInterruptedGrenadeThrow();
	bool CanResetActionSkill();
	bool OverrideCrosshairVisibility(bool bVisible, bool bForScope);
	float GetDeferredActionSkillTime();
	void TickActionSkillHUD(class UWillowHUDGFxMovie* HUDMovie, float ActionSkillTime, float DeltaTime);
	void DisableActionSkillHUD(class UWillowHUDGFxMovie* HUDMovie);
	void EnableActionSkillHUD(class UWillowHUDGFxMovie* HUDMovie);
	struct FBehaviorConsumerHandle GetBehaviorConsumerHandle();
	class UObject* GetActionSkillEventContextObject();
	void RunCustomEvent(const struct FName& EventName, class UObject* EventInstigator, class UObject* OtherEventParticipantObject, const struct FBehaviorParameters& EventData);
	void HandleTimerEvent(unsigned char EventType, const struct FBehaviorParameters& EventData);
	bool SetTimerState(unsigned char TimerId, const struct FBehaviorTimerState& TimerState);
	bool GetTimerState(unsigned char TimerId, struct FBehaviorTimerState* TimerState);
	float GetTimeSeconds();
	bool GetReplicatedInstanceDataState(struct FReplicatedInstanceDataState* OutReplicatedInstanceDataState);
	bool GetInstanceDataState(struct FInstanceDataSet* OutInstanceDataState);
	void DestroyOwnedInstanceData();
	bool RemoveInstanceDataObject(class UObject* InstanceDataObject);
	bool RemoveInstanceData(const struct FName& DataName);
	bool GetInstanceData(const struct FName& DataName, TArray<struct FInstanceDataUnion>* InstanceData);
	bool SetInstanceData(const struct FInstanceDataUnion& InstanceData, bool bAllowDuplicateNames);
	void EnableDebug(bool DebugEnabled);
	void NotifyActionSkillActiveAbility(class AWillowPawn* TheWillowPawn, class AController* TheController, float ActionSkillDuration, float ActiveTimeRemaining, class AWillowPawn* TheTargetPawn);
	void StartActionSkillActiveAbility(class AWillowPawn* TheWillowPawn, class AController* TheController, float ActionSkillDuration, float ActiveTimeRemaining, class AWillowPawn* TheTargetPawn);
	void ClientStartActionSkillActiveAbility(class AWillowPawn* TheWillowPawn, class AController* TheController, float ActionSkillDuration, float ActiveTimeRemaining, class AWillowPawn* TheTargetPawn);
	bool AllowNewActiveAbilityActivation(int* CurrentActionSkillActiveAbilityCount, float* NextActionSkillActiveAbilityTime);
	bool AllowAutomaticActiveAbilityActivation();
	bool AllowNewCooldownAbilityActivation(int* CurrentActionSkillCooldownAbilityCount, float* NextActionSkillCooldownAbilityTime);
	bool AllowAutomaticCooldownAbilityActivation();
	void OnActionSkillTick(float DeltaTime);
	bool OverridesStandardMelee();
	bool ReadyToInterceptMelee(class AWillowPawn* AutoAimTarget);
	void OnActionSkillOwnerMelee(class AWillowPawn* TargetIfAvailable);
	void OnActionSkillWeaponsRestricted(bool bWeaponsRestricted);
	void OnActionSkillOwnerInjured();
	void OnActionSkillKilledEnemy(class AWillowPawn* KilledPawn);
	void OnActionSkillShowBackMenu(bool bOpened);
	void OnActionSkillFakePause(bool bPaused);
	void OnActionSkillOwnerTouchedActor(class AActor* Other, class UPrimitiveComponent* OtherComp, const struct FVector& HitLocation, const struct FVector& HitNormal);
	void OnActionSkillOwnerHitWall(const struct FVector& HitNormal, class AActor* Wall, class UPrimitiveComponent* WallComp);
	void OnActionSkillOwnerStoppedWalking();
	void OnActionSkillOwnerBeganWalking(unsigned char PreviousPhysics);
	void OnActionSkillOwnerBeganFalling(unsigned char PreviousPhysics);
	void OnActionSkillOwnerAllieganceChanged(class UPawnAllegiance* NewAllegiance);
	void OnActionSkillOwnerWeaponSwitched(class AWeapon* OldWeapon, class AWeapon* NewWeapon);
	void OnActionSkillOwnerDied();
	void OwnerLostAutoAimTarget(const FScriptInterface& OldTargetable);
	void OwnerAcquiredAutoAimTarget(const FScriptInterface& NewTargetable);
	void TornOff();
	void TearOff();
	void OnActionSkillEnded();
	bool IsDeactivateBlocked();
	void ClientActionSkillWantsToDeactivate();
	void OnActionSkillWantsToDeactivate();
	void OnActionSkillStarted(class AWillowPawn* TheWillowPawn, class AController* TheController, class AWillowPawn* TheTargetPawn);
	void ReplicatedEvent(const struct FName& VarName);
	void OnActionSkillOwnerShowBackMenu(class APawn* SkillInstigator, bool bOpened, struct FBehaviorConsumerHandle* TheConsumerHandle);
	void OnTimerEvent(const struct FName& SpecializedEventName, struct FBehaviorConsumerHandle* TheConsumerHandle);
	void OnActionSkillNearingCompletion(class APawn* SkillInstigator, class APawn* SkillTargetIfAvailable, struct FBehaviorConsumerHandle* TheConsumerHandle);
	void OnActionSkillOwnerMeleeOverridden(class APawn* SkillInstigator, class APawn* SkillTargetIfAvailable, struct FBehaviorConsumerHandle* TheConsumerHandle);
	void OnOwnerLostAutoAimTarget(class APawn* SkillOwner, class AActor* OldTargetIfAvailable, struct FBehaviorConsumerHandle* TheConsumerHandle);
	void OnOwnerAcquiredAutoAimTarget(class APawn* SkillOwner, class AActor* NewTargetIfAvailable, struct FBehaviorConsumerHandle* TheConsumerHandle);
	void OnActionSkillDeactivated(class APawn* SkillInstigator, struct FBehaviorConsumerHandle* TheConsumerHandle);
	void OnActionSkillActivated(class APawn* SkillInstigator, class APawn* SkillTargetIfAvailable, struct FBehaviorConsumerHandle* TheConsumerHandle);
	void OnActionSkillActiveAbilityNotified(class APawn* SkillInstigator, float ActiveTimeRemaining, class APawn* SkillTargetIfAvailable, struct FBehaviorConsumerHandle* TheConsumerHandle);
	void OnActionSkillActiveAbilityActivated(class APawn* SkillInstigator, float ActiveTimeRemaining, class APawn* SkillTargetIfAvailable, struct FBehaviorConsumerHandle* TheConsumerHandle);
	void SetBehaviorProviderDefinition(class UBehaviorProviderDefinition* NewBehaviorProviderDefinition);
	class UBehaviorProviderDefinition* GetBehaviorProviderDefinition();
};


// Class WillowGame.ScorpioActionSkill
// 0x0014 (0x0234 - 0x0248)
class AScorpioActionSkill : public AActionSkill
{
public:
	class ADeployableTurretActor*                      ScorpioSpawnedActor;                                      // 0x0234(0x0004)
	class ADeployableTurretActor*                      GeminiSpawnedActor;                                       // 0x0238(0x0004)
	class AWillowProjectile*                           ActiveProjectile;                                         // 0x023C(0x0004)
	class USkillDefinition*                            GeminiSkill;                                              // 0x0240(0x0004) (Edit, Const)
	class USpecialMoveDefinition*                      ThrowScorpioSMD;                                          // 0x0244(0x0004) (Edit, Const)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("ScorpioActionSkill");
		return ptr;
	}


	bool ShouldResetOnInterruptedGrenadeThrow();
	bool CanResetActionSkill();
	void NotifySkillActorDied(class AActor* SkillActor);
	class UObject* GetActionSkillEventContextObject();
	void ClientDeployScorpio();
	void DeployScorpio();
	void PlayThrowAnimation();
	void DestroyOwnedInstanceData();
	bool RemoveInstanceData(const struct FName& DataName);
	bool GetInstanceData(const struct FName& DataName, TArray<struct FInstanceDataUnion>* InstanceData);
	bool SetInstanceData(const struct FInstanceDataUnion& InstanceData, bool bAllowDuplicateNames);
	bool AllowNewActiveAbilityActivation(int* CurrentActionSkillActiveAbilityCount, float* NextActionSkillActiveAbilityTime);
	void StartActionSkillActiveAbility(class AWillowPawn* TheWillowPawn, class AController* TheController, float ActionSkillDuration, float ActiveTimeRemaining, class AWillowPawn* AutoAimTarget);
	void OnActionSkillOwnerDied();
	void OnActionSkillEnded();
	void OnActionSkillStarted(class AWillowPawn* TheWillowPawn, class AController* TheController, class AWillowPawn* TheTargetPawn);
};


// Class WillowGame.ActorFactoryInteractiveObject
// 0x0004 (0x007C - 0x0080)
class UActorFactoryInteractiveObject : public UActorFactory
{
public:
	class UInteractiveObjectDefinition*                Definition;                                               // 0x007C(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("ActorFactoryInteractiveObject");
		return ptr;
	}

};


// Class WillowGame.ActorFactoryWillowElevatorButton
// 0x0000 (0x0080 - 0x0080)
class UActorFactoryWillowElevatorButton : public UActorFactoryInteractiveObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("ActorFactoryWillowElevatorButton");
		return ptr;
	}

};


// Class WillowGame.ActorFactoryMissionPickupSpawner
// 0x0004 (0x007C - 0x0080)
class UActorFactoryMissionPickupSpawner : public UActorFactory
{
public:
	class UMissionItemDefinition*                      Definition;                                               // 0x007C(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("ActorFactoryMissionPickupSpawner");
		return ptr;
	}

};


// Class WillowGame.ActorFactoryMissionPickupFailsafe
// 0x0000 (0x0080 - 0x0080)
class UActorFactoryMissionPickupFailsafe : public UActorFactoryMissionPickupSpawner
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("ActorFactoryMissionPickupFailsafe");
		return ptr;
	}

};


// Class WillowGame.ActorFactoryPopulationOpportunityArea
// 0x0000 (0x007C - 0x007C)
class UActorFactoryPopulationOpportunityArea : public UActorFactory
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("ActorFactoryPopulationOpportunityArea");
		return ptr;
	}

};


// Class WillowGame.ActorFactoryPopulationOpportunityDen
// 0x0000 (0x007C - 0x007C)
class UActorFactoryPopulationOpportunityDen : public UActorFactory
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("ActorFactoryPopulationOpportunityDen");
		return ptr;
	}

};


// Class WillowGame.ActorFactoryWillowCoopPlayerStart
// 0x0000 (0x007C - 0x007C)
class UActorFactoryWillowCoopPlayerStart : public UActorFactory
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("ActorFactoryWillowCoopPlayerStart");
		return ptr;
	}

};


// Class WillowGame.ActorFactoryWillowElevator
// 0x0000 (0x0094 - 0x0094)
class UActorFactoryWillowElevator : public UActorFactoryMover
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("ActorFactoryWillowElevator");
		return ptr;
	}

};


// Class WillowGame.ActorFactoryWillowPawn
// 0x0004 (0x007C - 0x0080)
class UActorFactoryWillowPawn : public UActorFactory
{
public:
	class AWillowPawn*                                 PawnArchetype;                                            // 0x007C(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("ActorFactoryWillowPawn");
		return ptr;
	}

};


// Class WillowGame.ActorFactoryWillowTrigger
// 0x0000 (0x007C - 0x007C)
class UActorFactoryWillowTrigger : public UActorFactory
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("ActorFactoryWillowTrigger");
		return ptr;
	}

};


// Class WillowGame.ActorFactoryWillowVehicle
// 0x0004 (0x007C - 0x0080)
class UActorFactoryWillowVehicle : public UActorFactory
{
public:
	class AWillowVehicle*                              VehicleArchetype;                                         // 0x007C(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("ActorFactoryWillowVehicle");
		return ptr;
	}

};


// Class WillowGame.ActorFactoryWillowVehicleFactory
// 0x0000 (0x0080 - 0x0080)
class UActorFactoryWillowVehicleFactory : public UActorFactoryWillowVehicle
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("ActorFactoryWillowVehicleFactory");
		return ptr;
	}

};


// Class WillowGame.ActorFactoryWillowWaypoint
// 0x0000 (0x007C - 0x007C)
class UActorFactoryWillowWaypoint : public UActorFactory
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("ActorFactoryWillowWaypoint");
		return ptr;
	}

};


// Class WillowGame.AdvancedAxisDefinition
// 0x001C (0x003C - 0x0058)
class UAdvancedAxisDefinition : public UGBXDefinition
{
public:
	float                                              Speed;                                                    // 0x003C(0x0004) (Edit, Const)
	float                                              ZoomSpeed;                                                // 0x0040(0x0004) (Edit, Const)
	float                                              DeadZone;                                                 // 0x0044(0x0004) (Edit, Const)
	float                                              AccelThreshold;                                           // 0x0048(0x0004) (Edit, Const)
	float                                              AccelRate;                                                // 0x004C(0x0004) (Edit, Const)
	float                                              AccelSpeed;                                               // 0x0050(0x0004) (Edit, Const)
	float                                              AccelWarmup;                                              // 0x0054(0x0004) (Edit, Const)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AdvancedAxisDefinition");
		return ptr;
	}

};


// Class WillowGame.AIPawnBalanceModifierDefinition
// 0x001C (0x003C - 0x0058)
class UAIPawnBalanceModifierDefinition : public UGBXDefinition
{
public:
	struct FString                                     AIPawnBalanceDefinitionPath;                              // 0x003C(0x000C) (Edit, NeedCtorLink)
	unsigned long                                      bEmptyAttributeStartingValues : 1;                        // 0x0048(0x0004) (Edit, Const)
	TArray<struct FAttributeBaseValueData>             AttributeStartingValues;                                  // 0x004C(0x000C) (Edit, Const, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AIPawnBalanceModifierDefinition");
		return ptr;
	}

};


// Class WillowGame.AIResourceAttributeValueResolver
// 0x0004 (0x003C - 0x0040)
class UAIResourceAttributeValueResolver : public UAttributeValueResolver
{
public:
	class UAIResource*                                 Resource;                                                 // 0x003C(0x0004) (Edit, Const)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AIResourceAttributeValueResolver");
		return ptr;
	}

};


// Class WillowGame.AmmoDropWeightAttributeValueResolver
// 0x0054 (0x003C - 0x0090)
class UAmmoDropWeightAttributeValueResolver : public UAttributeValueResolver
{
public:
	class UResourceDefinition*                         Resource;                                                 // 0x003C(0x0004) (Edit, Const)
	struct FAttributeInitializationData                ResourceThreshold;                                        // 0x0040(0x0010) (Edit, Const)
	struct FAttributeInitializationData                AboveThresholdWeight;                                     // 0x0050(0x0010) (Edit, Const)
	struct FAttributeInitializationData                NoPoolWeight;                                             // 0x0060(0x0010) (Edit, Const)
	struct FAttributeInitializationData                MinBelowThresholdWeight;                                  // 0x0070(0x0010) (Edit, Const)
	struct FAttributeInitializationData                MaxBelowThresholdWeight;                                  // 0x0080(0x0010) (Edit, Const)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AmmoDropWeightAttributeValueResolver");
		return ptr;
	}

};


// Class WillowGame.AmmoResourcePool
// 0x0000 (0x0118 - 0x0118)
class UAmmoResourcePool : public UResourcePool
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AmmoResourcePool");
		return ptr;
	}


	void GetDebugText(TArray<struct FString>* DebugText);
	float GetExtraAmmoRegen();
};


// Class WillowGame.AmmoResourceUpgradeAttributeValueResolver
// 0x0008 (0x003C - 0x0044)
class UAmmoResourceUpgradeAttributeValueResolver : public UAttributeValueResolver
{
public:
	class UResourceDefinition*                         AssociatedResource;                                       // 0x003C(0x0004) (Edit, Const)
	int                                                AmmoResourceUpgradesArrayIndex;                           // 0x0040(0x0004) (Edit, Const)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AmmoResourceUpgradeAttributeValueResolver");
		return ptr;
	}

};


// Class WillowGame.AnemoneInfectionDefinition
// 0x0060 (0x003C - 0x009C)
class UAnemoneInfectionDefinition : public UGBXDefinition
{
public:
	float                                              FullInfectionTime;                                        // 0x003C(0x0004) (Edit)
	float                                              FullHealingTime;                                          // 0x0040(0x0004) (Edit)
	class UGFxMovieDefinition*                         MovieDefinition;                                          // 0x0044(0x0004) (Edit)
	float                                              DisplaySpeed;                                             // 0x0048(0x0004) (Edit)
	float                                              DiscoveryTextHiddenTime;                                  // 0x004C(0x0004) (Edit)
	class UParticleSystem*                             InfectionFXTemplate;                                      // 0x0050(0x0004) (Edit)
	class USkillDefinition*                            GasCloudSkill;                                            // 0x0054(0x0004) (Edit)
	class UParticleSystem*                             SkillFXTemplate;                                          // 0x0058(0x0004) (Edit)
	float                                              SkillFXInTime;                                            // 0x005C(0x0004) (Edit)
	float                                              SkillFXOutTime;                                           // 0x0060(0x0004) (Edit)
	class UParticleSystem*                             SmallAmbientFXTemplate;                                   // 0x0064(0x0004) (Edit)
	class UParticleSystem*                             LargeAmbientFXTemplate;                                   // 0x0068(0x0004) (Edit)
	class UAkEvent*                                    StartEvent;                                               // 0x006C(0x0004) (Edit)
	class UAkEvent*                                    StopEvent;                                                // 0x0070(0x0004) (Edit)
	class UAkRtpc*                                     AkRtpc;                                                   // 0x0074(0x0004) (Edit)
	class UMissionObjectiveDefinition*                 LinkedObjective;                                          // 0x0078(0x0004) (Edit)
	struct FAttributeInitializationData                FullyInfectedDamage;                                      // 0x007C(0x0010) (Edit, Const)
	class UClass*                                      DamageType;                                               // 0x008C(0x0004) (Edit)
	float                                              DamageFrequency;                                          // 0x0090(0x0004) (Edit)
	float                                              FogDensityValue;                                          // 0x0094(0x0004) (Edit)
	float                                              FogRampUpTime;                                            // 0x0098(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnemoneInfectionDefinition");
		return ptr;
	}

};


// Class WillowGame.IScreenParticle
// 0x0000 (0x003C - 0x003C)
class UIScreenParticle : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("IScreenParticle");
		return ptr;
	}


	void UpdateVisibilityOfAllActiveScreenParticles();
	bool ScreenParticlesShouldBeVisible();
	void SetUpVoGScreenParticle(class UParticleSystem* Template, const struct FName& TextureMovieParamName);
	void HideScreenParticle(class UParticleSystem* Template, const struct FName& ParticleTag, bool bAllowParticleToFinish);
	void ShowScreenParticle(const struct FScreenParticleInitParams& InitParams);
};


// Class WillowGame.IUpdatePostProcessOverride
// 0x0000 (0x003C - 0x003C)
class UIUpdatePostProcessOverride : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("IUpdatePostProcessOverride");
		return ptr;
	}


	void EndLostShield();
	void BeginLostShield(const struct FName& HealthParamName, const struct FName& MaterialEffectName, float UpdateRate, class UPostProcessChain* InChain);
	void PopPostProcessChain(class UPostProcessChain* InChain, const struct FPostProcessChainOptions& InChainOptions);
	void PushPostProcessChain(class UPostProcessChain* InChain, const struct FPostProcessChainOptions& InChainOptions);
	void ClearPostProcessOverlayQueue(int IndexToSave);
	void SetupPostProcessOverlay(int Index, bool bReset);
	int GetPostProcessOverlayIndex(const struct FName& OverrideName);
	int AddPostProcessOverlay(const struct FPostProcessOverlay& NewPostProcessOverlay);
};


// Class WillowGame.AnemoneInfectionState
// 0x0058 (0x0188 - 0x01E0)
class AAnemoneInfectionState : public AActor
{
public:
	class UGFxMovieInteractiveObject*                  TimerMovie;                                               // 0x0188(0x0004) (Transient)
	class AWillowPlayerController*                     WPC;                                                      // 0x018C(0x0004) (Transient)
	float                                              InfectionRate;                                            // 0x0190(0x0004) (Transient)
	float                                              CurrentInfection;                                         // 0x0194(0x0004) (Transient)
	float                                              CurrentSkillFXValue;                                      // 0x0198(0x0004) (Transient)
	float                                              SkillFXSpeed;                                             // 0x019C(0x0004) (Transient)
	float                                              DamageTimer;                                              // 0x01A0(0x0004) (Transient)
	float                                              TemporarilyHiddenTimer;                                   // 0x01A4(0x0004) (Transient)
	unsigned long                                      bIsLocalPlayer : 1;                                       // 0x01A8(0x0004) (Transient)
	unsigned long                                      bIsImmune : 1;                                            // 0x01A8(0x0004) (Transient)
	TArray<class AActor*>                              SmallZones;                                               // 0x01AC(0x000C) (Transient, NeedCtorLink)
	TArray<class AActor*>                              LargeZones;                                               // 0x01B8(0x000C) (Transient, NeedCtorLink)
	class UAnemoneInfectionDefinition*                 InfectionDefinition;                                      // 0x01C4(0x0004) (Transient)
	class AHeightFog*                                  HeightFog;                                                // 0x01C8(0x0004) (Transient)
	float                                              HeightFogValue;                                           // 0x01CC(0x0004) (Transient)
	struct FFDisplayTimer                              DisplayTimer;                                             // 0x01D0(0x0010)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnemoneInfectionState");
		return ptr;
	}


	void DoInfectionDamage();
	void NotifyPawnDied();
	void UpdateZone();
	void Tick(float DeltaTime);
	void StateTick(float DeltaTime);
	void UpdateDisplay(float DeltaTime);
	void UpdateHeightFog(float DeltaTime);
	void ShowAmbientFX(bool bShow);
	void ShowParticleSystem(bool bShow, class UParticleSystem* FXSystemTemplate);
	void UpdateSkillFX();
	void UpdateSkillFXValue(float DeltaTime);
	void ShowSkillFX(bool bShow);
	void UpdateInfectionFX(float CurrentValue);
	void ShowInfectionFX(bool bShow);
	void DeactivateSkill();
	void ActivateSkill();
	void ExitInfectionVolume();
	void EnterInfectionVolume();
	void SetModalMenuOpen(bool bOpen);
	void HideBarTemporarily();
	bool IsInfected();
	void SetAnemoneInfectionState(class AWillowPlayerController* OwnerController, bool bIsInfected, bool bLargeZone, class AActor* Zone, class UAnemoneInfectionDefinition* NewInfectionDefinition, class AHeightFog* NewHeightFog);
	bool CheckZoneCollision();
	bool AddZone(bool bLargeZone, class AActor* Zone);
	float GetStatusEffectDamage();
	void ToggleInfectionEffects(bool bEnable, class AWillowPlayerController* OwnerController);
	bool CheckImmunity();
	void StopInfectionSound();
	void UpdateInfectionSound();
	void StartInfectionSound();
};


// Class WillowGame.AssetLibraryManager
// 0x00A8 (0x003C - 0x00E4)
class UAssetLibraryManager : public UObject
{
public:
	struct FAssetLibConfig                             LibraryConfigs[0x6];                                      // 0x003C(0x0018) (NeedCtorLink)
	TArray<struct FSKULibrarySet>                      EditorAssetLibraries;                                     // 0x00CC(0x000C) (NeedCtorLink)
	TArray<struct FSKURuntimeLibrarySet>               RuntimeAssetLibraries;                                    // 0x00D8(0x000C) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AssetLibraryManager");
		return ptr;
	}


	int DetermineObjLibraryType(class UObject* Obj);
	int DetermineLibraryType(class UClass* LibraryType);
	bool DecodeTyped(int EncodedObj, unsigned char ObjType, int Revision, int SKUID, class UObject** DecodedResult);
	bool Decode(int EncodedObj, int Revision, int SKUID, class UObject** DecodedResult);
	int EncodeSKUID(int SKUID);
	int EncodeTyped(class UObject* Obj, unsigned char ObjType, int SKUID);
	int Encode(class UObject* Obj, int SKUID);
};


// Class WillowGame.AttributePresentationDefinition
// 0x0098 (0x003C - 0x00D4)
class UAttributePresentationDefinition : public UGBXDefinition
{
public:
	float                                              BasePriority;                                             // 0x003C(0x0004) (Edit, Const)
	class UAttributeDefinition*                        Attribute;                                                // 0x0040(0x0004) (Edit, Const)
	struct FString                                     Description;                                              // 0x0044(0x000C) (Edit, Const, Localized, NeedCtorLink)
	struct FString                                     NoConstraintText;                                         // 0x0050(0x000C) (Edit, Const, Localized, NeedCtorLink)
	struct FString                                     Suffix;                                                   // 0x005C(0x000C) (Edit, Const, Localized, NeedCtorLink)
	struct FString                                     Prefix;                                                   // 0x0068(0x000C) (Edit, Const, Localized, NeedCtorLink)
	unsigned long                                      bIncludeSuffixInTranslation : 1;                          // 0x0074(0x0004) (Edit, Const)
	unsigned long                                      bIncludePrefixInTranslation : 1;                          // 0x0074(0x0004) (Edit, Const)
	unsigned long                                      bBiggerIsBetter : 1;                                      // 0x0074(0x0004) (Edit, Const)
	unsigned long                                      bDisplayAsPercentage : 1;                                 // 0x0074(0x0004) (Edit, Const)
	unsigned long                                      bDisplayPercentAsFloat : 1;                               // 0x0074(0x0004) (Edit, Const)
	unsigned long                                      bDisplayAsInverse : 1;                                    // 0x0074(0x0004) (Edit, Const)
	unsigned long                                      bDontDisplayNumber : 1;                                   // 0x0074(0x0004) (Edit, Const)
	unsigned long                                      bDontDisplayPlusSign : 1;                                 // 0x0074(0x0004) (Edit, Const)
	unsigned long                                      bUseCustomNumberPlacement : 1;                            // 0x0074(0x0004) (Edit, Const)
	unsigned long                                      bEnableTextColor : 1;                                     // 0x0074(0x0004) (Edit, Const)
	unsigned long                                      bValueRemappingEnabled : 1;                               // 0x0074(0x0004) (Const)
	unsigned long                                      bUseOneAsBaseValueForPresentationIfContextFailsToResolve : 1;// 0x0074(0x0004) (Edit, Const)
	unsigned long                                      bUseTwoAsBaseValueForPresentationIfContextFailsToResolve : 1;// 0x0074(0x0004) (Edit, Const)
	unsigned char                                      RoundingMode;                                             // 0x0078(0x0001) (Edit, Const)
	unsigned char                                      SignStyle;                                                // 0x0079(0x0001) (Edit, Const)
	unsigned char                                      UnknownData00[0x2];                                       // 0x007A(0x0002) MISSED OFFSET
	struct FColor                                      TextColor;                                                // 0x007C(0x0004) (Edit, Const)
	int                                                FloatPrecision;                                           // 0x0080(0x0004) (Edit, Const)
	struct FString                                     Icon;                                                     // 0x0084(0x000C) (Edit, Const, NeedCtorLink)
	struct FAttributePresentationValueRemappingData    RemappingData;                                            // 0x0090(0x0044) (Edit, Const)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AttributePresentationDefinition");
		return ptr;
	}


	bool IncludePrefixInTranslation();
	bool IncludeSuffixInTranslation();
	bool IsTextColorEnabled();
	struct FColor GetTextColor();
	unsigned char GetSignStyle();
	unsigned char GetEffectiveRoundingMode(unsigned char Style);
	unsigned char GetRoundingMode();
	bool ShouldUseCustomNumberPlacement();
	bool ShouldDisplayPlusSign();
	bool ShouldDisplayNumberInTranslation();
	bool ShouldDisplayAsInverse();
	bool ShouldDisplayAsPercentage();
	bool IsBiggerBetter();
	struct FString GetIconFramename();
	struct FString GetPrefix();
	struct FString GetSuffix();
	struct FString GetNoConstraintText();
	struct FString GetDescription();
	float GetBasePriority();
	float RemapValue(float InputValue, class UObject* ContextSourceOverride);
	static float RoundValue(float InputValue, int PrecisionAferDecimalPoint, unsigned char EffectiveRoundingMode);
	float ApplyPresentationRulesToValue(float ModifierValue, unsigned char Style, bool bAllowZero, class UObject* ContextSourceOverride);
	struct FString ValueToString(float ModifierValue, unsigned char Style, class UObject* ContextSourceOverride);
	struct FString TranslateValue(float Value, unsigned char Style, class UAttributePresentationDefinition* ConstraintPresentation);
	static struct FString TranslateStatData(unsigned char Style, struct FModifierValuePresentationData* StatData);
};


// Class WillowGame.WeaponStatusEffectAttributePresentationDefinition
// 0x000C (0x00D4 - 0x00E0)
class UWeaponStatusEffectAttributePresentationDefinition : public UAttributePresentationDefinition
{
public:
	TArray<struct FAttributePresentationDamageTypeMapping> MappingData;                                              // 0x00D4(0x000C) (Edit, Const, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("WeaponStatusEffectAttributePresentationDefinition");
		return ptr;
	}

};


// Class WillowGame.AttributePresentationListDefinition
// 0x000C (0x003C - 0x0048)
class UAttributePresentationListDefinition : public UGBXDefinition
{
public:
	TArray<class UAttributePresentationDefinition*>    Attributes;                                               // 0x003C(0x000C) (Edit, Const, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AttributePresentationListDefinition");
		return ptr;
	}


	class UAttributePresentationDefinition* FindAttributePresentation(class UAttributeDefinition* Attribute);
};


// Class WillowGame.AttributeSlotEffectAttributeValueResolver
// 0x000C (0x003C - 0x0048)
class UAttributeSlotEffectAttributeValueResolver : public UAttributeValueResolver
{
public:
	unsigned char                                      SlotProperty;                                             // 0x003C(0x0001) (Edit, Const)
	unsigned char                                      UnknownData00[0x3];                                       // 0x003D(0x0003) MISSED OFFSET
	struct FName                                       SlotName;                                                 // 0x0040(0x0008) (Edit, Const)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AttributeSlotEffectAttributeValueResolver");
		return ptr;
	}

};


// Class WillowGame.AvatarAwardUtility
// 0x0000 (0x003C - 0x003C)
class UAvatarAwardUtility : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AvatarAwardUtility");
		return ptr;
	}

};


// Class WillowGame.BadassAttributeValueResolver
// 0x0004 (0x003C - 0x0040)
class UBadassAttributeValueResolver : public UAttributeValueResolver
{
public:
	class UBadassRewardDefinition*                     AssociatedBadassReward;                                   // 0x003C(0x0004) (Edit, Const)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("BadassAttributeValueResolver");
		return ptr;
	}

};


// Class WillowGame.BadassRewardDefinition
// 0x0030 (0x003C - 0x006C)
class UBadassRewardDefinition : public UGBXDefinition
{
public:
	struct FString                                     RewardName;                                               // 0x003C(0x000C) (Edit, Const, Localized, NeedCtorLink)
	struct FString                                     Description;                                              // 0x0048(0x000C) (Edit, Const, Localized, NeedCtorLink)
	struct FString                                     RewardString;                                             // 0x0054(0x000C) (Edit, Const, Localized, NeedCtorLink)
	class UAttributeInitializationDefinition*          AttrInitDef;                                              // 0x0060(0x0004) (Edit, Const)
	class UAttributePresentationDefinition*            Presentation;                                             // 0x0064(0x0004) (Edit, Const)
	int                                                CachedRewardIndex;                                        // 0x0068(0x0004) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("BadassRewardDefinition");
		return ptr;
	}


	void UpdateCachedRewardIndex();
};


// Class WillowGame.WillowExperiencePipeline
// 0x0000 (0x003C - 0x003C)
class UWillowExperiencePipeline : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("WillowExperiencePipeline");
		return ptr;
	}


	static void AwardCombatExperienceToParty(float ExperiencePoints, class AWillowPlayerController* Killer, class AActor* KilledActor);
	static float CalculateExperiencePointsForKill(class AWillowPlayerController* Killer, class AActor* KilledActor, bool bFatalBlowWasCriticalHit, class UClass* FatalBlowDamageSource, class UDamageTypeDefinition* FatalBlowDamageTypeDefinition);
};


// Class WillowGame.GlobalsDefinition
// 0x0968 (0x0048 - 0x09B0)
class UGlobalsDefinition : public UGearboxGlobalsDefinition
{
public:
	int                                                BulletReflectionRadius;                                   // 0x0048(0x0004) (Edit, Const)
	float                                              BulletReflectionSpeedAdjustment;                          // 0x004C(0x0004) (Edit, Const)
	class UParticleSystem*                             BulletReflectionParticle;                                 // 0x0050(0x0004) (Edit, Const)
	struct FAttributeInitializationData                BulletReflectionInaccuracyFormula;                        // 0x0054(0x0010) (Edit, Const)
	class UParticleSystem*                             BulletPenetratedEnemyParticle;                            // 0x0064(0x0004) (Edit, Const)
	class UAkEvent*                                    BulletPenetratedEnemyAkEvent;                             // 0x0068(0x0004) (Edit, Const)
	struct FName                                       DualWieldSwitchName;                                      // 0x006C(0x0008) (Edit, Const)
	struct FName                                       DualWieldSprintSwitchName;                                // 0x0074(0x0008) (Edit, Const)
	struct FName                                       DualWieldLeftSideControl;                                 // 0x007C(0x0008) (Edit, Const)
	TArray<struct FKillSkillDuration>                  KillSkillDurationsPerPlayers;                             // 0x0084(0x000C) (Edit, Const, EditFixedSize, NeedCtorLink)
	struct FAttributeInitializationData                GeneralSkillPointsPerLevelUp;                             // 0x0090(0x0010) (Edit, Const)
	struct FAttributeInitializationData                GeneralSkillPointsTotalForCurrentLevel;                   // 0x00A0(0x0010) (Edit, Const)
	struct FAttributeInitializationData                SpecialistSkillPointsPerLevelUp;                          // 0x00B0(0x0010) (Edit, Const)
	struct FAttributeInitializationData                CostToResetSkillPoints;                                   // 0x00C0(0x0010) (Edit, Const)
	TArray<class USkillDefinition*>                    WeaponProficiencySkills;                                  // 0x00D0(0x000C) (Edit, Const, NeedCtorLink)
	struct FAttributeInitializationData                BaseEnemyExperienceFormula;                               // 0x00DC(0x0010) (Edit, Const)
	TArray<struct FDamageTypeExpModifier>              DamageTypeExpModifiers;                                   // 0x00EC(0x000C) (Edit, Const, NeedCtorLink)
	TArray<struct FLevelBasedExpScale>                 ExpScaleByLevelDifference;                                // 0x00F8(0x000C) (Edit, Const, NeedCtorLink)
	TArray<struct FExpAwardWeight>                     ExpAwardWeights;                                          // 0x0104(0x000C) (Edit, Const, EditFixedSize, NeedCtorLink)
	int                                                ExpMaxPlayerLevel;                                        // 0x0110(0x0004) (Edit)
	struct FAttributeInitializationData                ExpPointsRequiredForLevel;                                // 0x0114(0x0010) (Edit, Const)
	struct FAttributeInitializationData                VehicleVSCharacterExpModifier;                            // 0x0124(0x0010) (Edit, Const)
	struct FAttributeInitializationData                WorldDiscoveryExperienceFormula;                          // 0x0134(0x0010) (Edit, Const)
	class UMissionObjectiveDefinition*                 FastTravelObjective;                                      // 0x0144(0x0004) (Edit, Const)
	int                                                TravelDelay;                                              // 0x0148(0x0004) (Edit, Const)
	class UTravelStationDefinition*                    DlcPreviousStation;                                       // 0x014C(0x0004) (Edit, Const)
	struct FName                                       SanctuaryMapName;                                         // 0x0150(0x0008) (Edit, Const)
	struct FName                                       SanctuaryAirMapName;                                      // 0x0158(0x0008) (Edit, Const)
	struct FName                                       SanctuaryBackupMapName;                                   // 0x0160(0x0008) (Edit, Const)
	class UMissionObjectiveDefinition*                 SanctuaryInaccessibleObjective;                           // 0x0168(0x0004) (Edit, Const)
	class UMissionObjectiveDefinition*                 SanctuaryFlyingObjective;                                 // 0x016C(0x0004) (Edit, Const)
	float                                              MinTeleportTime;                                          // 0x0170(0x0004) (Edit, Const)
	class UAkEvent*                                    TeleporterStartAkEvent;                                   // 0x0174(0x0004) (Edit, Const)
	class UAkEvent*                                    TeleporterStopAkEvent;                                    // 0x0178(0x0004) (Edit, Const)
	class UParticleSystem*                             TeleporterHoldingCellPartSys;                             // 0x017C(0x0004) (Edit, Const)
	class UDesignerAttributeDefinition*                StartupTeleporterAttribute;                               // 0x0180(0x0004) (Edit, Const)
	struct FAttributeInitializationData                TeleportCost;                                             // 0x0184(0x0010) (Edit, Const)
	class UAkEvent*                                    PauseAkEvent;                                             // 0x0194(0x0004) (Edit, Const)
	class UAkEvent*                                    UnpauseAkEvent;                                           // 0x0198(0x0004) (Edit, Const)
	class UAkSwitch*                                   DefaultMaterialAkSwitch;                                  // 0x019C(0x0004) (Edit, Const)
	class UAkSwitch*                                   FirstPersonAkSwitch;                                      // 0x01A0(0x0004) (Edit, Const)
	class UAkSwitch*                                   ThirdPersonAkSwitch;                                      // 0x01A4(0x0004) (Edit, Const)
	class UAkEvent*                                    EchoStartedAkEvent;                                       // 0x01A8(0x0004) (Edit, Const)
	class UAkEvent*                                    EchoEndedAkEvent;                                         // 0x01AC(0x0004) (Edit, Const)
	class UAkRtpc*                                     MasterVolumeAkRtpc;                                       // 0x01B0(0x0004) (Edit, Const)
	class UAkRtpc*                                     UserVolumeMusicAkRtpc;                                    // 0x01B4(0x0004) (Edit, Const)
	class UAkRtpc*                                     UserVolumeSfxAkRtpc;                                      // 0x01B8(0x0004) (Edit, Const)
	class UAkRtpc*                                     UserVolumeVOAkRtpc;                                       // 0x01BC(0x0004) (Edit, Const)
	class UAkRtpc*                                     ListenerDistanceAkRtpc;                                   // 0x01C0(0x0004) (Edit, Const)
	class UAkRtpc*                                     ApproachSpeedAkRtpc;                                      // 0x01C4(0x0004) (Edit, Const)
	class UAkRtpc*                                     SpeedAkRtpc;                                              // 0x01C8(0x0004) (Edit, Const)
	class UAkEvent*                                    ResetStatesAkEvent;                                       // 0x01CC(0x0004) (Edit, Const)
	class UAkEvent*                                    StartSplitScreenAkEvent;                                  // 0x01D0(0x0004) (Edit, Const)
	class UAkState*                                    PlayerVoiceAkState;                                       // 0x01D4(0x0004) (Edit, Const)
	class UAkState*                                    JackVoiceAkState;                                         // 0x01D8(0x0004) (Edit, Const)
	class UAkState*                                    PlayerCalloutsDisabledAkState;                            // 0x01DC(0x0004) (Edit, Const)
	class UAkState*                                    PlayerCalloutsEnabledAkState;                             // 0x01E0(0x0004) (Edit, Const)
	class UAkEvent*                                    CinematicModePauseDialogAkEvent;                          // 0x01E4(0x0004) (Edit, Const)
	class UAkEvent*                                    CinematicModeResumeDialogAkEvent;                         // 0x01E8(0x0004) (Edit, Const)
	class UAkEvent*                                    ShieldLowWarningStartAkEvent;                             // 0x01EC(0x0004) (Edit, Const)
	class UAkEvent*                                    ShieldLowWarningStopAkEvent;                              // 0x01F0(0x0004) (Edit, Const)
	class UAkEvent*                                    ShieldRecoveringAkEvent;                                  // 0x01F4(0x0004) (Edit, Const)
	class UAkEvent*                                    ShieldRecoveredAkEvent;                                   // 0x01F8(0x0004) (Edit, Const)
	class UAkEvent*                                    ShieldDownAkEvent;                                        // 0x01FC(0x0004) (Edit, Const)
	float                                              TinnitusEffectDecayRate;                                  // 0x0200(0x0004) (Edit, Const)
	class UAkRtpc*                                     TinnitusEffectStrengthRTPC;                               // 0x0204(0x0004) (Edit, Const)
	class UAkRtpc*                                     TinnitusSourcePannerRTPC;                                 // 0x0208(0x0004) (Edit, Const)
	class UAkRtpc*                                     TinnitusSourceStrengthRTPC;                               // 0x020C(0x0004) (Edit, Const)
	class UAkEvent*                                    TinnitusAkEvent;                                          // 0x0210(0x0004) (Edit, Const)
	class UAkEvent*                                    LevelUpAkEvent;                                           // 0x0214(0x0004) (Edit, Const)
	class UAkEvent*                                    VOVolumeStartAkEvent;                                     // 0x0218(0x0004) (Edit, Const)
	class UAkEvent*                                    VOVolumeStopAkEvent;                                      // 0x021C(0x0004) (Edit, Const)
	class UAkEvent*                                    SFXVolumeStartAkEvent;                                    // 0x0220(0x0004) (Edit, Const)
	class UAkEvent*                                    SFXVolumeStopAkEvent;                                     // 0x0224(0x0004) (Edit, Const)
	class UAkEvent*                                    MusicVolumeStartAkEvent;                                  // 0x0228(0x0004) (Edit, Const)
	class UAkEvent*                                    MusicVolumeStopAkEvent;                                   // 0x022C(0x0004) (Edit, Const)
	class USoundMode*                                  LoadingSoundMode;                                         // 0x0230(0x0004) (Edit, Const)
	class USoundMode*                                  EchoSoundMode;                                            // 0x0234(0x0004) (Edit, Const)
	class USoundMode*                                  DefaultSoundMode;                                         // 0x0238(0x0004) (Edit, Const)
	TArray<class UAkEvent*>                            SoundsToAlwaysReference;                                  // 0x023C(0x000C) (Edit, Const, NeedCtorLink)
	float                                              PlayerInteractionDistance;                                // 0x0248(0x0004) (Edit, Const)
	class UResourceDefinition*                         GrenadeAmmoDefinition;                                    // 0x024C(0x0004) (Edit, Const)
	class UProjectileDefinition*                       StandardGrenadeDefinition;                                // 0x0250(0x0004) (Edit, Const)
	float                                              ShowEchoTalkerDistance;                                   // 0x0254(0x0004) (Edit, Const)
	float                                              HideEchoTalkerDistance;                                   // 0x0258(0x0004) (Edit, Const)
	class UAkRtpc*                                     EchoDistortionAkRtpc;                                     // 0x025C(0x0004) (Edit, Const)
	float                                              MissionAcceptEchoDelay;                                   // 0x0260(0x0004) (Edit, Const)
	class UResourceDefinition*                         AmmoDefinition_RepeaterPistol;                            // 0x0264(0x0004) (Edit, Const)
	class UResourceDefinition*                         AmmoDefinition_RevolverPistol;                            // 0x0268(0x0004) (Edit, Const)
	class UResourceDefinition*                         AmmoDefinition_Shotgun;                                   // 0x026C(0x0004) (Edit, Const)
	class UResourceDefinition*                         AmmoDefinition_SMG;                                       // 0x0270(0x0004) (Edit, Const)
	class UResourceDefinition*                         AmmoDefinition_CombatRifle;                               // 0x0274(0x0004) (Edit, Const)
	class UResourceDefinition*                         AmmoDefinition_SniperRifle;                               // 0x0278(0x0004) (Edit, Const)
	class UResourceDefinition*                         AmmoDefinition_RocketLauncher;                            // 0x027C(0x0004) (Edit, Const)
	float                                              PlayerEventRetriggerDelaySeconds;                         // 0x0280(0x0004) (Edit, Const)
	TArray<struct FRarityLevelColor>                   RarityLevelColors;                                        // 0x0284(0x000C) (Edit, Const, NeedCtorLink)
	int                                                MissionItemRarityLevel;                                   // 0x0290(0x0004) (Edit, Const)
	TArray<struct FPlayThroughData>                    RegionBalanceData;                                        // 0x0294(0x000C) (Edit, Const, NeedCtorLink)
	struct FAttributeInitializationData                GameStageIncreaseAbovePlayer;                             // 0x02A0(0x0010) (Edit, Const)
	float                                              OtherPlayerDiedCostMultiplier;                            // 0x02B0(0x0004) (Edit, Const)
	struct FAttributeInitializationData                GlobalAIDamageScale;                                      // 0x02B4(0x0010) (Edit, Const)
	struct FAttributeInitializationData                GlobalAIWeaponDamageScale;                                // 0x02C4(0x0010) (Edit, Const)
	struct FAttributeInitializationData                GlobalAIPistolWeaponDamageScale;                          // 0x02D4(0x0010) (Edit, Const)
	struct FAttributeInitializationData                GlobalAIShotgunWeaponDamageScale;                         // 0x02E4(0x0010) (Edit, Const)
	struct FAttributeInitializationData                GlobalAISmgWeaponDamageScale;                             // 0x02F4(0x0010) (Edit, Const)
	struct FAttributeInitializationData                GlobalAISniperWeaponDamageScale;                          // 0x0304(0x0010) (Edit, Const)
	struct FAttributeInitializationData                GlobalAIAssaultWeaponDamageScale;                         // 0x0314(0x0010) (Edit, Const)
	struct FAttributeInitializationData                GlobalAIRocketWeaponDamageScale;                          // 0x0324(0x0010) (Edit, Const)
	TArray<struct FLevelBasedDamageScale>              PlayerDamageScaleByLevelDifference;                       // 0x0334(0x000C) (Edit, Const, NeedCtorLink)
	TArray<struct FLevelBasedDamageScale>              AIDamageScaleByLevelDifference;                           // 0x0340(0x000C) (Edit, Const, NeedCtorLink)
	float                                              SelfInflictedDamageMultiplier;                            // 0x034C(0x0004) (Edit, Const)
	struct FAttributeInitializationData                GlobalFallingDamageScale;                                 // 0x0350(0x0010) (Edit, Const)
	float                                              FriendlyDamageModifier;                                   // 0x0360(0x0004) (Edit, Const, Deprecated)
	TArray<struct FStatusEffectTypeCommonProperties>   StatusEffectCommonProperties;                             // 0x0364(0x000C) (Edit, Const, NeedCtorLink)
	TArray<struct FLevelBasedStatusEffectChanceScale>  StatusEffectChanceScales;                                 // 0x0370(0x000C) (Edit, Const, NeedCtorLink)
	float                                              FriendlyStatusEffectChanceModifier;                       // 0x037C(0x0004) (Edit, Const)
	class UParticleSystem*                             DamageDisplayParticles;                                   // 0x0380(0x0004) (Edit)
	struct FName                                       DamageDisplayParticleColorParamName;                      // 0x0384(0x0008) (Edit)
	struct FName                                       DamageDisplayParticleDamageParamName;                     // 0x038C(0x0008) (Edit)
	struct FName                                       DamageDisplayParticleSizeParamName;                       // 0x0394(0x0008) (Edit)
	float                                              DamageDisplayParticleSizeMinDist;                         // 0x039C(0x0004) (Edit)
	float                                              DamageDisplayParticleSizeMaxDist;                         // 0x03A0(0x0004) (Edit)
