#pragma once
// Borderlands 2 (1.8.5) SDK

#ifdef _MSC_VER
#pragma pack(push, 0x4)
#endif

#include "stdafx.h"

//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class GearboxFramework.ActorFactoryClone
// 0x0014 (0x007C - 0x0090)
class UActorFactoryClone : public UActorFactory
{
public:
	TArray<class AGearboxPawn*>                        CloneArchetype;                                           // 0x007C(0x000C) (Edit, NeedCtorLink)
	struct FName                                       NewCloneTag;                                              // 0x0088(0x0008) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("ActorFactoryClone");
		return ptr;
	}

};


// Class GearboxFramework.ActorFactoryWireTerminal
// 0x0000 (0x007C - 0x007C)
class UActorFactoryWireTerminal : public UActorFactory
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("ActorFactoryWireTerminal");
		return ptr;
	}

};


// Class GearboxFramework.AIDebugCamera
// 0x0050 (0x003C - 0x008C)
class UAIDebugCamera : public UObject
{
public:
	class AGearboxMind*                                Mind;                                                     // 0x003C(0x0004)
	class URuleEngine*                                 RuleEngine;                                               // 0x0040(0x0004)
	TArray<struct FDebugListItem>                      DisplayList;                                              // 0x0044(0x000C) (NeedCtorLink)
	unsigned long                                      bSnapshotModeOn : 1;                                      // 0x0050(0x0004)
	unsigned long                                      bShowFlags : 1;                                           // 0x0050(0x0004) (Config, GlobalConfig)
	unsigned long                                      bShowRules : 1;                                           // 0x0050(0x0004) (Config, GlobalConfig)
	unsigned long                                      bShowInactiveRules : 1;                                   // 0x0050(0x0004) (Config, GlobalConfig)
	unsigned long                                      bShowResources : 1;                                       // 0x0050(0x0004) (Config, GlobalConfig)
	unsigned long                                      bShowCombat : 1;                                          // 0x0050(0x0004) (Config, GlobalConfig)
	unsigned long                                      bShowRuleEngineLoadBalance : 1;                           // 0x0050(0x0004) (Config, GlobalConfig)
	unsigned long                                      bShowAwarenessZones : 1;                                  // 0x0050(0x0004) (Config, GlobalConfig)
	unsigned long                                      bShowTargetViewCones : 1;                                 // 0x0050(0x0004) (Config, GlobalConfig)
	unsigned long                                      bShowTimers : 1;                                          // 0x0050(0x0004) (Config, GlobalConfig)
	unsigned long                                      bShowAITree : 1;                                          // 0x0050(0x0004)
	int                                                SnapshotNdx;                                              // 0x0054(0x0004)
	class USnapshotRecord*                             CurSnapshot;                                              // 0x0058(0x0004)
	class UPopUpDebugBarGraph*                         PopUpGraphTop;                                            // 0x005C(0x0004) (Transient)
	class UPopUpDebugBarGraph*                         PopUpGraphCenter;                                         // 0x0060(0x0004) (Transient)
	struct FName                                       CurrentInspectedTargetName;                               // 0x0064(0x0008)
	float                                              TopBarGraphStartXPct;                                     // 0x006C(0x0004) (Const)
	float                                              TopBarGraphStartYPct;                                     // 0x0070(0x0004) (Const)
	float                                              CenterBarGraphStartXPct;                                  // 0x0074(0x0004) (Const)
	float                                              CenterBarGraphStartYPct;                                  // 0x0078(0x0004) (Const)
	float                                              Column2XOffset;                                           // 0x007C(0x0004) (Const)
	float                                              Column1LastY;                                             // 0x0080(0x0004)
	float                                              Column2LastY;                                             // 0x0084(0x0004)
	int                                                LastColumnDrawnTo;                                        // 0x0088(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AIDebugCamera");
		return ptr;
	}


	void ToggleAITree();
	void ToggleTargetViewCones();
	void ToggleAwarenessZones();
	void ToggleRuleEngineLoadBalance();
	void ToggleCombat();
	void ToggleShowTimers();
	void ToggleResources();
	void ToggleInactiveRules();
	void ToggleRules();
	void ToggleFlags();
	class UAITracker* GetTracker();
	void SetMind(class AGearboxMind* NewMind);
	void InitDummies(int NewNumDummies);
	bool WantsToDoCameraInspection();
	void SetCurrentInspectedTarget(const struct FName& NewName);
	void CompareRuleSetAndAdjustRuleIdx(class USnapshotRecord* OldSnapshot, class USnapshotRecord* NewSnapshot);
	void SetRuleEngine(class URuleEngine* NewRuleEngine);
	void SetPrevSnapshotRule();
	void SetNextSnapshotRule();
	void SetPrevSnapshot();
	void SetNextSnapshot();
	void NotifyGameUnPaused();
	void NotifyGamePaused();
	void Display(class AHUD* HUD);
};


// Class GearboxFramework.AITracker
// 0x00D4 (0x003C - 0x0110)
class UAITracker : public UObject
{
public:
	class USnapshotRecord*                             Snapshots[0x32];                                          // 0x003C(0x0004) (Transient)
	int                                                SnapshotSize;                                             // 0x0104(0x0004)
	int                                                SnapshotIndex;                                            // 0x0108(0x0004)
	class AActor*                                      DebugOwner;                                               // 0x010C(0x0004) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AITracker");
		return ptr;
	}

};


// Class GearboxFramework.SpecialMoveInterface
// 0x0000 (0x003C - 0x003C)
class USpecialMoveInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("SpecialMoveInterface");
		return ptr;
	}


	void SetReplicatedSMData(struct FSpecialMoveData* NewSMData);
	void ServerSpecialMove_StopAny();
	void ServerSpecialMove_Stop(class USpecialMoveDefinition* OldSMD);
	void ServerSpecialMove_Queue(class USpecialMoveDefinition* NewSMD, float PlayRateScale, float Duration, const struct FName& CallbackName, class UObject* CallbackObject, class UObject* Data);
	void ServerSpecialMove_Play(class USpecialMoveDefinition* NewSMD, float PlayRateScale, float Duration, const struct FName& CallbackName, class UObject* CallbackObject, class UObject* Data);
	unsigned char GetDefaultRootMotionRotationMode();
	unsigned char GetDefaultRootMotionMode();
	class USkeletalMeshComponent* GetSkelMesh();
	class USpecialMoveComponent* GetSMComponent();
	class AActor* GetActor();
};


// Class GearboxFramework.AnimNodeSpecialMoveBlend
// 0x0020 (0x00EC - 0x010C)
class UAnimNodeSpecialMoveBlend : public UAnimNodeSlot
{
public:
	unsigned char                                      AnimState;                                                // 0x00EC(0x0001) (Transient)
	unsigned char                                      UnknownData00[0x3];                                       // 0x00ED(0x0003) MISSED OFFSET
	float                                              SavedBlendOutTime;                                        // 0x00F0(0x0004) (Transient)
	FScriptInterface                                   SMI;                                                      // 0x00F4(0x0008) (Transient)
	TArray<struct FSlotAnimParameters>                 AnimParameters;                                           // 0x00FC(0x000C) (Transient, NeedCtorLink)
	unsigned long                                      bForceLocalSpaceBlend : 1;                                // 0x0108(0x0004) (Edit, Const)
	unsigned long                                      IssueNotifiesWhenZeroWeight : 1;                          // 0x0108(0x0004) (Edit, Const)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimNodeSpecialMoveBlend");
		return ptr;
	}


	bool IsPlaying(class UGearboxAnimDefinition* AnimSMD);
	void SetRootMotion(class URootMotionDefinition* RMDef);
	class UGearboxAnimDefinition* GetCurrentAnimDef();
	struct FName GetCurrentAnimName();
	void Finish(bool bInterrupted);
	void Stop(bool bInterrupted);
	float PlayData(const struct FName& AnimNameOverride, float PlayRateScale, float BlendInOverride, float BlendOutOverride, struct FSpecialMoveData* SMData);
	float Play(class UGearboxAnimDefinition* CustomAnimSMD, const struct FName& AnimNameOverride, float PlayRateScale, float BlendInOverride, float BlendOutOverride);
};


// Class GearboxFramework.AttributeExpressionEvaluator
// 0x0010 (0x003C - 0x004C)
class UAttributeExpressionEvaluator : public UExpressionEvaluator
{
public:
	struct FAttributeExpressionData                    Expression;                                               // 0x003C(0x0010) (Edit, Const)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AttributeExpressionEvaluator");
		return ptr;
	}


	bool Evaluate(class UObject* ContextSource);
};


// Class GearboxFramework.Behavior_CallFunction
// 0x0008 (0x004C - 0x0054)
class UBehavior_CallFunction : public UBehaviorBase
{
public:
	struct FName                                       FunctionName;                                             // 0x004C(0x0008) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Behavior_CallFunction");
		return ptr;
	}


	void CallFunction(class AActor* inActor, const struct FName& InFunctionName);
	void ApplyBehaviorToContext(class UObject* ContextObject, class UObject* SelfObject, class UObject* MyInstigatorObject, class UObject* OtherEventParticipantObject, const struct FBehaviorParameters& EventData, struct FBehaviorKernelInfo* KernelInfo);
};


// Class GearboxFramework.IBehaviorConsumer
// 0x0000 (0x003C - 0x003C)
class UIBehaviorConsumer : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("IBehaviorConsumer");
		return ptr;
	}


	struct FBehaviorConsumerHandle GetBehaviorConsumerHandle();
};


// Class GearboxFramework.Behavior_ChangeRemoteBehaviorSequenceState
// 0x0044 (0x004C - 0x0090)
class UBehavior_ChangeRemoteBehaviorSequenceState : public UBehaviorBase
{
public:
	unsigned char                                      Action;                                                   // 0x004C(0x0001) (Edit, Const)
	unsigned char                                      UnknownData00[0x3];                                       // 0x004D(0x0003) MISSED OFFSET
	struct FName                                       SequenceName;                                             // 0x0050(0x0008) (Edit, Const)
	class UObject*                                     SequenceProvider;                                         // 0x0058(0x0004) (Edit, Const)
	struct FNameBasedObjectPath                        ProviderDefinitionPathName;                               // 0x005C(0x0034) (Const)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Behavior_ChangeRemoteBehaviorSequenceState");
		return ptr;
	}


	void ApplyBehaviorToContext(class UObject* ContextObject, class UObject* SelfObject, class UObject* MyInstigatorObject, class UObject* OtherEventParticipantObject, const struct FBehaviorParameters& EventData, struct FBehaviorKernelInfo* KernelInfo);
};


// Class GearboxFramework.ITimerBehavior
// 0x0000 (0x003C - 0x003C)
class UITimerBehavior : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("ITimerBehavior");
		return ptr;
	}


	bool SetTimerState(unsigned char TimerId, const struct FBehaviorTimerState& TimerState);
	bool GetTimerState(unsigned char TimerId, struct FBehaviorTimerState* TimerState);
	float GetTimeSeconds();
};


// Class GearboxFramework.Behavior_ChangeTimer
// 0x001C (0x004C - 0x0068)
class UBehavior_ChangeTimer : public UBehaviorBase
{
public:
	unsigned char                                      TimerId;                                                  // 0x004C(0x0001) (Edit, Const)
	unsigned char                                      Reaction;                                                 // 0x004D(0x0001) (Edit, Const)
	unsigned char                                      UnknownData00[0x2];                                       // 0x004E(0x0002) MISSED OFFSET
	unsigned long                                      bSetNewTimerDelay : 1;                                    // 0x0050(0x0004) (Edit, Const)
	struct FAttributeInitializationData                NewTimerDelayFormula;                                     // 0x0054(0x0010) (Edit, Const)
	float                                              NewTimerDelay;                                            // 0x0064(0x0004) (Const, Deprecated)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Behavior_ChangeTimer");
		return ptr;
	}


	void ApplyBehaviorToContext(class UObject* ContextObject, class UObject* SelfObject, class UObject* MyInstigatorObject, class UObject* OtherEventParticipantObject, const struct FBehaviorParameters& EventData, struct FBehaviorKernelInfo* KernelInfo);
};


// Class GearboxFramework.Behavior_IsSequenceEnabled
// 0x0040 (0x004C - 0x008C)
class UBehavior_IsSequenceEnabled : public UBehaviorBase
{
public:
	struct FName                                       SequenceName;                                             // 0x004C(0x0008) (Edit, Const)
	class UObject*                                     SequenceProvider;                                         // 0x0054(0x0004) (Edit, Const)
	struct FNameBasedObjectPath                        ProviderDefinitionPathName;                               // 0x0058(0x0034) (Const)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Behavior_IsSequenceEnabled");
		return ptr;
	}


	void ApplyBehaviorToContext(class UObject* ContextObject, class UObject* SelfObject, class UObject* MyInstigatorObject, class UObject* OtherEventParticipantObject, const struct FBehaviorParameters& EventData, struct FBehaviorKernelInfo* KernelInfo);
};


// Class GearboxFramework.Behavior_PostAkEvent
// 0x0010 (0x004C - 0x005C)
class UBehavior_PostAkEvent : public UBehaviorBase
{
public:
	class UAkEvent*                                    Event;                                                    // 0x004C(0x0004) (Edit)
	unsigned long                                      bReplicateEvent : 1;                                      // 0x0050(0x0004) (Edit)
	unsigned long                                      bForLocalPlayerOnly : 1;                                  // 0x0050(0x0004) (Edit)
	unsigned long                                      bForcePlayImmediate : 1;                                  // 0x0050(0x0004) (Edit)
	unsigned long                                      bPlayFromActor : 1;                                       // 0x0050(0x0004) (Edit)
	unsigned long                                      bLatentWhenNoConnections : 1;                             // 0x0050(0x0004)
	struct FAkPlayingInfo                              PlayingInfo;                                              // 0x0054(0x0008) (Transient, Component)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Behavior_PostAkEvent");
		return ptr;
	}


	void ApplyBehaviorToContext(class UObject* ContextObject, class UObject* SelfObject, class UObject* MyInstigatorObject, class UObject* OtherEventParticipantObject, const struct FBehaviorParameters& EventData, struct FBehaviorKernelInfo* KernelInfo);
};


// Class GearboxFramework.BehaviorHelpers
// 0x0018 (0x003C - 0x0054)
class UBehaviorHelpers : public UObject
{
public:
	struct FScriptDelegate                             __BehaviorSetStrategy__Delegate;                          // 0x003C(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __BehaviorStrategy__Delegate;                             // 0x0048(0x000C) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("BehaviorHelpers");
		return ptr;
	}


	static void RunAllBehaviorsForEvent(const struct FName& EventName, const struct FScriptDelegate& SetStrategy, const struct FScriptDelegate& Strategy, class UObject* SelfObject, class UObject* MyInstigatorObject, class UObject* OtherEventParticipantObject, const struct FBehaviorParameters& EventData, unsigned char EnumValue);
	void BehaviorStrategy(const struct FPointer& BehaviorSet, const struct FName& EventName, unsigned char EnumValue, TArray<class UBehaviorBase*>* BehaviorList);
	void BehaviorSetStrategy(TArray<struct FPointer>* BehaviorSetList);
	static class UBehaviorProviderDefinition* ResolveBehaviorProviderDefinitionReference(class UBehaviorBase* SourceBehavior, class UObject* ProviderReference, struct FNameBasedObjectPath* PathName);
	static bool IsBehaviorsV2(struct FBehaviorKernelInfo* KernelInfo);
	static bool ShouldContinueExecution(float TimeBetweenSteps, int MaxSteps, struct FBehaviorKernelInfo* KernelInfo, int* NumSteps);
	static struct FName GetNextFireLocationSocket(unsigned char FireSocketSelection, TArray<struct FName> FireLocationSocketNames, TArray<struct FName>* FireLocationSocketsRemaining);
	static bool GetRotationFromAttachmentLocationData(const struct FAttachmentLocationData& AttachmentLocation, struct FRotator* AttachmentLocationRotation);
	static struct FVector GetRelativeDirection(const struct FRelativeDirectionData& DesiredDirection, const FScriptInterface& Source, const struct FVector& DefaultDirection, const struct FName& SpawnSocketName);
};


// Class GearboxFramework.CompoundExpressionEvaluator
// 0x000C (0x003C - 0x0048)
class UCompoundExpressionEvaluator : public UExpressionEvaluator
{
public:
	class UExpressionEvaluator*                        Expression1;                                              // 0x003C(0x0004) (Edit, EditInline)
	unsigned char                                      Operator;                                                 // 0x0040(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0041(0x0003) MISSED OFFSET
	class UExpressionEvaluator*                        Expression2;                                              // 0x0044(0x0004) (Edit, EditInline)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("CompoundExpressionEvaluator");
		return ptr;
	}


	bool Evaluate(class UObject* ContextSource);
};


// Class GearboxFramework.ConditionalAttributeValueResolver
// 0x0020 (0x003C - 0x005C)
class UConditionalAttributeValueResolver : public UAttributeValueResolver
{
public:
	struct FConditionalInitializationExpressions       ValueExpressions;                                         // 0x003C(0x0020) (Edit, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("ConditionalAttributeValueResolver");
		return ptr;
	}

};


// Class GearboxFramework.ConstantAttributeValueResolver
// 0x0004 (0x003C - 0x0040)
class UConstantAttributeValueResolver : public UAttributeValueResolver
{
public:
	float                                              ConstantValue;                                            // 0x003C(0x0004) (Edit, Const)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("ConstantAttributeValueResolver");
		return ptr;
	}

};


// Class GearboxFramework.ConstraintAttributeValueResolver
// 0x0028 (0x003C - 0x0064)
class UConstraintAttributeValueResolver : public UAttributeValueResolver
{
public:
	struct FRange                                      Constraints;                                              // 0x003C(0x0028) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("ConstraintAttributeValueResolver");
		return ptr;
	}

};


// Class GearboxFramework.FeatherBoneBlendDefinition
// 0x000C (0x003C - 0x0048)
class UFeatherBoneBlendDefinition : public UGBXDefinition
{
public:
	TArray<struct FFeatherBoneBlendData>               BoneBlends;                                               // 0x003C(0x000C) (Edit, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("FeatherBoneBlendDefinition");
		return ptr;
	}

};


// Class GearboxFramework.GBXActorList
// 0x000C (0x003C - 0x0048)
class UGBXActorList : public UObject
{
public:
	TArray<struct Fs_actorList>                        ActorList;                                                // 0x003C(0x000C) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("GBXActorList");
		return ptr;
	}


	void RemoveAndDeleteActorsOfClassFromLevel(class UClass* TheClass, class ULevel* Level);
	void RemoveActorsOfClassFromLevel(class UClass* TheClass, class ULevel* Level);
	void RemoveAndDeleteActorsFromLevel(class ULevel* Level);
	void RemoveActorsFromLevel(class ULevel* Level);
	class AActor* FindNextActorByLevel(class ULevel* Level, int* Index);
	class AActor* FindFirstActorByLevel(class ULevel* Level, int* Index);
	class AActor* FindNextActorByClass(class UClass* TheClass, int* Index);
	class AActor* FindFirstActorByClass(class UClass* TheClass, int* Index);
	void RemoveActor(class AActor* Actor);
	void AddActor(class AActor* Actor, class ULevel* Level);
};


// Class GearboxFramework.GBXObjectList
// 0x000C (0x003C - 0x0048)
class UGBXObjectList : public UObject
{
public:
	TArray<class UObject*>                             ObjectList;                                               // 0x003C(0x000C) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("GBXObjectList");
		return ptr;
	}


	void RemoveObjectsOfClass(class UClass* TheClass);
	class UObject* FindNextObjectByClass(class UClass* TheClass, int* Index);
	class UObject* FindFirstObjectByClass(class UClass* TheClass, int* Index);
	void RemoveObject(class UObject* TheObject);
	void AddObject(class UObject* TheObject);
};


// Class GearboxFramework.GearboxAIController
// 0x0000 (0x0684 - 0x0684)
class AGearboxAIController : public AAIController
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("GearboxAIController");
		return ptr;
	}


	void ForceMoveToActor(class AActor* destActor);
};


// Class GearboxFramework.GearboxAIMoveNode
// 0x003C (0x0188 - 0x01C4)
class AGearboxAIMoveNode : public AActor
{
public:
	unsigned long                                      bEnabled : 1;                                             // 0x0188(0x0004) (Edit)
	unsigned long                                      bFaceNodeDirection : 1;                                   // 0x0188(0x0004) (Edit, Const)
	TArray<struct FNodeData>                           NextNodes;                                                // 0x018C(0x000C) (Edit, NeedCtorLink)
	TArray<class AGearboxAIMoveNode*>                  PreviousNodes;                                            // 0x0198(0x000C) (NeedCtorLink)
	float                                              HoldTime;                                                 // 0x01A4(0x0004) (Edit, Const)
	TArray<class UBehaviorBase*>                       Behaviors;                                                // 0x01A8(0x000C) (Edit, Const, NeedCtorLink, EditInline)
	TArray<class USpecialMoveDefinition*>              SpecialMoves;                                             // 0x01B4(0x000C) (Edit, Const, NeedCtorLink)
	class USpriteComponent*                            Sprite;                                                   // 0x01C0(0x0004) (ExportObject, Component, EditInline)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("GearboxAIMoveNode");
		return ptr;
	}


	bool DoesPatrolPathExistToPoint(class AGearboxAIMoveNode* PatrolPoint);
	void GetAllLinkedNodes(TArray<class AGearboxAIMoveNode*>* OutNodes);
	class AGearboxAIMoveNode* GetNextMoveNodeClosestToPoint(const struct FVector& TestPoint);
	class AGearboxAIMoveNode* GetNextMoveNode();
	int RemoveNode(class AGearboxAIMoveNode* OldNode);
	void AddNode(class AGearboxAIMoveNode* NewNode);
	void ClearLinks();
	void OnToggle(class USeqAct_Toggle* Action);
};


// Class GearboxFramework.GearboxCameraBasic
// 0x0004 (0x03FC - 0x0400)
class AGearboxCameraBasic : public ACamera
{
public:
	struct FPointer                                    VfTable_IInterfaceGearboxCamera;                          // 0x03FC(0x0004) (Const, Native, NoExport)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("GearboxCameraBasic");
		return ptr;
	}


	void FinishCameraLookAt();
	void EnableThirdPersonLookAt(float LookAtXOffset, float LookAtYOffset, float LookAtZOffset, unsigned char LookAtMode);
	void BeginCameraLookAt(class AActor* LookAtTarget, const struct FName& LookAtBone, const struct FVector& TargetLocation, float Zoom, const struct FVector2D& FOV, float Duration, float TransitionTimeIn, float TransitionTimeOut);
	void CalcSimpleThirdPersonView(float DeltaTime, struct FTViewTarget* OutVT);
	void CalcBaseView(float DeltaTime, struct FTViewTarget* OutVT);
	void UpdateViewTarget(float DeltaTime, struct FTViewTarget* OutVT);
};


// Class GearboxFramework.GearboxCameraModifier
// 0x0031 (0x0058 - 0x0089)
class UGearboxCameraModifier : public UCameraModifier
{
public:
	class AGearboxCameraBasic*                         GBXCameraOwner;                                           // 0x0058(0x0004)
	struct FTPOV                                       DesiredPOV;                                               // 0x005C(0x001C)
	float                                              MasterFadeValue;                                          // 0x0078(0x0004)
	float                                              FadeElapsedTime;                                          // 0x007C(0x0004)
	float                                              FadeTimeSpan;                                             // 0x0080(0x0004)
	unsigned long                                      FadeStarted : 1;                                          // 0x0084(0x0004)
	unsigned long                                      FadingUpwards : 1;                                        // 0x0084(0x0004)
	unsigned long                                      DisableWhenFadedOut : 1;                                  // 0x0084(0x0004)
	unsigned long                                      AdjustForTimeDilation : 1;                                // 0x0084(0x0004) (Const)
	unsigned char                                      FadeMode;                                                 // 0x0088(0x0001)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("GearboxCameraModifier");
		return ptr;
	}


	float LerpFOV(float Src, float Dest, float T);
	struct FRotator LerpRotation(const struct FRotator& Src, const struct FRotator& Dest, float T);
	struct FVector LerpLocation(const struct FVector& Src, const struct FVector& Dest, float T);
	void UpdateAllLerps(float DeltaTime, struct FTPOV* OutPOV);
	void UpdateMasterFadePercentage(float AdjustedDeltaTime);
	bool IsFadingDownwards();
	bool IsFadingUpwards();
	bool IsFadeInProgress();
	void StartFadeOut(float NewTimeSpan, bool NewDisableWhenFadedOut, unsigned char NewFadeMode);
	void StartFadeIn(float NewTimeSpan, unsigned char NewFadeMode);
	void SetDesiredCamera(const struct FVector& DesiredLoc, const struct FRotator& DesiredRot, float DesiredFOV);
	void SetGBXCameraOwner(class AGearboxCameraBasic* InCamera);
	bool AddCameraModifier(class ACamera* Camera);
};


// Class GearboxFramework.GearboxCheatManager
// 0x0000 (0x005C - 0x005C)
class UGearboxCheatManager : public UCheatManager
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("GearboxCheatManager");
		return ptr;
	}

};


// Class GearboxFramework.GearboxDialogInterface
// 0x0000 (0x003C - 0x003C)
class UGearboxDialogInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("GearboxDialogInterface");
		return ptr;
	}


	void ServerDialog_TriggerEvent(class UGearboxDialogEventTag* EventTag, class AActor* Other, class UObject* ObjectParameter);
	void SetDialogNameTag(class UGearboxDialogNameTag* NewName);
	struct FGearboxDialogReplicatedData GetReplicatedDialogData();
	void SetReplicatedDialogData(class UGearboxDialogAct_Talk* TalkAct, struct FGearboxDialogData* Data);
	void GetDialogGroups(TArray<class UGearboxDialogGroup*>* Groups);
	class UGearboxDialogComponent* GetDialogComponent();
	class UGearboxDialogNameTag* GetDialogNameTag();
	class AActor* GetActor();
	bool CanTalk();
};


// Class GearboxFramework.GearboxEditorNode
// 0x0030 (0x003C - 0x006C)
class UGearboxEditorNode : public UObject
{
public:
	unsigned char                                      Type;                                                     // 0x003C(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x003D(0x0003) MISSED OFFSET
	TArray<struct FOutputLink>                         OutputLinks;                                              // 0x0040(0x000C) (NeedCtorLink)
	TArray<class UGearboxEditorNode*>                  InputLinks;                                               // 0x004C(0x000C) (NeedCtorLink)
	TArray<struct FVariableLink>                       VariableLinks;                                            // 0x0058(0x000C) (NeedCtorLink)
	unsigned long                                      bAllowInputs : 1;                                         // 0x0064(0x0004) (EditorOnly)
	unsigned long                                      bAllowOutputs : 1;                                        // 0x0064(0x0004) (EditorOnly)
	unsigned long                                      bAllowVariables : 1;                                      // 0x0064(0x0004) (EditorOnly)
	unsigned long                                      bAllowMovement : 1;                                       // 0x0064(0x0004) (EditorOnly)
	unsigned long                                      bAllowMultipleInputs : 1;                                 // 0x0064(0x0004) (EditorOnly)
	unsigned long                                      bAllowMultipleOutputs : 1;                                // 0x0064(0x0004) (EditorOnly)
	unsigned long                                      bAllowMultipleVariables : 1;                              // 0x0064(0x0004) (EditorOnly)
	float                                              SliderPosition;                                           // 0x0068(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("GearboxEditorNode");
		return ptr;
	}


	bool IsChild(class UGearboxEditorNode* TestNode);
};


// Class GearboxFramework.GearboxEngine
// 0x0020 (0x07AC - 0x07CC)
class UGearboxEngine : public UGameEngine
{
public:
	int                                                CurrentUserID;                                            // 0x07AC(0x0004)
	int                                                CurrentDeviceID;                                          // 0x07B0(0x0004)
	unsigned long                                      bHasSelectedValidStorageDevice : 1;                       // 0x07B4(0x0004) (Const, Transient)
	struct FString                                     DefaultSparkInterfaceName;                                // 0x07B8(0x000C) (Config, NeedCtorLink)
	FScriptInterface                                   SparkInterface;                                           // 0x07C4(0x0008) (Const, Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("GearboxEngine");
		return ptr;
	}


	static FScriptInterface GetSparkInterface();
	bool IsCurrentDeviceValid(int SizeNeeded);
	bool HasStorageDeviceBeenRemoved();
	int GetCurrentDeviceID();
	void SetCurrentDeviceID(int NewDeviceID, bool bProfileSignedOut);
};


// Class GearboxFramework.GearboxGameInfo
// 0x0000 (0x0330 - 0x0330)
class AGearboxGameInfo : public AGameInfo
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("GearboxGameInfo");
		return ptr;
	}


	void PostLogin(class APlayerController* NewPlayer);
};


// Class GearboxFramework.GFxMovieState
// 0x0020 (0x003C - 0x005C)
class UGFxMovieState : public UObject
{
public:
	struct FName                                       StateName;                                                // 0x003C(0x0008) (Edit)
	struct FName                                       DefaultState;                                             // 0x0044(0x0008) (Edit)
	unsigned char                                      StateType;                                                // 0x004C(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x004D(0x0003) MISSED OFFSET
	TArray<struct FMovieStateData>                     AllStates;                                                // 0x0050(0x000C) (Transient, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("GFxMovieState");
		return ptr;
	}


	struct FString GetDebugString(class UGearboxGFxMovie* Movie, bool bIncludeFlags);
	void ApplyMovieState(class UGearboxGFxMovie* Movie, class UClass* HandlerClass);
	int FindMovieState(const struct FName& TheState);
	bool TestState(const struct FName& TheState, struct FMovieStateStruct* MovieState);
	int ToggleState(const struct FName& TheState, struct FMovieStateStruct* MovieState);
	int EnableState(const struct FName& TheState, bool bEnable, struct FMovieStateStruct* MovieState);
};


// Class GearboxFramework.GearboxGFxMovie
// 0x008C (0x01C8 - 0x0254)
class UGearboxGFxMovie : public UGFxMovie
{
public:
	TArray<struct FAkEventResolver>                    InteractionOverrideSounds;                                // 0x01C8(0x000C) (Edit, NeedCtorLink)
	float                                              TickRateSeconds;                                          // 0x01D4(0x0004)
	unsigned long                                      bTickScript : 1;                                          // 0x01D8(0x0004)
	unsigned long                                      bTickFirstFrame : 1;                                      // 0x01D8(0x0004) (Transient)
	unsigned long                                      bRenderingDisabled : 1;                                   // 0x01D8(0x0004) (Transient)
	unsigned long                                      bSupportsStatePooling : 1;                                // 0x01D8(0x0004)
	unsigned long                                      bIsUsingFlashMouse : 1;                                   // 0x01D8(0x0004)
	unsigned long                                      bBlockingMovie : 1;                                       // 0x01D8(0x0004)
	unsigned long                                      bCloseOnDeath : 1;                                        // 0x01D8(0x0004)
	TArray<class UGFxMovieDrawStyle*>                  AllStyles;                                                // 0x01DC(0x000C) (Transient, NeedCtorLink)
	class UGFxMovieDefinition*                         MyDefinition;                                             // 0x01E8(0x0004) (Transient)
	class UGFxActorMoviePool*                          MyPool;                                                   // 0x01EC(0x0004) (Transient)
	TArray<class AGearboxPlayerController*>            PlayerOwners;                                             // 0x01F0(0x000C) (Transient, NeedCtorLink)
	class UObject*                                     ContextObject;                                            // 0x01FC(0x0004) (Transient)
	float                                              LastTickTime;                                             // 0x0200(0x0004) (Transient)
	class UGearboxGFxMovie*                            PoolParent;                                               // 0x0204(0x0004) (Transient)
	struct FMovieStateStruct                           CurrentMovieState;                                        // 0x0208(0x0018) (Transient, NeedCtorLink)
	TArray<class UGFxMovieState*>                      BaseMovieStates;                                          // 0x0220(0x000C) (Edit, NeedCtorLink, EditInline)
	TArray<class UGFxMovieState*>                      AllMovieStates;                                           // 0x022C(0x000C) (Transient, NeedCtorLink)
	int                                                bMouseable;                                               // 0x0238(0x0004)
	struct FScriptDelegate                             __OnInputAxis__Delegate;                                  // 0x023C(0x000C) (Transient, NeedCtorLink)
	struct FScriptDelegate                             __OnClosed__Delegate;                                     // 0x0248(0x000C) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("GearboxGFxMovie");
		return ptr;
	}


	void extSetLanguageExt(const struct FString& ClipPath);
	void OnClosedOnDeath();
	bool IsShowingFlashMouse();
	int extIsMouseablePlatform();
	void SetMouseableFlag();
	struct FString GetStyleDebugString();
	struct FString GetStateDebugString(bool bIncludeFlags);
	void InitializeFrom(class UGearboxGFxMovie* SrcMovie);
	bool RemoveStylesDrawnTo(class UPrimitiveComponent* PrimComp, const FScriptInterface& Target);
	bool RemoveStyles(const FScriptInterface& Target);
	void RemoveStyle(class UGFxMovieDrawStyle* Style);
	void AddStyle(class UGFxMovieDrawStyle* Style);
	void ShutdownMoviePlayback();
	void InitMoviePlayback();
	class UTextureRenderTarget2D* GetRenderTexture();
	void MovieState_OnChanged(bool bStateWasChanged);
	bool MovieState_SetFromMovie(class UGearboxGFxMovie* Movie);
	bool MovieState_Copy(struct FMovieStateStruct* StateDst, struct FMovieStateStruct* StateSrc);
	bool MovieState_Compare(struct FMovieStateStruct* S1, struct FMovieStateStruct* S2);
	void MovieState_Toggle(const struct FName& TheState);
	bool MovieState_Enable(const struct FName& TheState, bool bEnable);
	bool MovieState_IsEnabled(const struct FName& TheState);
	bool MovieState_SupportsState(const struct FName& TheState);
	void MovieState_Init();
	void InitFromDefinition();
	static void MovieState_Apply(class UGearboxGFxMovie* Movie, class UClass* HandlerClass);
	static void MovieState_ApplyState(const struct FName& TheState, class UGearboxGFxMovie* Movie);
	void ApplyState(const struct FString& StateName, const struct FString& StateAction);
	void SetRenderingEnabled(bool bEnabled);
	void GotoAndStop(const struct FString& FrameLabel);
	void GotoAndPlay(const struct FString& FrameLabel);
	void PlaySpecialUISound(const struct FString& SoundString);
	void PlayUISound(const struct FName& UIEvent);
	void SetOtherObject(class UObject* Obj);
	class UObject* GetInstanceContextObject();
	void OnTick();
	void OnClose();
	bool Start(bool StartPaused);
	struct FString ColorizeTooltipText(const struct FString& S, bool bDisabled);
	static struct FString GFxColoredText(bool bAppendNewline, struct FColor* C, struct FString* S);
	void SingleArgInvokeB(const struct FString& Command, bool Arg);
	void SingleArgInvokeS(const struct FString& Command, const struct FString& Arg);
	void SingleArgInvokeF(const struct FString& Command, float Arg);
	class ULocalPlayer* GetLocalPlayer();
	void OnClosed(class UGearboxGFxMovie* Movie);
	bool WantsControllerInput(int ControllerId);
	bool SetExternalTexture(const struct FString& Resource, class UTexture* Texture);
	bool OnInputAxis(int ControllerId, const struct FName& ukey, float Delta, float DeltaTime);
};


// Class GearboxFramework.GFxMovie_StateParent
// 0x0004 (0x0254 - 0x0258)
class UGFxMovie_StateParent : public UGearboxGFxMovie
{
public:
	class UClass*                                      StateClass;                                               // 0x0254(0x0004) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("GFxMovie_StateParent");
		return ptr;
	}


	void MovieState_OnChanged(bool bStateWasChanged);
	bool Start(bool StartPaused);
};


// Class GearboxFramework.GearboxGlobals
// 0x0070 (0x0084 - 0x00F4)
class UGearboxGlobals : public UGearboxEngineGlobals
{
public:
	class UGearboxGlobalsDefinition*                   TheGlobalsDefinition;                                     // 0x0084(0x0004)
	class UClass*                                      ExposureUtilityClass;                                     // 0x0088(0x0004)
	class UClass*                                      ExposureUtilityStrategyClass;                             // 0x008C(0x0004)
	class UExposureUtilityBase*                        TheExposureUtility;                                       // 0x0090(0x0004) (Transient)
	class UGearboxAIFactory*                           TheAIFactory;                                             // 0x0094(0x0004) (Transient)
	class URuleEngineLoadBalanceManager*               TheRuleEngineLoadBalanceManager;                          // 0x0098(0x0004) (Transient)
	class UGBXActorList*                               TheGBXActorList;                                          // 0x009C(0x0004) (Transient)
	class UGBXObjectList*                              TheGBXObjectList;                                         // 0x00A0(0x0004) (Transient)
	TArray<struct FValidNameRange>                     ValidNameList;                                            // 0x00A4(0x000C) (Transient, NeedCtorLink)
	class AWireManager*                                TheWireMgr;                                               // 0x00B0(0x0004) (Transient)
	class UGbxMessageManager*                          TheMessageManager;                                        // 0x00B4(0x0004) (Transient)
	class UGBXActorList*                               TheDynamicTextureActorList;                               // 0x00B8(0x0004) (Transient)
	class UPopulationMaster*                           ThePopulationMaster;                                      // 0x00BC(0x0004) (Transient)
	class UBehaviorKernel*                             TheBehaviorKernel;                                        // 0x00C0(0x0004) (Transient)
	class UScreenSpaceManager*                         TheScreenSpaceManager;                                    // 0x00C4(0x0004) (Transient)
	class UGFxMovieManager*                            TheGFxManager;                                            // 0x00C8(0x0004) (Transient)
	class UGearboxRenderTextureManager*                TheRenderTextureManager;                                  // 0x00CC(0x0004) (Transient)
	struct FString                                     GlobalInstanceClassName;                                  // 0x00D0(0x000C) (Config, NeedCtorLink)
	int                                                DefaultMaxPopulationActorCost;                            // 0x00DC(0x0004) (Config)
	TArray<struct FLevelStateRecord>                   StateRecords;                                             // 0x00E0(0x000C) (NeedCtorLink)
	class UAkComponent*                                UIAudioComponent;                                         // 0x00EC(0x0004) (ExportObject, Transient, Component, EditInline)
	class UGearboxDialogManager*                       TheDialogManager;                                         // 0x00F0(0x0004) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("GearboxGlobals");
		return ptr;
	}


	static class UBehaviorKernel* GetBehaviorKernel();
	class UGearboxDialogManager* GetDialogManager();
	float GetPopulationRespawnDelay();
	FScriptInterface ShowDialog(class APlayerController* PC);
	void NotifyActorDied(class AActor* TheActor, bool bKeepBody);
	bool DoesLOSIntersectSpecialOccluder(const struct FVector& FromLoc, const struct FVector& ToLoc, class UPawnAllegiance* AllegianceAffected);
	static bool HasPhysXCapableGPU();
	static unsigned char GetPlatform();
	bool ValidatePlayerName(bool bReplaceCharacters, struct FString* InName);
	bool RegisterStateKey(const struct FName& LevelName, const struct FName& ObjectName, const struct FName& AdditionalKey);
	bool DoesStateKeyExist(const struct FName& LevelName, const struct FName& ObjectName, const struct FName& AdditionalKey);
	bool FreeTexture2D(class UTexture2D* Texture);
	class UTexture2D* GetTexture2D();
	class UGearboxRenderTextureManager* GetRenderTextureManager();
	class UGFxMovieManager* GetGFxManager();
	class UScreenSpaceManager* GetScreenSpaceManager();
	class UGbxMessageManager* GetMessageManager();
	void RegDynamicTextureStreaming(class AActor* A, bool bRegister);
	class UGBXActorList* GetDynamicTextureActorList();
	class UPopulationMaster* GetPopulationMaster();
	class AWireManager* GetWireManager();
	class UGBXObjectList* GetGBXObjectList();
	class UGBXActorList* GetGBXActorList();
	class URuleEngineLoadBalanceManager* GetRuleEngineLoadBalanceManager();
	class UGearboxAIFactory* GetGearboxAIFactory();
	class UExposureUtilityBase* GetExposureUtility();
	static class UGearboxGlobals* GetGearboxGlobals();
};


// Class GearboxFramework.GearboxGlobalsDefinition
// 0x000C (0x003C - 0x0048)
class UGearboxGlobalsDefinition : public UGBXDefinition
{
public:
	float                                              RespawnDelayInSeconds;                                    // 0x003C(0x0004) (Edit, Const)
	class UGearboxDialogGlobalsDefinition*             Dialog;                                                   // 0x0040(0x0004) (Edit)
	class UGFxMovieDefinition*                         EulaMovieDefinition;                                      // 0x0044(0x0004) (Edit, Const)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("GearboxGlobalsDefinition");
		return ptr;
	}

};


// Class GearboxFramework.GearboxLocationRequest
// 0x004C (0x003C - 0x0088)
class UGearboxLocationRequest : public UObject
{
public:
	class USearchOrigin*                               SearchOrigin;                                             // 0x003C(0x0004) (Edit)
	class USearchDirection*                            DirectionFromOrigin;                                      // 0x0040(0x0004) (Edit)
	class ULocationFilter*                             LocationFilterTest;                                       // 0x0044(0x0004) (Edit)
	float                                              DirectionCone;                                            // 0x0048(0x0004) (Edit)
	struct FAttributeInitializationData                MinDistanceFromOrigin;                                    // 0x004C(0x0010) (Edit)
	struct FAttributeInitializationData                MaxDistanceFromOrigin;                                    // 0x005C(0x0010) (Edit)
	unsigned char                                      SearchRandomness;                                         // 0x006C(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x006D(0x0003) MISSED OFFSET
	struct FVector                                     SearchOriginResult;                                       // 0x0070(0x000C)
	struct FVector                                     SearchDirectionResult;                                    // 0x007C(0x000C)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("GearboxLocationRequest");
		return ptr;
	}


	struct FVector GetLastDirection();
	struct FVector GetLastOrigin();
	bool GetDirection(class AActor* ContextActor, struct FVector* OutDirection);
	bool GetOrigin(class AActor* ContextActor, struct FVector* OutOrigin);
	bool Get(class AActor* ContextActor, struct FVector* OutLocation);
};


// Class GearboxFramework.PawnMoveLocationRequest
// 0x002C (0x0088 - 0x00B4)
class UPawnMoveLocationRequest : public UGearboxLocationRequest
{
public:
	unsigned long                                      GoToCover : 1;                                            // 0x0088(0x0004) (Edit)
	unsigned char                                      CoverSearchFilter;                                        // 0x008C(0x0001) (Edit)
	unsigned char                                      RepathOption;                                             // 0x008D(0x0001) (Edit)
	unsigned char                                      CoverFailureResponse;                                     // 0x008E(0x0001) (Edit)
	unsigned char                                      DestinationTestNonCover;                                  // 0x008F(0x0001) (Edit)
	struct FAttributeInitializationData                RepathDistanceThresh;                                     // 0x0090(0x0010) (Edit)
	class URuleEventDef*                               FailureEvent;                                             // 0x00A0(0x0004) (Edit)
	struct FAttributeInitializationData                OverrideDistanceForCover;                                 // 0x00A4(0x0010) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("PawnMoveLocationRequest");
		return ptr;
	}


	bool Get(class AActor* ContextActor, struct FVector* OutLocation);
};


// Class GearboxFramework.GearboxPawn
// 0x006C (0x0694 - 0x0700)
class AGearboxPawn : public AGamePawn
{
public:
	struct FPointer                                    VfTable_ISpecialMoveInterface;                            // 0x0694(0x0004) (Const, Native, NoExport)
	struct FPointer                                    VfTable_IGearboxDialogInterface;                          // 0x0698(0x0004) (Const, Native, NoExport)
	struct FName                                       NPCSightBone;                                             // 0x069C(0x0008)
	unsigned long                                      bWantsToMove : 1;                                         // 0x06A4(0x0004)
	class USpecialMoveComponent*                       SMComponent;                                              // 0x06A8(0x0004) (ExportObject, Component, EditInline)
	struct FReplicatedSpecialMoveData                  ReplicatedSMData;                                         // 0x06AC(0x0014) (Net, RepNotify)
	struct FFlag                                       HasBeenShotAtRecently;                                    // 0x06C0(0x0010) (Transient)
	struct FGearboxCoverState                          CoverState;                                               // 0x06D0(0x000C) (Net, Transient, RepNotify, RepRetry)
	class UGearboxCoverStateManager*                   CoverManager;                                             // 0x06DC(0x0004) (ExportObject, Transient, NeedCtorLink, EditInline)
	class UGearboxDialogComponent*                     DialogComponent;                                          // 0x06E0(0x0004) (ExportObject, Component, EditInline)
	struct FGearboxDialogReplicatedData                DialogReplicatedData;                                     // 0x06E4(0x0014) (Net, RepNotify)
	struct FAkPlayingInfo                              DyingScream;                                              // 0x06F8(0x0008) (Transient, Component)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("GearboxPawn");
		return ptr;
	}


	struct FVector GetAimDirection();
	void SetDialogNameTag(class UGearboxDialogNameTag* NewName);
	void ServerDialog_TriggerEvent(class UGearboxDialogEventTag* EventTag, class AActor* Other, class UObject* ObjectParameter);
	struct FGearboxDialogReplicatedData GetReplicatedDialogData();
	void SetReplicatedDialogData(class UGearboxDialogAct_Talk* TalkAct, struct FGearboxDialogData* Data);
	void GetDialogGroups(TArray<class UGearboxDialogGroup*>* Groups);
	class UGearboxDialogComponent* GetDialogComponent();
	class UGearboxDialogNameTag* GetDialogNameTag();
	bool CanTalk();
	void OnCoverStateChanged();
	void ServerSetCoverState(const struct FGearboxCoverState& NewCoverState);
	void SetCoverState(const struct FGearboxCoverState& NewCoverState);
	float GetMountAnimDistanceForSpeed(unsigned char TheSpeed, unsigned char CoverHeight, unsigned char CoverDir);
	struct FVector GetSpotOthersShouldLookAt();
	void SetReplicatedSMData(struct FSpecialMoveData* NewSMData);
	void ServerSpecialMove_StopAny();
	void ServerSpecialMove_Stop(class USpecialMoveDefinition* OldSMD);
	void ServerSpecialMove_Queue(class USpecialMoveDefinition* NewSMD, float PlayRateScale, float Duration, const struct FName& CallbackName, class UObject* CallbackObject, class UObject* Data);
	void ServerSpecialMove_Play(class USpecialMoveDefinition* NewSMD, float PlayRateScale, float Duration, const struct FName& CallbackName, class UObject* CallbackObject, class UObject* Data);
	unsigned char GetDefaultRootMotionRotationMode();
	unsigned char GetDefaultRootMotionMode();
	class USkeletalMeshComponent* GetSkelMesh();
	class USpecialMoveComponent* GetSMComponent();
	class AActor* GetActor();
	class UGearboxNavigationHandle* GetNavigationHandle();
	void PlayHit(class APawn* SomePawn, const struct FVector& HitLocation, class UClass* DamageType, const struct FVector& Momentum, const struct FTraceHitInfo& HitInfo, class UDamagePipeline* Pipeline);
	void ReplicatedEvent(const struct FName& VarName);
	bool Died(class AController* Killer, class UClass* DamageType, const struct FVector& HitLocation, class UDamagePipeline* Pipeline);
	void SetMovementPhysics();
	void PostBeginPlay();
	void NotifyShotAtBy(class AGearboxPawn* ShootingPawn);
	bool HaveIBeenShotAtRecently();
};


// Class GearboxFramework.SparkTypes
// 0x003C (0x003C - 0x0078)
class USparkTypes : public UObject
{
public:
	struct FScriptDelegate                             __OnSparkRequestComplete__Delegate;                       // 0x003C(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnSparkConfigReceived__Delegate;                        // 0x0048(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnSparkInitialized__Delegate;                           // 0x0054(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnSparkEmergencyMessageUpdated__Delegate;               // 0x0060(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnEntitlementsUpdated__Delegate;                        // 0x006C(0x000C) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("SparkTypes");
		return ptr;
	}


	static struct FString UTF8toString(TArray<unsigned char> inputBytes);
	void OnEntitlementsUpdated(class UGearboxAccountData* GbxAccount);
	void OnSparkEmergencyMessageUpdated();
	void OnSparkInitialized(unsigned char InitializedResult);
	void OnSparkConfigReceived(TArray<unsigned char> ConfigArray);
	void OnSparkRequestComplete(struct FSparkResult* Result);
};


// Class GearboxFramework.SparkInterface
// 0x0000 (0x003C - 0x003C)
class USparkInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("SparkInterface");
		return ptr;
	}


	void RemoveScriptCallback(int HttpRequestId);
	class USparkNews* GetNewsService();
	class USparkServiceConfiguration* GetTitleStorageServiceConfiguration();
	struct FString GetTitleStorageUrl();
	void ClearGearboxAccountData(bool IncludePrimaryPlayer);
	void SignOutGearboxAccount(unsigned char ControllerId);
	void SignInGearboxAccount(unsigned char ControllerId);
	class UGearboxAccountData* GetGearboxAccountData(unsigned char ControllerId);
	bool IsGearboxAccountAuthenticated(unsigned char ControllerId);
	bool IsGearboxAccountSignedIn(unsigned char ControllerId);
	struct FString ConvertUtcTimeToLocalTime(const struct FString& UtcTime);
	bool ShouldUpdateEmergencyMessage();
	struct FString GetEmergencyMessage();
	void SetEmergencyMessage(const struct FString& Message);
	struct FString GetPlatformLoginNameFromSplitscreenIndex(int SplitscreenIndex);
	struct FString GetPlatformLoginNameFromController(unsigned char ControllerId);
	void IncreaseInteractionTries();
	int GetInteractionTries();
	int GetInteractionGraceTries();
	int GetInteractionPunishmentMinWaitSeconds();
	int GetInteractionMinWaitSeconds();
	bool IsTmsComplete();
	void SetTmsComplete();
	class USparkInitializationProcess* GetSparkInitialization();
	void RestartSparkInitialization(bool bPrimary);
	void RestartSparkInitializationFromScript(bool bPrimary, const struct FScriptDelegate& SparkInitializedDelegate, const struct FScriptDelegate& SparkEmergencyMessageDelegate);
	void StartSparkInitialization(unsigned char ControllerId, const struct FScriptDelegate& SparkInitializedDelegate, const struct FScriptDelegate& SparkEmergencyMessageDelegate, const struct FScriptDelegate& EntitlementsUpdatedDelegate);
	void StartSecondaryInitialization(unsigned char ControllerId, const struct FScriptDelegate& SparkInitializedDelegate, const struct FScriptDelegate& EntitlementsUpdatedDelegate);
	struct FString GetGameName();
	struct FString GetHardwareName();
	struct FString GetPlatformName();
	struct FString GetPlatformTicket(int ControllerId, bool bPrimary);
	void ClearSparkConfigReceivedDelegate(const struct FScriptDelegate& SparkConfigReceivedDelegate);
	void AddSparkConfigReceivedDelegate(const struct FScriptDelegate& SparkConfigReceivedDelegate);
	void ResetInitializationStatus();
	bool IsSparkEnabled();
	int IssueSparkStringRequest(const struct FString& URL, const struct FString& RequestData, const struct FScriptDelegate& SparkRequestCompleteDelegate, struct FHttpParameters* HttpRequestParameters);
	int IssueSparkRequest(const struct FString& URL, const struct FScriptDelegate& SparkRequestCompleteDelegate, struct FHttpParameters* HttpRequestParameters, TArray<unsigned char>* RequestData);
};


// Class GearboxFramework.GearboxAccountData
// 0x0064 (0x003C - 0x00A0)
class UGearboxAccountData : public UObject
{
public:
	struct FString                                     RequestId;                                                // 0x003C(0x000C) (NeedCtorLink)
	unsigned long                                      SignedIn : 1;                                             // 0x0048(0x0004)
	unsigned long                                      HasValidPlatform : 1;                                     // 0x0048(0x0004)
	struct FString                                     PlatformLoginName;                                        // 0x004C(0x000C) (NeedCtorLink)
	struct FDouble                                     NextEntitlementUpdateTime;                                // 0x0058(0x0008)
	TArray<class UGearboxAccountEntitlement*>          Entitlements;                                             // 0x0060(0x000C) (NeedCtorLink)
	TArray<class UGearboxAccountOffer*>                Offers;                                                   // 0x006C(0x000C) (NeedCtorLink)
	TArray<struct FScriptDelegate>                     EntitlementsUpdatedDelegates;                             // 0x0078(0x000C) (NeedCtorLink)
	TArray<class USparkServiceConfiguration*>          Services;                                                 // 0x0084(0x000C) (NeedCtorLink)
	unsigned char                                      AgreementsSigning;                                        // 0x0090(0x0001)
