#pragma once
// Borderlands 2 (1.8.5) SDK

#ifdef _MSC_VER
#pragma pack(push, 0x4)
#endif

#include "stdafx.h"

//---------------------------------------------------------------------------
//Constants
//---------------------------------------------------------------------------

#define CONST_MAX_VANTAGES_PER_LOOKER                            3
#define CONST_MAX_HIT_TARGET_RECORDS                             5
#define CONST_SNAPSHOT_MAX                                       50
#define CONST_SecondsToRememberRecentIncomingShots               3.0
#define CONST_MaxContainedRules                                  45
#define CONST_TimeToMarkTargetsWhoShotAtMe                       10.0
#define CONST_OFFSCREEN_BUCKET                                   3
#define CONST_SKIP_UPDATE_TIME                                   0.1f
#define CONST_SPLITSCREEN_CHARACTER_COUNT                        2
#define CONST_MaxTimeMSAllowedPerFrame                           1.f
#define CONST_ScreenBaseX                                        640
#define CONST_ScreenBaseY                                        480

//---------------------------------------------------------------------------
//Enums
//---------------------------------------------------------------------------

// Enum GearboxFramework.AIComponent.AINodeType
//enum class EAINodeType : uint8_t
//{
//	NodeType_Blank                 = 0,
//	NodeType_Action                = 1,
//	NodeType_Random                = 2,

//enum class EPopulationStats : uint8_t
//{
//	STATTYPE_SpawnActor            = 0,
//	STATTYPE_PointSearch           = 1,
//	STATTYPE_MAX                   = 2
//};


// Enum GearboxFramework.PopulationPoint.EPopPointContraintType
//enum class EPopPointContraintType : uint8_t
//{
//	POPOINTCONSTRAINT_None         = 0,
//	POPOINTCONSTRAINT_Inclusion    = 1,
//	POPOINTCONSTRAINT_Exclusion    = 2,
//	POPOINTCONSTRAINT_InclusionOr  = 3,
//	POPOINTCONSTRAINT_ExclusionOr  = 4,
//	POPOINTCONSTRAINT_MAX          = 5
//};


// Enum GearboxFramework.PopulationPoint.EPopulationPointType
//enum class EPopulationPointType : uint8_t
//{
//	POINT_Ambush                   = 0,
//	POINT_PointOfInterest          = 1,
//	POINT_Vehicle                  = 2,
//	POINT_MAX                      = 3
//};


// Enum GearboxFramework.SimpleMathValueResolver.EMathValueResolverOperand
//enum class EMathValueResolverOperand : uint8_t
//{
//	MATHRESOLVEROPERAND_Add        = 0,
//	MATHRESOLVEROPERAND_Sub        = 1,
//	MATHRESOLVEROPERAND_Mul        = 2,
//	MATHRESOLVEROPERAND_Div        = 3,
//	MATHRESOLVEROPERAND_MAX        = 4
//};


// Enum GearboxFramework.SimpleMathValueResolver.EMathValueResolverArg1Option
//enum class EMathValueResolverArg1Option : uint8_t
//{
//	MATHRESOLVEARG1_UsePreviousValue = 0,
//	MATHRESOLVEARG1_FromAttribute  = 1,
//	MATHRESOLVEARG1_MAX            = 2
//};


// Enum GearboxFramework.SparkInterfaceImpl.SparkRequestState
//enum class ESparkRequestState : uint8_t
//{
//	SRS_IDLE                       = 0,
//	SRS_AWAITING_RETRY             = 1,
//	SRS_IN_FLIGHT                  = 2,
//	SRS_AWAITING_AUTHENTICATE      = 3,
//	SRS_START                      = 4,
//	SRS_FAIL                       = 5,
//	SRS_QUEUED                     = 6,
//	SRS_CLEANUP                    = 7,
//	SRS_MAX                        = 8
//};


// Enum GearboxFramework.SparkNews.ENewsRetrievalResult
//enum class ENewsRetrievalResult : uint8_t
//{
//	NEWSRETRIEVE_Success           = 0,
//	NEWSRETRIEVE_GeneralFailure    = 1,
//	NEWSRETRIEVE_NetworkFailure    = 2,
//	NEWSRETRIEVE_Timeout           = 3,
//	NEWSRETRIEVE_MAX               = 4
//};


// Enum GearboxFramework.TargetIterator.ETargetIterator
//enum class ETargetIterator : uint8_t
//{
//	TARGITER_UpdateState           = 0,
//	TARGITER_PriorityCalc          = 1,
//	TARGITER_ForgetTarget          = 2,
//	TARGITER_RemoveTarget          = 3,
//	TARGITER_PostProcess           = 4,
//	TARGITER_MAX                   = 5
//};


// Enum GearboxFramework.TimeValueResolver.ETimeValueResolverMode
//enum class ETimeValueResolverMode : uint8_t
//{
//	TVRM_CurrentTime               = 0,
//	TVRM_FrameTime                 = 1,
//	TVRM_ElapsedTime               = 2,
//	TVRM_MAX                       = 3
//};



//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// ScriptStruct GearboxFramework.AIDebugCamera.DebugListItem
// 0x0051
struct FDebugListItem
{
	unsigned char                                      DisplayType;                                              // 0x0000(0x0001) (AlwaysInit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	struct FVector                                     Location;                                                 // 0x0004(0x000C) (AlwaysInit)
	struct FVector                                     Location2;                                                // 0x0010(0x000C) (AlwaysInit)
	struct FVector                                     Location3;                                                // 0x001C(0x000C) (AlwaysInit)
	class UTexture2D*                                  Texture;                                                  // 0x0028(0x0004) (AlwaysInit)
	float                                              U;                                                        // 0x002C(0x0004) (AlwaysInit)
	float                                              V;                                                        // 0x0030(0x0004) (AlwaysInit)
	float                                              UL;                                                       // 0x0034(0x0004) (AlwaysInit)
	float                                              VL;                                                       // 0x0038(0x0004) (AlwaysInit)
	float                                              Scale;                                                    // 0x003C(0x0004) (AlwaysInit)
	struct FString                                     TextString;                                               // 0x0040(0x000C) (AlwaysInit, NeedCtorLink)
	struct FColor                                      TextColor;                                                // 0x004C(0x0004) (AlwaysInit)
	unsigned char                                      Alignment;                                                // 0x0050(0x0001) (AlwaysInit)
};

// ScriptStruct GearboxFramework.SpecialMoveInterface.SpecialMoveData
// 0x001C
struct FSpecialMoveData
{
	class UObject*                                     Data;                                                     // 0x0000(0x0004)
	float                                              PlayRateScale;                                            // 0x0004(0x0004)
	float                                              Duration;                                                 // 0x0008(0x0004)
	struct FName                                       CallbackName;                                             // 0x000C(0x0008)
	class UObject*                                     CallbackObject;                                           // 0x0014(0x0004)
	class USpecialMoveDefinition*                      SMD;                                                      // 0x0018(0x0004)
};

// ScriptStruct GearboxFramework.AnimNodeSpecialMoveBlend.SlotAnimParameters
// 0x0044
struct FSlotAnimParameters
{
	struct FSpecialMoveData                            SMData;                                                   // 0x0000(0x001C)
	class UGearboxAnimDefinition*                      CustomAnimDef;                                            // 0x001C(0x0004)
	struct FName                                       CustomAnimName;                                           // 0x0020(0x0008)
	TArray<float>                                      PerBoneWeights;                                           // 0x0028(0x000C) (NeedCtorLink)
	TArray<unsigned char>                              TransformReqBone;                                         // 0x0034(0x000C) (NeedCtorLink)
	int                                                TransformReqBoneIndex;                                    // 0x0040(0x0004)
};

// ScriptStruct GearboxFramework.IBehaviorConsumer.BehaviorConsumerHandle
// 0x0004
struct FBehaviorConsumerHandle
{
	int                                                PID;                                                      // 0x0000(0x0004)
};

// ScriptStruct GearboxFramework.ITimerBehavior.BehaviorTimerState
// 0x000C
struct FBehaviorTimerState
{
	unsigned long                                      bIsRunning : 1;                                           // 0x0000(0x0004)
	float                                              Delay;                                                    // 0x0004(0x0004)
	float                                              EventTime;                                                // 0x0008(0x0004)
};

// ScriptStruct GearboxFramework.BehaviorHelpers.AttachmentLocationData
// 0x001C
struct FAttachmentLocationData
{
	struct FVector                                     Location;                                                 // 0x0000(0x000C) (Edit)
	FScriptInterface                                   AttachmentBase;                                           // 0x000C(0x0008)
	struct FName                                       AttachmentName;                                           // 0x0014(0x0008)
};

// ScriptStruct GearboxFramework.BehaviorHelpers.RelativeDirectionData
// 0x0020
struct FRelativeDirectionData
{
	unsigned char                                      Direction;                                                // 0x0000(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	struct FAttributeInitializationData                ConeAroundDirection;                                      // 0x0004(0x0010) (Edit)
	struct FRotator                                    AdditionalRotation;                                       // 0x0014(0x000C) (Edit)
};

// ScriptStruct GearboxFramework.FeatherBoneBlendDefinition.FeatherBoneBlendData
// 0x000C
struct FFeatherBoneBlendData
{
	struct FName                                       StartBoneName;                                            // 0x0000(0x0008) (Edit)
	float                                              BlendWeight;                                              // 0x0008(0x0004) (Edit)
};

// ScriptStruct GearboxFramework.GBXActorList.s_actorList
// 0x000C
struct Fs_actorList
{
	struct FName                                       LevelName;                                                // 0x0000(0x0008)
	class AActor*                                      Actor;                                                    // 0x0008(0x0004)
};

// ScriptStruct GearboxFramework.GearboxAIMoveNode.NodeData
// 0x0008
struct FNodeData
{
	class AGearboxAIMoveNode*                          Node;                                                     // 0x0000(0x0004) (Edit)
	float                                              Weight;                                                   // 0x0004(0x0004) (Edit)
};

// ScriptStruct GearboxFramework.GearboxDialogInterface.GearboxDialogReplicatedData
// 0x0014
struct FGearboxDialogReplicatedData
{
	float                                              Pitch;                                                    // 0x0000(0x0004)
	class UAkEvent*                                    TalkAkEvent;                                              // 0x0004(0x0004)
	int                                                AkAudioUniqueID;                                          // 0x0008(0x0004)
	class UGearboxDialogAct_Talk*                      TalkAct;                                                  // 0x000C(0x0004)
	class UGearboxDialogEventTag*                      EventTag;                                                 // 0x0010(0x0004)
};

// ScriptStruct GearboxFramework.GearboxDialogInterface.GearboxDialogData
// 0x0010
struct FGearboxDialogData
{
	class UGearboxDialogNameTag*                       NameTag;                                                  // 0x0000(0x0004) (Edit)
	class UAkEvent*                                    TalkAkEvent;                                              // 0x0004(0x0004) (Edit)
	int                                                AkAudioUniqueID;                                          // 0x0008(0x0004)
	float                                              Pitch;                                                    // 0x000C(0x0004) (Edit)
};

// ScriptStruct GearboxFramework.GearboxEditorNode.OutputLink
// 0x000C
struct FOutputLink
{
	TArray<class UGearboxEditorNode*>                  Links;                                                    // 0x0000(0x000C) (NeedCtorLink)
};

// ScriptStruct GearboxFramework.GearboxEditorNode.VariableLink
// 0x000C
struct FVariableLink
{
	TArray<class UGearboxEditorNode*>                  Links;                                                    // 0x0000(0x000C) (NeedCtorLink)
};

// ScriptStruct GearboxFramework.GFxMovieState.MovieStateData
// 0x0024
struct FMovieStateData
{
	struct FName                                       State;                                                    // 0x0000(0x0008) (Edit)
	unsigned char                                      Mode;                                                     // 0x0008(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0009(0x0003) MISSED OFFSET
	struct FString                                     Context;                                                  // 0x000C(0x000C) (Edit, NeedCtorLink)
	TArray<struct FASValue>                            ASArgs;                                                   // 0x0018(0x000C) (Edit, NeedCtorLink)
};

// ScriptStruct GearboxFramework.GFxMovieState.MovieStateStruct
// 0x0018
struct FMovieStateStruct
{
	TArray<struct FName>                               States;                                                   // 0x0000(0x000C) (NeedCtorLink)
	TArray<struct FName>                               Flags;                                                    // 0x000C(0x000C) (NeedCtorLink)
};

// ScriptStruct GearboxFramework.GearboxGlobals.ValidNameRange
// 0x0008
struct FValidNameRange
{
	int                                                Start;                                                    // 0x0000(0x0004) (AlwaysInit)
	int                                                End;                                                      // 0x0004(0x0004) (AlwaysInit)
};

// ScriptStruct GearboxFramework.GearboxGlobals.ObjectKey
// 0x0010
struct FObjectKey
{
	struct FName                                       ObjectName;                                               // 0x0000(0x0008) (AlwaysInit)
	struct FName                                       AdditionalKey;                                            // 0x0008(0x0008) (AlwaysInit)
};

// ScriptStruct GearboxFramework.GearboxGlobals.LevelStateRecord
// 0x0018
struct FLevelStateRecord
{
	struct FName                                       LevelName;                                                // 0x0000(0x0008) (AlwaysInit)
	unsigned char                                      LevelLoaded;                                              // 0x0008(0x0001) (AlwaysInit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0009(0x0003) MISSED OFFSET
	TArray<struct FObjectKey>                          ObjectKeys;                                               // 0x000C(0x000C) (AlwaysInit, NeedCtorLink)
};

// ScriptStruct GearboxFramework.GearboxGlobals.GearboxCoverState
// 0x000C
struct FGearboxCoverState
{
	class AActor*                                      TheCoverActor;                                            // 0x0000(0x0004)
	int                                                SlotIndex;                                                // 0x0004(0x0004)
	unsigned char                                      State;                                                    // 0x0008(0x0001)
	unsigned char                                      ExtendedState;                                            // 0x0009(0x0001)
	unsigned char                                      MetaData;                                                 // 0x000A(0x0001)
	unsigned char                                      ExtendedMetaData;                                         // 0x000B(0x0001)
};

// ScriptStruct GearboxFramework.SpecialMoveInterface.ReplicatedSpecialMoveData
// 0x0014
struct FReplicatedSpecialMoveData
{
	class UObject*                                     Data;                                                     // 0x0000(0x0004)
	float                                              PlayRateScale;                                            // 0x0004(0x0004)
	float                                              Duration;                                                 // 0x0008(0x0004)
	unsigned char                                      DirtyCounter;                                             // 0x000C(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x000D(0x0003) MISSED OFFSET
	class USpecialMoveDefinition*                      SMD;                                                      // 0x0010(0x0004)
};

// ScriptStruct GearboxFramework.SparkTypes.SparkResult
// 0x0018
struct FSparkResult
{
	unsigned long                                      RequestSucceeded : 1;                                     // 0x0000(0x0004)
	unsigned char                                      ErrorCode;                                                // 0x0004(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0005(0x0003) MISSED OFFSET
	int                                                HttpStatusCode;                                           // 0x0008(0x0004)
	TArray<unsigned char>                              ResponseBody;                                             // 0x000C(0x000C) (AlwaysInit, NeedCtorLink)
};

// ScriptStruct GearboxFramework.GearboxAccountData.EntitlementResult
// 0x0024
struct FEntitlementResult
{
	struct FName                                       Identifier;                                               // 0x0000(0x0008) (AlwaysInit)
	struct FString                                     Payload;                                                  // 0x0008(0x000C) (AlwaysInit, NeedCtorLink)
	int                                                Id;                                                       // 0x0014(0x0004) (AlwaysInit)
	unsigned long                                      Consumable : 1;                                           // 0x0018(0x0004) (AlwaysInit)
	int                                                Consumed;                                                 // 0x001C(0x0004) (AlwaysInit)
	int                                                ConsumableAmount;                                         // 0x0020(0x0004) (AlwaysInit)
};

// ScriptStruct GearboxFramework.GearboxAccountData.OfferResult
// 0x002C
struct FOfferResult
{
	struct FString                                     TitleEfigs;                                               // 0x0000(0x000C) (AlwaysInit, NeedCtorLink)
	struct FString                                     DescriptionEfigs;                                         // 0x000C(0x000C) (AlwaysInit, NeedCtorLink)
	int                                                Id;                                                       // 0x0018(0x0004) (AlwaysInit)
	unsigned long                                      Notified : 1;                                             // 0x001C(0x0004) (AlwaysInit)
	struct FString                                     DateUnlocked;                                             // 0x0020(0x000C) (AlwaysInit, NeedCtorLink)
};

// ScriptStruct GearboxFramework.GearboxAccountData.ServiceParameterResult
// 0x0018
struct FServiceParameterResult
{
	struct FString                                     Key;                                                      // 0x0000(0x000C) (AlwaysInit, NeedCtorLink)
	struct FString                                     Value;                                                    // 0x000C(0x000C) (AlwaysInit, NeedCtorLink)
};

// ScriptStruct GearboxFramework.GearboxAccountData.ServiceResult
// 0x001C
struct FServiceResult
{
	struct FName                                       ServiceName;                                              // 0x0000(0x0008) (AlwaysInit)
	struct FName                                       ConfigurationGroup;                                       // 0x0008(0x0008) (AlwaysInit)
	TArray<struct FServiceParameterResult>             Parameters;                                               // 0x0010(0x000C) (AlwaysInit, NeedCtorLink)
};

// ScriptStruct GearboxFramework.SparkInterface.HttpParameters
// 0x0038
struct FHttpParameters
{
	class USparkServiceConfiguration*                  ServiceConfiguration;                                     // 0x0000(0x0004)
	struct FString                                     SubService;                                               // 0x0004(0x000C) (AlwaysInit, NeedCtorLink)
	unsigned char                                      ContentType;                                              // 0x0010(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0011(0x0003) MISSED OFFSET
	struct FString                                     CustomContentType;                                        // 0x0014(0x000C) (AlwaysInit, NeedCtorLink)
	unsigned char                                      AcceptsType;                                              // 0x0020(0x0001)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0021(0x0003) MISSED OFFSET
	struct FString                                     CustomAcceptsType;                                        // 0x0024(0x000C) (AlwaysInit, NeedCtorLink)
	unsigned char                                      Method;                                                   // 0x0030(0x0001)
	unsigned char                                      UnknownData02[0x3];                                       // 0x0031(0x0003) MISSED OFFSET
	unsigned long                                      IsResponseDesired : 1;                                    // 0x0034(0x0004)
	unsigned long                                      NoRetry : 1;                                              // 0x0034(0x0004)
};

// ScriptStruct GearboxFramework.GearboxAccountData.ArchwayResult
// 0x0080
struct FArchwayResult
{
	struct FString                                     RequestId;                                                // 0x0000(0x000C) (AlwaysInit, NeedCtorLink)
	struct FString                                     GearboxUserToken;                                         // 0x000C(0x000C) (AlwaysInit, NeedCtorLink)
	struct FString                                     GearboxUserEmail;                                         // 0x0018(0x000C) (AlwaysInit, NeedCtorLink)
	TArray<struct FString>                             Messages;                                                 // 0x0024(0x000C) (AlwaysInit, NeedCtorLink)
	TArray<struct FEntitlementResult>                  Entitlements;                                             // 0x0030(0x000C) (AlwaysInit, NeedCtorLink)
	TArray<struct FOfferResult>                        Offers;                                                   // 0x003C(0x000C) (AlwaysInit, NeedCtorLink)
	TArray<struct FServiceResult>                      Services;                                                 // 0x0048(0x000C) (AlwaysInit, NeedCtorLink)
	unsigned long                                      InProgress : 1;                                           // 0x0054(0x0004) (AlwaysInit)
	unsigned long                                      Success : 1;                                              // 0x0054(0x0004) (AlwaysInit)
	unsigned long                                      DisableSpark : 1;                                         // 0x0054(0x0004) (AlwaysInit)
	unsigned long                                      TimeOut : 1;                                              // 0x0054(0x0004) (AlwaysInit)
	unsigned long                                      HasShiftAccount : 1;                                      // 0x0054(0x0004) (AlwaysInit)
	struct FString                                     EmergencyMessage;                                         // 0x0058(0x000C) (AlwaysInit, NeedCtorLink)
	struct FString                                     NeedsSignAgreements;                                      // 0x0064(0x000C) (AlwaysInit, NeedCtorLink)
	class UJsonObject*                                 EulaArray;                                                // 0x0070(0x0004) (AlwaysInit)
	struct FString                                     SupportId;                                                // 0x0074(0x000C) (AlwaysInit, NeedCtorLink)
};

// ScriptStruct GearboxFramework.GearboxAccountActions.EULAData
// 0x002C
struct FEULAData
{
	int                                                Id;                                                       // 0x0000(0x0004)
	struct FString                                     Version;                                                  // 0x0004(0x000C) (NeedCtorLink)
	struct FString                                     Title;                                                    // 0x0010(0x000C) (NeedCtorLink)
	struct FString                                     Text;                                                     // 0x001C(0x000C) (NeedCtorLink)
	unsigned long                                      bLocalSigned : 1;                                         // 0x0028(0x0004)
	unsigned long                                      bSeen : 1;                                                // 0x0028(0x0004)
};

// ScriptStruct GearboxFramework.GearboxPlayerController.GearboxViewShakeInfo
// 0x0044
struct FGearboxViewShakeInfo
{
	struct FVector                                     OffsetMag;                                                // 0x0000(0x000C) (Edit)
	struct FVector                                     OffsetRate;                                               // 0x000C(0x000C) (Edit)
	float                                              OffsetTime;                                               // 0x0018(0x0004) (Edit)
	struct FVector                                     RotMag;                                                   // 0x001C(0x000C) (Edit)
	struct FVector                                     RotRate;                                                  // 0x0028(0x000C) (Edit)
	float                                              RotTime;                                                  // 0x0034(0x0004) (Edit)
	float                                              FOVMag;                                                   // 0x0038(0x0004) (Edit)
	float                                              FOVRate;                                                  // 0x003C(0x0004) (Edit)
	float                                              FOVTime;                                                  // 0x0040(0x0004) (Edit)
};

// ScriptStruct GearboxFramework.GearboxRenderTextureManager.ThumbnailRenderData
// 0x0038
struct FThumbnailRenderData
{
	struct FName                                       Context;                                                  // 0x0000(0x0008) (Const)
	class UTextureRenderTarget2D*                      RenderTarget;                                             // 0x0008(0x0004) (Const)
	class UTexture*                                    ResultTexture;                                            // 0x000C(0x0004) (Const)
	unsigned char                                      UpdateType;                                               // 0x0010(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0011(0x0003) MISSED OFFSET
	class UMeshComponent*                              Mesh;                                                     // 0x0014(0x0004) (ExportObject, Component, EditInline)
	int                                                TextureSizeX;                                             // 0x0018(0x0004) (Const)
	int                                                TextureSizeY;                                             // 0x001C(0x0004) (Const)
	int                                                SizeX;                                                    // 0x0020(0x0004) (Const)
	int                                                SizeY;                                                    // 0x0024(0x0004) (Const)
	TArray<class UTexture*>                            ReferencedTextures;                                       // 0x0028(0x000C) (NeedCtorLink)
	float                                              StopStreamTexturesTime;                                   // 0x0034(0x0004)
};

// ScriptStruct GearboxFramework.GearboxRenderTextureManager.ThumbnailLightData
// 0x0010
struct FThumbnailLightData
{
	struct FRotator                                    Direction;                                                // 0x0000(0x000C) (Edit)
	class ULightComponent*                             Light;                                                    // 0x000C(0x0004) (Edit, ExportObject, Component, EditInline)
};

// ScriptStruct GearboxFramework.GestaltSkeletalMeshDefinition.GestaltPartPermutation
// 0x0018
struct FGestaltPartPermutation
{
	struct FName                                       MeshName;                                                 // 0x0000(0x0008) (Edit, EditConst)
	struct FName                                       GroupName;                                                // 0x0008(0x0008) (Edit, EditConst)
	struct FName                                       PartName;                                                 // 0x0010(0x0008) (Edit, EditConst)
};

// ScriptStruct GearboxFramework.GestaltSkeletalMeshDefinition.GestaltPart
// 0x0018
struct FGestaltPart
{
	class USkeletalMesh*                               SkeletalMeshFragment;                                     // 0x0000(0x0004) (EditConst, Deprecated)
	struct FName                                       SkeletalMeshFragmentName;                                 // 0x0004(0x0008) (Edit, EditConst)
	int                                                MaterialIndex;                                            // 0x000C(0x0004) (Edit, EditConst)
	int                                                FirstIndex;                                               // 0x0010(0x0004) (Edit, EditConst)
	int                                                NumPrimitives;                                            // 0x0014(0x0004) (Edit, EditConst)
};

// ScriptStruct GearboxFramework.GestaltSkeletalMeshDefinition.GestaltInfo
// 0x000C
struct FGestaltInfo
{
	TArray<struct FGestaltPart>                        Parts;                                                    // 0x0000(0x000C) (Edit, EditConst, NeedCtorLink)
};

// ScriptStruct GearboxFramework.GestaltSkeletalMeshDefinition.GestaltAccessoryNameEntry
// 0x0008
struct FGestaltAccessoryNameEntry
{
	struct FName                                       SkeletalMeshFragmentName;                                 // 0x0000(0x0008) (Edit, EditConst)
};

// ScriptStruct GearboxFramework.GestaltSkeletalMeshDefinition.GestaltSocketRemapEntry
// 0x001C
struct FGestaltSocketRemapEntry
{
	class USkeletalMesh*                               SkeletalMeshFragment;                                     // 0x0000(0x0004) (EditConst, Deprecated)
	struct FName                                       SkeletalMeshFragmentName;                                 // 0x0004(0x0008) (Edit, EditConst)
	struct FName                                       OriginalSocketName;                                       // 0x000C(0x0008) (Edit, EditConst)
	struct FName                                       MangledSocketName;                                        // 0x0014(0x0008) (Edit, EditConst)
};

// ScriptStruct GearboxFramework.GestaltSkeletalMeshDefinition.GestaltPartBoundsEntry
// 0x0024
struct FGestaltPartBoundsEntry
{
	struct FName                                       SkeletalMeshFragmentName;                                 // 0x0000(0x0008) (Edit, EditConst)
	struct FBoxSphereBounds                            ReferencePoseBounds;                                      // 0x0008(0x001C) (Edit, EditConst)
};

// ScriptStruct GearboxFramework.GFxActorMoviePool.MovieInstanceArray
// 0x0010
struct FMovieInstanceArray
{
	TArray<class UGearboxGFxMovie*>                    Movies;                                                   // 0x0000(0x000C) (AlwaysInit, NeedCtorLink)
	class UGearboxGFxMovie*                            PoolParent;                                               // 0x000C(0x0004)
};

// ScriptStruct GearboxFramework.GFxMovieDefinition.GFxMenuLink
// 0x000C
struct FGFxMenuLink
{
	struct FName                                       MenuName;                                                 // 0x0000(0x0008) (Edit)
	class UGFxMovieDefinition*                         Definition;                                               // 0x0008(0x0004) (Edit)
};

// ScriptStruct GearboxFramework.GFxMovieDrawStyleHUD.HUDCoordValue
// 0x0010
struct FHUDCoordValue
{
	unsigned char                                      Type;                                                     // 0x0000(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	float                                              Value;                                                    // 0x0004(0x0004) (Edit)
	float                                              CurrentValue;                                             // 0x0008(0x0004) (Transient)
	unsigned long                                      bCacheValid : 1;                                          // 0x000C(0x0004) (Transient)
};

// ScriptStruct GearboxFramework.GFxMovieDrawStyleHUD.HUDAnchorPoint
// 0x0024
struct FHUDAnchorPoint
{
	unsigned char                                      MoviePoint;                                               // 0x0000(0x0001) (Edit)
	unsigned char                                      ScreenPoint;                                              // 0x0001(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0002(0x0002) MISSED OFFSET
	struct FHUDCoordValue                              Offset[0x2];                                              // 0x0004(0x0010) (Edit)
};

// ScriptStruct GearboxFramework.GFxMovieStatePlayerAware.MovieRangeStateData
// 0x0004 (0x0024 - 0x0028)
struct FMovieRangeStateData : public FMovieStateData
{
	float                                              Distance;                                                 // 0x0024(0x0004) (Edit)
};

// ScriptStruct GearboxFramework.PopulationEncounter.EncounterLimitState
// 0x0008
struct FEncounterLimitState
{
	int                                                NumTotalSpawned;                                          // 0x0000(0x0004) (Transient)
	int                                                NumCurrentlyActive;                                       // 0x0004(0x0004) (Transient)
};

// ScriptStruct GearboxFramework.PopulationEncounter.EncounterLimitData
// 0x0038
struct FEncounterLimitData
{
	TArray<class UPopulationSpawnedActorTagDefinition*> ActorTags;                                                // 0x0000(0x000C) (Edit, NeedCtorLink)
	struct FAttributeInitializationData                MaxTotalToSpawn;                                          // 0x000C(0x0010) (Edit)
	struct FAttributeInitializationData                MaxActiveAtATime;                                         // 0x001C(0x0010) (Edit)
	unsigned char                                      ConstraintType;                                           // 0x002C(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x002D(0x0003) MISSED OFFSET
	struct FEncounterLimitState                        LimitState;                                               // 0x0030(0x0008) (Transient)
};

// ScriptStruct GearboxFramework.PopulationEncounter.EncounterWaveData
// 0x0028
struct FEncounterWaveData
{
	float                                              InitialDelay;                                             // 0x0000(0x0004) (Edit, Const)
	float                                              PercentToComplete;                                        // 0x0004(0x0004) (Edit, Const)
	class UPopulationDefinition*                       EncounterPopulationDef;                                   // 0x0008(0x0004) (Edit, Const)
	TArray<class APopulationOpportunity*>              MemberOpportunities;                                      // 0x000C(0x000C) (Edit, Const, NeedCtorLink)
	TArray<struct FEncounterLimitData>                 SpawnLimits;                                              // 0x0018(0x000C) (Edit, NeedCtorLink)
	unsigned long                                      WaveComplete : 1;                                         // 0x0024(0x0004) (Transient)
	unsigned long                                      AllKilledInWave : 1;                                      // 0x0024(0x0004) (Transient)
};

// ScriptStruct GearboxFramework.PopUpDebugBarGraph.ColumnDataStruct
// 0x0014
struct FColumnDataStruct
{
	struct FString                                     HeaderText;                                               // 0x0000(0x000C) (NeedCtorLink)
	float                                              Value;                                                    // 0x000C(0x0004)
	struct FColor                                      BarColor;                                                 // 0x0010(0x0004)
};

// ScriptStruct GearboxFramework.RandomAttributeValueResolver.SavedRandomValue
// 0x0010
struct FSavedRandomValue
{
	struct FName                                       ContextName;                                              // 0x0000(0x0008)
	float                                              SavedValue;                                               // 0x0008(0x0004)
	float                                              ExpirationTime;                                           // 0x000C(0x0004)
};

// ScriptStruct GearboxFramework.RuleEngineLoadBalanceManager.RuleEngineLoadBalanceStruct
// 0x000C
struct FRuleEngineLoadBalanceStruct
{
	class URuleEngine*                                 RuleEngine;                                               // 0x0000(0x0004)
	float                                              TimeSinceLastUpdate;                                      // 0x0004(0x0004)
	int                                                Priority;                                                 // 0x0008(0x0004)
};

// ScriptStruct GearboxFramework.RuleEngineLoadBalanceManager.DebugLoadBalance
// 0x0018
struct FDebugLoadBalance
{
	struct FName                                       RuleEngine;                                               // 0x0000(0x0008)
	unsigned long                                      bIsInQueue : 1;                                           // 0x0008(0x0004)
	float                                              TimeSinceUpdate;                                          // 0x000C(0x0004)
	float                                              TimeToDoLastUpdate;                                       // 0x0010(0x0004)
	int                                                Priority;                                                 // 0x0014(0x0004)
};

// ScriptStruct GearboxFramework.RuleEngineLoadBalanceManager.RELBManagerStats
// 0x0018
struct FRELBManagerStats
{
	float                                              TotalTimeUpdated;                                         // 0x0000(0x0004)
	float                                              MaxTimeUpdating;                                          // 0x0004(0x0004)
	int                                                NumUpdated;                                               // 0x0008(0x0004)
	int                                                AveragePriority;                                          // 0x000C(0x0004)
	int                                                LowestPriority;                                           // 0x0010(0x0004)
	int                                                HighestPriority;                                          // 0x0014(0x0004)
};

// ScriptStruct GearboxFramework.SpecialMoveDefinition.SMBehavior
// 0x0010
struct FSMBehavior
{
	unsigned long                                      PlayServer : 1;                                           // 0x0000(0x0004) (Edit, Const)
	unsigned long                                      PlayClient : 1;                                           // 0x0000(0x0004) (Edit, Const)
	unsigned long                                      PlayLocal : 1;                                            // 0x0000(0x0004) (Edit, Const)
	TArray<class UBehaviorBase*>                       Behaviors;                                                // 0x0004(0x000C) (Edit, Const, NeedCtorLink, EditInline)
};

// ScriptStruct GearboxFramework.SpecialMoveExpressionList.SMExpressionList
// 0x0008
struct FSMExpressionList
{
	class UExpressionEvaluator*                        Expression;                                               // 0x0000(0x0004) (Edit, Const, EditInline)
	class USpecialMoveDefinition*                      SMD;                                                      // 0x0004(0x0004) (Edit, Const)
};

// ScriptStruct GearboxFramework.SpecialMoveRandom.SMRandomPair
// 0x0008
struct FSMRandomPair
{
	float                                              Weight;                                                   // 0x0000(0x0004) (Edit)
	class USpecialMoveDefinition*                      SMD;                                                      // 0x0004(0x0004) (Edit)
};

// ScriptStruct GearboxFramework.WireTerminal.WireLinkage
// 0x001C
struct FWireLinkage
{
	struct FVector                                     Offset;                                                   // 0x0000(0x000C) (Edit)
	float                                              Width;                                                    // 0x000C(0x0004) (Edit)
	float                                              Slack;                                                    // 0x0010(0x0004) (Edit)
	unsigned char                                      Segments;                                                 // 0x0014(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0015(0x0003) MISSED OFFSET
	int                                                Link;                                                     // 0x0018(0x0004) (Edit)
};

// ScriptStruct GearboxFramework.AIComponent.AIHoldData
// 0x000C
struct FAIHoldData
{
	struct FName                                       HoldName;                                                 // 0x0000(0x0008)
	class UObject*                                     HoldTag;                                                  // 0x0008(0x0004)
};

// ScriptStruct GearboxFramework.AIComponent.AIResourceData
// 0x001C
struct FAIResourceData
{
	class UAIResource*                                 Resource;                                                 // 0x0000(0x0004)
	TArray<struct FPointer>                            CanRun;                                                   // 0x0004(0x000C) (Const, Native)
	TArray<struct FPointer>                            Running;                                                  // 0x0010(0x000C) (Const, Native)
};

// ScriptStruct GearboxFramework.AIComponent.AIRange
// 0x0008
struct FAIRange
{
	float                                              MinVal;                                                   // 0x0000(0x0004) (Edit)
	float                                              MaxVal;                                                   // 0x0004(0x0004) (Edit)
};

// ScriptStruct GearboxFramework.FlagDefinition.FlagDefinitionInitialization
// 0x0028
struct FFlagDefinitionInitialization
{
	class UFlagDefinition*                             FlagToSet;                                                // 0x0000(0x0004) (Edit, Const)
	struct FAttributeInitializationData                ChanceTrue;                                               // 0x0004(0x0010) (Edit, Const)
	float                                              ProbabilityTrue;                                          // 0x0014(0x0004) (Const)
	struct FAttributeInitializationData                Duration;                                                 // 0x0018(0x0010) (Edit, Const)
};

// ScriptStruct GearboxFramework.ActionSequenceRandom.ActionSequenceRandomData
// 0x0014
struct FActionSequenceRandomData
{
	struct FAttributeInitializationData                ProbabilityData;                                          // 0x0000(0x0010) (Edit, Const)
	class UActionSequence*                             ActionToRunWhenTrue;                                      // 0x0010(0x0004) (Edit, Const, EditInline)
};

// ScriptStruct GearboxFramework.AIFactoryBase.TimeStampedRecord
// 0x0004
struct FTimeStampedRecord
{
	float                                              DeathTimeStamp;                                           // 0x0000(0x0004)
};

// ScriptStruct GearboxFramework.AIFactoryBase.KnowledgeRecordStruct
// 0x0005 (0x0004 - 0x0009)
struct FKnowledgeRecordStruct : public FTimeStampedRecord
{
	class UKnowledgeRecord*                            TheObj;                                                   // 0x0004(0x0004)
	unsigned char                                      InUse;                                                    // 0x0008(0x0001)
};

// ScriptStruct GearboxFramework.AIFactoryBase.RuleSetRecord
// 0x0005 (0x0004 - 0x0009)
struct FRuleSetRecord : public FTimeStampedRecord
{
	class URuleSet*                                    TheObj;                                                   // 0x0004(0x0004)
	unsigned char                                      InUse;                                                    // 0x0008(0x0001)
};

// ScriptStruct GearboxFramework.AIFactoryBase.RuleRecord
// 0x0005 (0x0004 - 0x0009)
struct FRuleRecord : public FTimeStampedRecord
{
	class URule*                                       TheObj;                                                   // 0x0004(0x0004)
	unsigned char                                      InUse;                                                    // 0x0008(0x0001)
};

// ScriptStruct GearboxFramework.AIFactoryBase.ActionSequenceRecord
// 0x0005 (0x0004 - 0x0009)
struct FActionSequenceRecord : public FTimeStampedRecord
{
	class UActionSequence*                             TheObj;                                                   // 0x0004(0x0004)
	unsigned char                                      InUse;                                                    // 0x0008(0x0001)
};

// ScriptStruct GearboxFramework.AIFactoryBase.TargetInfoRecord
// 0x0005 (0x0004 - 0x0009)
struct FTargetInfoRecord : public FTimeStampedRecord
{
	class UMindTargetInfo*                             TheObj;                                                   // 0x0004(0x0004)
	unsigned char                                      InUse;                                                    // 0x0008(0x0001)
};

// ScriptStruct GearboxFramework.AIFactoryBase.AIDefinitionRecord
// 0x0005 (0x0004 - 0x0009)
struct FAIDefinitionRecord : public FTimeStampedRecord
{
	class UAIDefinition*                               TheObj;                                                   // 0x0004(0x0004)
	unsigned char                                      InUse;                                                    // 0x0008(0x0001)
};

// ScriptStruct GearboxFramework.AIResource.AIResourceRestriction
// 0x000C
struct FAIResourceRestriction
{
	int                                                MaxUsers;                                                 // 0x0000(0x0004) (Edit, Const)
	int                                                MinUsers;                                                 // 0x0004(0x0004) (Edit, Const)
	class UAIResource*                                 Resource;                                                 // 0x0008(0x0004) (Edit)
};

// ScriptStruct GearboxFramework.GbxMessage.GbxMessageSimpleMetaData
// 0x001C
struct FGbxMessageSimpleMetaData
{
	float                                              FloatData;                                                // 0x0000(0x0004) (Edit)
	int                                                IntData;                                                  // 0x0004(0x0004) (Edit)
	struct FName                                       NameData;                                                 // 0x0008(0x0008) (Edit)
	struct FVector                                     VectorData;                                               // 0x0010(0x000C) (Edit)
};

// ScriptStruct GearboxFramework.CharacterClassMessageDefinition.BehaviorTriggerMessageStruct
// 0x0014
struct FBehaviorTriggerMessageStruct
{
	class UGbxMessageDefinition*                       MessageDefinition;                                        // 0x0000(0x0004) (Edit)
	unsigned char                                      Instigator;                                               // 0x0004(0x0001) (Edit)
	unsigned char                                      OtherEventParticipant;                                    // 0x0005(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0006(0x0002) MISSED OFFSET
	TArray<class UBehaviorBase*>                       Behaviors;                                                // 0x0008(0x000C) (Edit, Const, NeedCtorLink, EditInline)
};

// ScriptStruct GearboxFramework.GearboxGlobals.VantageSpot
// 0x000D
struct FVantageSpot
{
	struct FVector                                     Location;                                                 // 0x0000(0x000C)
	unsigned char                                      VantageType;                                              // 0x000C(0x0001)
};

// ScriptStruct GearboxFramework.ExposureUtilityBasicCaching.ExposureCacheStruct
// 0x0040
struct FExposureCacheStruct
{
	struct FName                                       FromPawnName;                                             // 0x0000(0x0008) (AlwaysInit)
	struct FName                                       ToActorName;                                              // 0x0008(0x0008) (AlwaysInit)
	float                                              TimeCached;                                               // 0x0010(0x0004) (AlwaysInit)
	float                                              NextUpdateTime;                                           // 0x0014(0x0004) (AlwaysInit)
	float                                              Exposure;                                                 // 0x0018(0x0004) (AlwaysInit)
	struct FVector                                     FromLoc;                                                  // 0x001C(0x000C) (AlwaysInit)
	struct FVector                                     ToLoc;                                                    // 0x0028(0x000C) (AlwaysInit)
	TArray<struct FVantageSpot>                        Vantage;                                                  // 0x0034(0x000C) (Transient, AlwaysInit, NeedCtorLink)
};

// ScriptStruct GearboxFramework.ExposureUtilityFixedCost.ExposureUpdateStruct
// 0x001D
struct FExposureUpdateStruct
{
	class AGearboxPawn*                                FromPawn;                                                 // 0x0000(0x0004) (AlwaysInit)
	class AActor*                                      ToActor;                                                  // 0x0004(0x0004) (AlwaysInit)
	float                                              TimeRequested;                                            // 0x0008(0x0004) (AlwaysInit)
	float                                              Exposure;                                                 // 0x000C(0x0004) (AlwaysInit)
	TArray<struct FVantageSpot>                        Vantage;                                                  // 0x0010(0x000C) (Transient, AlwaysInit, NeedCtorLink)
	unsigned char                                      ShouldRemove;                                             // 0x001C(0x0001) (AlwaysInit)
};

// ScriptStruct GearboxFramework.ExposureUtilityFixedCost.BucketStruct
// 0x001C
struct FBucketStruct
{
	int                                                NdxToStartCheckFrom;                                      // 0x0000(0x0004) (AlwaysInit)
	float                                              DistanceSquared;                                          // 0x0004(0x0004) (AlwaysInit)
	int                                                MaxLineChecksPerFrame;                                    // 0x0008(0x0004) (AlwaysInit)
	int                                                MaxIterationsPerFrame;                                    // 0x000C(0x0004) (AlwaysInit)
	TArray<struct FExposureUpdateStruct>               Exposures;                                                // 0x0010(0x000C) (Transient, AlwaysInit, NeedCtorLink)
};

// ScriptStruct GearboxFramework.ExposureUtilityFixedCost.PointExposureData
// 0x0028
struct FPointExposureData
{
	class AActor*                                      Looker;                                                   // 0x0000(0x0004)
	struct FVector                                     Point;                                                    // 0x0004(0x000C)
	struct FVector                                     Point2;                                                   // 0x0010(0x000C)
	float                                              Exposure;                                                 // 0x001C(0x0004)
	float                                              LastCheckTime;                                            // 0x0020(0x0004)
	float                                              LastUpdateTime;                                           // 0x0024(0x0004)
};

// ScriptStruct GearboxFramework.FiringBehaviorDefinition.ConditionalPattern
// 0x0010
struct FConditionalPattern
{
	TArray<class UFiringCondition*>                    Conditions;                                               // 0x0000(0x000C) (Edit, NeedCtorLink)
	class UFiringPattern*                              Pattern;                                                  // 0x000C(0x0004) (Edit)
};

// ScriptStruct GearboxFramework.Rule.FlagEvalORConnector
// 0x000C
struct FFlagEvalORConnector
{
	TArray<struct FFlagEvalConditional>                ANDChain;                                                 // 0x0000(0x000C) (Edit, NeedCtorLink)
};

// ScriptStruct GearboxFramework.Rule.FlagEvalConditional
// 0x0018
struct FFlagEvalConditional
{
	unsigned char                                      FlagEvalType;                                             // 0x0000(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	class UFlagDefinition*                             FlagDefinition;                                           // 0x0004(0x0004) (Edit)
	struct FAttributeInitializationData                TimeSeconds;                                              // 0x0008(0x0010) (Edit)
};

// ScriptStruct GearboxFramework.INounAttributeProvider.NounAttributeState
// 0x0024
struct FNounAttributeState
{
	struct FName                                       NounName;                                                 // 0x0000(0x0008)
	float                                              Value;                                                    // 0x0008(0x0004)
	float                                              BaseValue;                                                // 0x000C(0x0004)
	TArray<class UAttributeModifier*>                  ModifierStack;                                            // 0x0010(0x000C) (NeedCtorLink)
	unsigned char                                      ReplicationStrategy;                                      // 0x001C(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x001D(0x0003) MISSED OFFSET
	int                                                IndexInReplicationArray;                                  // 0x0020(0x0004)
};

// ScriptStruct GearboxFramework.RuleEngine.EventRecord
// 0x0008
struct FEventRecord
{
	class URuleEventDef*                               EventDefinition;                                          // 0x0000(0x0004)
	class UObject*                                     OtherEventParticipantObject;                              // 0x0004(0x0004)
};

// ScriptStruct GearboxFramework.RuleEngine.RuleSetReference
// 0x000C
struct FRuleSetReference
{
	struct FName                                       ReferenceName;                                            // 0x0000(0x0008) (Edit)
	class URuleSet*                                    ReferenceRuleSet;                                         // 0x0008(0x0004) (Edit)
};

// ScriptStruct GearboxFramework.RuleEngine.DynamicFlagInstanceData
// 0x0014
struct FDynamicFlagInstanceData
{
	struct FFlag                                       DynamicFlag;                                              // 0x0000(0x0010)
	float                                              LastEvaluatedExpressionTime;                              // 0x0010(0x0004)
};

// ScriptStruct GearboxFramework.GearboxGlobals.GearboxCoverTransition
// 0x0004
struct FGearboxCoverTransition
{
	unsigned char                                      Action;                                                   // 0x0000(0x0001)
	unsigned char                                      ExtendedAction;                                           // 0x0001(0x0001)
	unsigned char                                      Padding[0x2];                                             // 0x0002(0x0001)
};

// ScriptStruct GearboxFramework.GearboxCoverStateManager.CoverSpotInfo
// 0x0018
struct FCoverSpotInfo
{
	class AActor*                                      TheCoverActor;                                            // 0x0000(0x0004)
	int                                                CoverSlotIndex;                                           // 0x0004(0x0004)
	struct FVector                                     CoverSpotWorldLocation;                                   // 0x0008(0x000C)
	unsigned char                                      CoverHeight;                                              // 0x0014(0x0001)
	unsigned char                                      ExtendedInfo1;                                            // 0x0015(0x0001)
	unsigned char                                      ExtendedInfo2;                                            // 0x0016(0x0001)
