/*
#############################################################################################
# Borderlands 2 (1.0.35.4705) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/
#pragma once

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_MAX_VANTAGES_PER_LOOKER                            3
#define CONST_SNAPSHOT_MAX                                       50
#define CONST_OFFSCREEN_BUCKET                                   3
#define CONST_SKIP_UPDATE_TIME                                   0.1f
#define CONST_TimeToMarkTargetsWhoShotAtMe                       10.0
#define CONST_SecondsToRememberRecentIncomingShots               3.0
#define CONST_MaxContainedRules                                  45
#define CONST_SPLITSCREEN_CHARACTER_COUNT                        2
#define CONST_MAX_HIT_TARGET_RECORDS                             5
#define CONST_MaxTimeMSAllowedPerFrame                           1.f
#define CONST_ScreenBaseX                                        640

	POPOINTCONSTRAINT_None                             = 0,
	POPOINTCONSTRAINT_Inclusion                        = 1,
	POPOINTCONSTRAINT_Exclusion                        = 2,
	POPOINTCONSTRAINT_InclusionOr                      = 3,
	POPOINTCONSTRAINT_ExclusionOr                      = 4,
	POPOINTCONSTRAINT_MAX                              = 5
};*/

// Enum GearboxFramework.PopulationPoint.EPopulationPointType
/*enum EPopulationPointType
{
	POINT_Ambush                                       = 0,
	POINT_PointOfInterest                              = 1,
	POINT_Vehicle                                      = 2,
	POINT_MAX                                          = 3
};*/

// Enum GearboxFramework.SimpleMathValueResolver.EMathValueResolverOperand
/*enum EMathValueResolverOperand
{
	MATHRESOLVEROPERAND_Add                            = 0,
	MATHRESOLVEROPERAND_Sub                            = 1,
	MATHRESOLVEROPERAND_Mul                            = 2,
	MATHRESOLVEROPERAND_Div                            = 3,
	MATHRESOLVEROPERAND_MAX                            = 4
};*/

// Enum GearboxFramework.SimpleMathValueResolver.EMathValueResolverArg1Option
/*enum EMathValueResolverArg1Option
{
	MATHRESOLVEARG1_UsePreviousValue                   = 0,
	MATHRESOLVEARG1_FromAttribute                      = 1,
	MATHRESOLVEARG1_MAX                                = 2
};*/

// Enum GearboxFramework.SparkInterfaceImpl.SparkRequestState
/*enum SparkRequestState
{
	SRS_IDLE                                           = 0,
	SRS_AWAITING_RETRY                                 = 1,
	SRS_IN_FLIGHT                                      = 2,
	SRS_AWAITING_AUTHENTICATE                          = 3,
	SRS_START                                          = 4,
	SRS_FAIL                                           = 5,
	SRS_QUEUED                                         = 6,
	SRS_CLEANUP                                        = 7,
	SRS_MAX                                            = 8
};*/

// Enum GearboxFramework.TargetIterator.ETargetIterator
/*enum ETargetIterator
{
	TARGITER_UpdateState                               = 0,
	TARGITER_PriorityCalc                              = 1,
	TARGITER_ForgetTarget                              = 2,
	TARGITER_RemoveTarget                              = 3,
	TARGITER_PostProcess                               = 4,
	TARGITER_MAX                                       = 5
};*/

// Enum GearboxFramework.TimeValueResolver.ETimeValueResolverMode
/*enum ETimeValueResolverMode
{
	TVRM_CurrentTime                                   = 0,
	TVRM_FrameTime                                     = 1,
	TVRM_ElapsedTime                                   = 2,
	TVRM_MAX                                           = 3
};*/


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class GearboxFramework.ActorFactoryClone
// 0x0014 (0x0090 - 0x007C)
class UActorFactoryClone : public UActorFactory
{
public:
	TArray< class AGearboxPawn* >                      CloneArchetype;                                   		// 0x007C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FName                                       NewCloneTag;                                      		// 0x0088 (0x0008) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2910 ];

		return pClassPointer;
	};

};

// Class GearboxFramework.ActorFactoryWireTerminal
// 0x0000 (0x007C - 0x007C)
class UActorFactoryWireTerminal : public UActorFactory
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2912 ];

		return pClassPointer;
	};

};

// Class GearboxFramework.AIDebugCamera
// 0x0050 (0x008C - 0x003C)
class UAIDebugCamera : public UObject
{
public:
	class AGearboxMind*                                Mind;                                             		// 0x003C (0x0004) [0x0000000000000000]              
	class URuleEngine*                                 RuleEngine;                                       		// 0x0040 (0x0004) [0x0000000000000000]              
	TArray< struct FDebugListItem >                    DisplayList;                                      		// 0x0044 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned long                                      bSnapshotModeOn : 1;                              		// 0x0050 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bShowFlags : 1;                                   		// 0x0050 (0x0004) [0x0000000000044000] [0x00000002] ( CPF_Config | CPF_GlobalConfig )
	unsigned long                                      bShowRules : 1;                                   		// 0x0050 (0x0004) [0x0000000000044000] [0x00000004] ( CPF_Config | CPF_GlobalConfig )
	unsigned long                                      bShowInactiveRules : 1;                           		// 0x0050 (0x0004) [0x0000000000044000] [0x00000008] ( CPF_Config | CPF_GlobalConfig )
	unsigned long                                      bShowResources : 1;                               		// 0x0050 (0x0004) [0x0000000000044000] [0x00000010] ( CPF_Config | CPF_GlobalConfig )
	unsigned long                                      bShowCombat : 1;                                  		// 0x0050 (0x0004) [0x0000000000044000] [0x00000020] ( CPF_Config | CPF_GlobalConfig )
	unsigned long                                      bShowRuleEngineLoadBalance : 1;                   		// 0x0050 (0x0004) [0x0000000000044000] [0x00000040] ( CPF_Config | CPF_GlobalConfig )
	unsigned long                                      bShowAwarenessZones : 1;                          		// 0x0050 (0x0004) [0x0000000000044000] [0x00000080] ( CPF_Config | CPF_GlobalConfig )
	unsigned long                                      bShowTargetViewCones : 1;                         		// 0x0050 (0x0004) [0x0000000000044000] [0x00000100] ( CPF_Config | CPF_GlobalConfig )
	unsigned long                                      bShowTimers : 1;                                  		// 0x0050 (0x0004) [0x0000000000044000] [0x00000200] ( CPF_Config | CPF_GlobalConfig )
	unsigned long                                      bShowAITree : 1;                                  		// 0x0050 (0x0004) [0x0000000000000000] [0x00000400] 
	int                                                SnapshotNdx;                                      		// 0x0054 (0x0004) [0x0000000000000000]              
	class USnapshotRecord*                             CurSnapshot;                                      		// 0x0058 (0x0004) [0x0000000000000000]              
	class UPopUpDebugBarGraph*                         PopUpGraphTop;                                    		// 0x005C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UPopUpDebugBarGraph*                         PopUpGraphCenter;                                 		// 0x0060 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	struct FName                                       CurrentInspectedTargetName;                       		// 0x0064 (0x0008) [0x0000000000000000]              
	float                                              TopBarGraphStartXPct;                             		// 0x006C (0x0004) [0x0000000000000002]              ( CPF_Const )
	float                                              TopBarGraphStartYPct;                             		// 0x0070 (0x0004) [0x0000000000000002]              ( CPF_Const )
	float                                              CenterBarGraphStartXPct;                          		// 0x0074 (0x0004) [0x0000000000000002]              ( CPF_Const )
	float                                              CenterBarGraphStartYPct;                          		// 0x0078 (0x0004) [0x0000000000000002]              ( CPF_Const )
	float                                              Column2XOffset;                                   		// 0x007C (0x0004) [0x0000000000000002]              ( CPF_Const )
	float                                              Column1LastY;                                     		// 0x0080 (0x0004) [0x0000000000000000]              
	float                                              Column2LastY;                                     		// 0x0084 (0x0004) [0x0000000000000000]              
	int                                                LastColumnDrawnTo;                                		// 0x0088 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2914 ];

		return pClassPointer;
	};

	void ToggleAITree ( );
	void ToggleTargetViewCones ( );
	void ToggleAwarenessZones ( );
	void ToggleRuleEngineLoadBalance ( );
	void ToggleCombat ( );
	void ToggleShowTimers ( );
	void ToggleResources ( );
	void ToggleInactiveRules ( );
	void ToggleRules ( );
	void ToggleFlags ( );
	class UAITracker* GetTracker ( );
	void SetMind ( class AGearboxMind* NewMind );
	void InitDummies ( int NewNumDummies );
	bool WantsToDoCameraInspection ( );
	void SetCurrentInspectedTarget ( struct FName NewName );
	void CompareRuleSetAndAdjustRuleIdx ( class USnapshotRecord* OldSnapshot, class USnapshotRecord* NewSnapshot );
	void SetRuleEngine ( class URuleEngine* NewRuleEngine );
	void SetPrevSnapshotRule ( );
	void SetNextSnapshotRule ( );
	void SetPrevSnapshot ( );
	void SetNextSnapshot ( );
	void NotifyGameUnPaused ( );
	void NotifyGamePaused ( );
	void Display ( class AHUD* HUD );
};

// Class GearboxFramework.AITracker
// 0x00D4 (0x0110 - 0x003C)
class UAITracker : public UObject
{
public:
	class USnapshotRecord*                             Snapshots[ 0x32 ];                                		// 0x003C (0x00C8) [0x0000000000002000]              ( CPF_Transient )
	int                                                SnapshotSize;                                     		// 0x0104 (0x0004) [0x0000000000000000]              
	int                                                SnapshotIndex;                                    		// 0x0108 (0x0004) [0x0000000000000000]              
	class AActor*                                      DebugOwner;                                       		// 0x010C (0x0004) [0x0000000000002000]              ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2916 ];

		return pClassPointer;
	};

};

// Class GearboxFramework.AnimNodeSpecialMoveBlend
// 0x0020 (0x010C - 0x00EC)
class UAnimNodeSpecialMoveBlend : public UAnimNodeSlot
{
public:
	unsigned char                                      AnimState;                                        		// 0x00EC (0x0001) [0x0000000000002000]              ( CPF_Transient )
	float                                              SavedBlendOutTime;                                		// 0x00F0 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class USpecialMoveInterface*                       SMI;                                              		// 0x00F4 (0x0008) [0x0000000000002000]              ( CPF_Transient )
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x00F8 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	TArray< struct FSlotAnimParameters >               AnimParameters;                                   		// 0x00FC (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	unsigned long                                      bForceLocalSpaceBlend : 1;                        		// 0x0108 (0x0004) [0x0000000000000003] [0x00000001] ( CPF_Edit | CPF_Const )
	unsigned long                                      IssueNotifiesWhenZeroWeight : 1;                  		// 0x0108 (0x0004) [0x0000000000000003] [0x00000002] ( CPF_Edit | CPF_Const )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2918 ];

		return pClassPointer;
	};

	bool IsPlaying ( class UGearboxAnimDefinition* AnimSMD );
	void SetRootMotion ( class URootMotionDefinition* RMDef );
	class UGearboxAnimDefinition* GetCurrentAnimDef ( );
	struct FName GetCurrentAnimName ( );
	void Finish ( unsigned long bInterrupted );
	void Stop ( unsigned long bInterrupted );
	float PlayData ( struct FName AnimNameOverride, float PlayRateScale, float BlendInOverride, float BlendOutOverride, struct FSpecialMoveData* SMData );
	float Play ( class UGearboxAnimDefinition* CustomAnimSMD, struct FName AnimNameOverride, float PlayRateScale, float BlendInOverride, float BlendOutOverride );
};

// Class GearboxFramework.AttributeExpressionEvaluator
// 0x0010 (0x004C - 0x003C)
class UAttributeExpressionEvaluator : public UExpressionEvaluator
{
public:
	struct FAttributeExpressionData                    Expression;                                       		// 0x003C (0x0010) [0x0000000000000003]              ( CPF_Edit | CPF_Const )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2920 ];

		return pClassPointer;
	};

	bool Evaluate ( class UObject* ContextSource );
};

// Class GearboxFramework.Behavior_CallFunction
// 0x0008 (0x0054 - 0x004C)
class UBehavior_CallFunction : public UBehaviorBase
{
public:
	struct FName                                       FunctionName;                                     		// 0x004C (0x0008) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2922 ];

		return pClassPointer;
	};

	void CallFunction ( class AActor* inActor, struct FName InFunctionName );
	void ApplyBehaviorToContext ( class UObject* ContextObject, class UObject* SelfObject, class UObject* MyInstigatorObject, class UObject* OtherEventParticipantObject, struct FBehaviorParameters EventData, struct FBehaviorKernelInfo* KernelInfo );
};

// Class GearboxFramework.Behavior_ChangeRemoteBehaviorSequenceState
// 0x0044 (0x0090 - 0x004C)
class UBehavior_ChangeRemoteBehaviorSequenceState : public UBehaviorBase
{
public:
	unsigned char                                      Action;                                           		// 0x004C (0x0001) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FName                                       SequenceName;                                     		// 0x0050 (0x0008) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	class UObject*                                     SequenceProvider;                                 		// 0x0058 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FNameBasedObjectPath                        ProviderDefinitionPathName;                       		// 0x005C (0x0034) [0x0000000000000002]              ( CPF_Const )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2924 ];

		return pClassPointer;
	};

	void ApplyBehaviorToContext ( class UObject* ContextObject, class UObject* SelfObject, class UObject* MyInstigatorObject, class UObject* OtherEventParticipantObject, struct FBehaviorParameters EventData, struct FBehaviorKernelInfo* KernelInfo );
};

// Class GearboxFramework.Behavior_ChangeTimer
// 0x001C (0x0068 - 0x004C)
class UBehavior_ChangeTimer : public UBehaviorBase
{
public:
	unsigned char                                      TimerId;                                          		// 0x004C (0x0001) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	unsigned char                                      Reaction;                                         		// 0x004D (0x0001) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	unsigned long                                      bSetNewTimerDelay : 1;                            		// 0x0050 (0x0004) [0x0000000000000003] [0x00000001] ( CPF_Edit | CPF_Const )
	struct FAttributeInitializationData                NewTimerDelayFormula;                             		// 0x0054 (0x0010) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	float                                              NewTimerDelay;                                    		// 0x0064 (0x0004) [0x0000000020000002]              ( CPF_Const | CPF_Deprecated )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2926 ];

		return pClassPointer;
	};

	void ApplyBehaviorToContext ( class UObject* ContextObject, class UObject* SelfObject, class UObject* MyInstigatorObject, class UObject* OtherEventParticipantObject, struct FBehaviorParameters EventData, struct FBehaviorKernelInfo* KernelInfo );
};

// Class GearboxFramework.Behavior_IsSequenceEnabled
// 0x0040 (0x008C - 0x004C)
class UBehavior_IsSequenceEnabled : public UBehaviorBase
{
public:
	struct FName                                       SequenceName;                                     		// 0x004C (0x0008) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	class UObject*                                     SequenceProvider;                                 		// 0x0054 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FNameBasedObjectPath                        ProviderDefinitionPathName;                       		// 0x0058 (0x0034) [0x0000000000000002]              ( CPF_Const )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2928 ];

		return pClassPointer;
	};

	void ApplyBehaviorToContext ( class UObject* ContextObject, class UObject* SelfObject, class UObject* MyInstigatorObject, class UObject* OtherEventParticipantObject, struct FBehaviorParameters EventData, struct FBehaviorKernelInfo* KernelInfo );
};

// Class GearboxFramework.Behavior_PostAkEvent
// 0x0010 (0x005C - 0x004C)
class UBehavior_PostAkEvent : public UBehaviorBase
{
public:
	class UAkEvent*                                    Event;                                            		// 0x004C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      bReplicateEvent : 1;                              		// 0x0050 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bForLocalPlayerOnly : 1;                          		// 0x0050 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      bForcePlayImmediate : 1;                          		// 0x0050 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      bPlayFromActor : 1;                               		// 0x0050 (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
	unsigned long                                      bLatentWhenNoConnections : 1;                     		// 0x0050 (0x0004) [0x0000000000000000] [0x00000010] 
	struct FAkPlayingInfo                              PlayingInfo;                                      		// 0x0054 (0x0008) [0x0000000000082000]              ( CPF_Transient | CPF_Component )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2930 ];

		return pClassPointer;
	};

	void ApplyBehaviorToContext ( class UObject* ContextObject, class UObject* SelfObject, class UObject* MyInstigatorObject, class UObject* OtherEventParticipantObject, struct FBehaviorParameters EventData, struct FBehaviorKernelInfo* KernelInfo );
};

// Class GearboxFramework.BehaviorHelpers
// 0x0018 (0x0054 - 0x003C)
class UBehaviorHelpers : public UObject
{
public:
	struct FScriptDelegate                             __BehaviorSetStrategy__Delegate;                  		// 0x003C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FScriptDelegate                             __BehaviorStrategy__Delegate;                     		// 0x0048 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2932 ];

		return pClassPointer;
	};

	void RunAllBehaviorsForEvent ( struct FName EventName, struct FScriptDelegate SetStrategy, struct FScriptDelegate Strategy, class UObject* SelfObject, class UObject* MyInstigatorObject, class UObject* OtherEventParticipantObject, struct FBehaviorParameters EventData, unsigned char EnumValue );
	void BehaviorStrategy ( struct FPointer BehaviorSet, struct FName EventName, unsigned char EnumValue, TArray< class UBehaviorBase* >* BehaviorList );
	void BehaviorSetStrategy ( TArray< struct FPointer >* BehaviorSetList );
	class UBehaviorProviderDefinition* ResolveBehaviorProviderDefinitionReference ( class UBehaviorBase* SourceBehavior, class UObject* ProviderReference, struct FNameBasedObjectPath* PathName );
	bool IsBehaviorsV2 ( struct FBehaviorKernelInfo* KernelInfo );
	bool ShouldContinueExecution ( float TimeBetweenSteps, int MaxSteps, struct FBehaviorKernelInfo* KernelInfo, int* NumSteps );
	struct FName GetNextFireLocationSocket ( unsigned char FireSocketSelection, TArray< struct FName > FireLocationSocketNames, TArray< struct FName >* FireLocationSocketsRemaining );
	bool GetRotationFromAttachmentLocationData ( struct FAttachmentLocationData AttachmentLocation, struct FRotator* AttachmentLocationRotation );
	struct FVector GetRelativeDirection ( struct FRelativeDirectionData DesiredDirection, class UIWorldBody* Source, struct FVector DefaultDirection, struct FName SpawnSocketName );
};

// Class GearboxFramework.CompoundExpressionEvaluator
// 0x000C (0x0048 - 0x003C)
class UCompoundExpressionEvaluator : public UExpressionEvaluator
{
public:
	class UExpressionEvaluator*                        Expression1;                                      		// 0x003C (0x0004) [0x0000000004000001]              ( CPF_Edit | CPF_EditInline )
	unsigned char                                      Operator;                                         		// 0x0040 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	class UExpressionEvaluator*                        Expression2;                                      		// 0x0044 (0x0004) [0x0000000004000001]              ( CPF_Edit | CPF_EditInline )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2934 ];

		return pClassPointer;
	};

	bool Evaluate ( class UObject* ContextSource );
};

// Class GearboxFramework.ConditionalAttributeValueResolver
// 0x0020 (0x005C - 0x003C)
class UConditionalAttributeValueResolver : public UAttributeValueResolver
{
public:
	struct FConditionalInitializationExpressions       ValueExpressions;                                 		// 0x003C (0x0020) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2936 ];

		return pClassPointer;
	};

};

// Class GearboxFramework.ConstantAttributeValueResolver
// 0x0004 (0x0040 - 0x003C)
class UConstantAttributeValueResolver : public UAttributeValueResolver
{
public:
	float                                              ConstantValue;                                    		// 0x003C (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2938 ];

		return pClassPointer;
	};

};

// Class GearboxFramework.ConstraintAttributeValueResolver
// 0x0028 (0x0064 - 0x003C)
class UConstraintAttributeValueResolver : public UAttributeValueResolver
{
public:
	struct FRange                                      Constraints;                                      		// 0x003C (0x0028) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2940 ];

		return pClassPointer;
	};

};

// Class GearboxFramework.FeatherBoneBlendDefinition
// 0x000C (0x0048 - 0x003C)
class UFeatherBoneBlendDefinition : public UGBXDefinition
{
public:
	TArray< struct FFeatherBoneBlendData >             BoneBlends;                                       		// 0x003C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2942 ];

		return pClassPointer;
	};

};

// Class GearboxFramework.GBXActorList
// 0x000C (0x0048 - 0x003C)
class UGBXActorList : public UObject
{
public:
	TArray< struct Fs_actorList >                      ActorList;                                        		// 0x003C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2944 ];

		return pClassPointer;
	};

	void RemoveAndDeleteActorsOfClassFromLevel ( class UClass* TheClass, class ULevel* Level );
	void RemoveActorsOfClassFromLevel ( class UClass* TheClass, class ULevel* Level );
	void RemoveAndDeleteActorsFromLevel ( class ULevel* Level );
	void RemoveActorsFromLevel ( class ULevel* Level );
	class AActor* FindNextActorByLevel ( class ULevel* Level, int* Index );
	class AActor* FindFirstActorByLevel ( class ULevel* Level, int* Index );
	class AActor* FindNextActorByClass ( class UClass* TheClass, int* Index );
	class AActor* FindFirstActorByClass ( class UClass* TheClass, int* Index );
	void RemoveActor ( class AActor* Actor );
	void AddActor ( class AActor* Actor, class ULevel* Level );
};

// Class GearboxFramework.GBXObjectList
// 0x000C (0x0048 - 0x003C)
class UGBXObjectList : public UObject
{
public:
	TArray< class UObject* >                           ObjectList;                                       		// 0x003C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2946 ];

		return pClassPointer;
	};

	void RemoveObjectsOfClass ( class UClass* TheClass );
	class UObject* FindNextObjectByClass ( class UClass* TheClass, int* Index );
	class UObject* FindFirstObjectByClass ( class UClass* TheClass, int* Index );
	void RemoveObject ( class UObject* TheObject );
	void AddObject ( class UObject* TheObject );
};

// Class GearboxFramework.GearboxAIController
// 0x0000 (0x0684 - 0x0684)
class AGearboxAIController : public AAIController
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2948 ];

		return pClassPointer;
	};

	void ForceMoveToActor ( class AActor* destActor );
};

// Class GearboxFramework.GearboxAIMoveNode
// 0x003C (0x01C4 - 0x0188)
class AGearboxAIMoveNode : public AActor
{
public:
	unsigned long                                      bEnabled : 1;                                     		// 0x0188 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bFaceNodeDirection : 1;                           		// 0x0188 (0x0004) [0x0000000000000003] [0x00000002] ( CPF_Edit | CPF_Const )
	TArray< struct FNodeData >                         NextNodes;                                        		// 0x018C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	TArray< class AGearboxAIMoveNode* >                PreviousNodes;                                    		// 0x0198 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	float                                              HoldTime;                                         		// 0x01A4 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	TArray< class UBehaviorBase* >                     Behaviors;                                        		// 0x01A8 (0x000C) [0x0000000004400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink | CPF_EditInline )
	TArray< class USpecialMoveDefinition* >            SpecialMoves;                                     		// 0x01B4 (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
	class USpriteComponent*                            Sprite;                                           		// 0x01C0 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2950 ];

		return pClassPointer;
	};

	bool DoesPatrolPathExistToPoint ( class AGearboxAIMoveNode* PatrolPoint );
	void GetAllLinkedNodes ( TArray< class AGearboxAIMoveNode* >* OutNodes );
	class AGearboxAIMoveNode* GetNextMoveNodeClosestToPoint ( struct FVector TestPoint );
	class AGearboxAIMoveNode* GetNextMoveNode ( );
	int RemoveNode ( class AGearboxAIMoveNode* OldNode );
	void AddNode ( class AGearboxAIMoveNode* NewNode );
	void ClearLinks ( );
	void OnToggle ( class USeqAct_Toggle* Action );
};

// Class GearboxFramework.GearboxCameraBasic
// 0x0004 (0x0400 - 0x03FC)
class AGearboxCameraBasic : public ACamera
{
public:
	struct FPointer                                    VfTable_IInterfaceGearboxCamera;                  		// 0x03FC (0x0004) [0x0000000000801002]              ( CPF_Const | CPF_Native | CPF_NoExport )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2952 ];

		return pClassPointer;
	};

	void eventFinishCameraLookAt ( );
	void eventEnableThirdPersonLookAt ( float LookAtXOffset, float LookAtYOffset, float LookAtZOffset, unsigned char LookAtMode );
	void BeginCameraLookAt ( class AActor* LookAtTarget, struct FName LookAtBone, struct FVector TargetLocation, float Zoom, struct FVector2D FOV, float Duration, float TransitionTimeIn, float TransitionTimeOut );
	void CalcSimpleThirdPersonView ( float DeltaTime, struct FTViewTarget* OutVT );
	void CalcBaseView ( float DeltaTime, struct FTViewTarget* OutVT );
	void UpdateViewTarget ( float DeltaTime, struct FTViewTarget* OutVT );
};

// Class GearboxFramework.GearboxCameraModifier
// 0x0031 (0x0089 - 0x0058)
class UGearboxCameraModifier : public UCameraModifier
{
public:
	class AGearboxCameraBasic*                         GBXCameraOwner;                                   		// 0x0058 (0x0004) [0x0000000000000000]              
	struct FTPOV                                       DesiredPOV;                                       		// 0x005C (0x001C) [0x0000000000000000]              
	float                                              MasterFadeValue;                                  		// 0x0078 (0x0004) [0x0000000000000000]              
	float                                              FadeElapsedTime;                                  		// 0x007C (0x0004) [0x0000000000000000]              
	float                                              FadeTimeSpan;                                     		// 0x0080 (0x0004) [0x0000000000000000]              
	unsigned long                                      FadeStarted : 1;                                  		// 0x0084 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      FadingUpwards : 1;                                		// 0x0084 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      DisableWhenFadedOut : 1;                          		// 0x0084 (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      AdjustForTimeDilation : 1;                        		// 0x0084 (0x0004) [0x0000000000000002] [0x00000008] ( CPF_Const )
	unsigned char                                      FadeMode;                                         		// 0x0088 (0x0001) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2954 ];

		return pClassPointer;
	};

	float LerpFOV ( float Src, float Dest, float T );
	struct FRotator LerpRotation ( struct FRotator Src, struct FRotator Dest, float T );
	struct FVector LerpLocation ( struct FVector Src, struct FVector Dest, float T );
	void UpdateAllLerps ( float DeltaTime, struct FTPOV* OutPOV );
	void UpdateMasterFadePercentage ( float AdjustedDeltaTime );
	bool IsFadingDownwards ( );
	bool IsFadingUpwards ( );
	bool IsFadeInProgress ( );
	void StartFadeOut ( float NewTimeSpan, unsigned long NewDisableWhenFadedOut, unsigned char NewFadeMode );
	void StartFadeIn ( float NewTimeSpan, unsigned char NewFadeMode );
	void SetDesiredCamera ( struct FVector DesiredLoc, struct FRotator DesiredRot, float DesiredFOV );
	void SetGBXCameraOwner ( class AGearboxCameraBasic* InCamera );
	bool AddCameraModifier ( class ACamera* Camera );
};

// Class GearboxFramework.GearboxCheatManager
// 0x0000 (0x005C - 0x005C)
class UGearboxCheatManager : public UCheatManager
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2956 ];

		return pClassPointer;
	};

};

// Class GearboxFramework.GearboxDialogInterface
// 0x0000 (0x003C - 0x003C)
class UGearboxDialogInterface : public UInterface
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2958 ];

		return pClassPointer;
	};

	void eventServerDialog_TriggerEvent ( class UGearboxDialogEventTag* EventTag, class AActor* Other, class UObject* ObjectParameter );
	void SetDialogNameTag ( class UGearboxDialogNameTag* NewName );
	struct FGearboxDialogReplicatedData GetReplicatedDialogData ( );
	void SetReplicatedDialogData ( class UGearboxDialogAct_Talk* TalkAct, struct FGearboxDialogData* Data );
	void GetDialogGroups ( TArray< class UGearboxDialogGroup* >* Groups );
	class UGearboxDialogComponent* GetDialogComponent ( );
	class UGearboxDialogNameTag* GetDialogNameTag ( );
	class AActor* GetActor ( );
	bool CanTalk ( );
};

// Class GearboxFramework.GearboxEditorNode
// 0x0030 (0x006C - 0x003C)
class UGearboxEditorNode : public UObject
{
public:
	unsigned char                                      Type;                                             		// 0x003C (0x0001) [0x0000000000000000]              
	TArray< struct FOutputLink >                       OutputLinks;                                      		// 0x0040 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< class UGearboxEditorNode* >                InputLinks;                                       		// 0x004C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FVariableLink >                     VariableLinks;                                    		// 0x0058 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned long                                      bAllowInputs : 1;                                 		// 0x0064 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bAllowOutputs : 1;                                		// 0x0064 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bAllowVariables : 1;                              		// 0x0064 (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      bAllowMovement : 1;                               		// 0x0064 (0x0004) [0x0000000000000000] [0x00000008] 
	unsigned long                                      bAllowMultipleInputs : 1;                         		// 0x0064 (0x0004) [0x0000000000000000] [0x00000010] 
	unsigned long                                      bAllowMultipleOutputs : 1;                        		// 0x0064 (0x0004) [0x0000000000000000] [0x00000020] 
	unsigned long                                      bAllowMultipleVariables : 1;                      		// 0x0064 (0x0004) [0x0000000000000000] [0x00000040] 
	float                                              SliderPosition;                                   		// 0x0068 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2960 ];

		return pClassPointer;
	};

	bool IsChild ( class UGearboxEditorNode* TestNode );
};

// Class GearboxFramework.GearboxEngine
// 0x0020 (0x07CC - 0x07AC)
class UGearboxEngine : public UGameEngine
{
public:
	int                                                CurrentUserID;                                    		// 0x07AC (0x0004) [0x0000000000000000]              
	int                                                CurrentDeviceID;                                  		// 0x07B0 (0x0004) [0x0000000000000000]              
	unsigned long                                      bHasSelectedValidStorageDevice : 1;               		// 0x07B4 (0x0004) [0x0000000000002002] [0x00000001] ( CPF_Const | CPF_Transient )
	struct FString                                     DefaultSparkInterfaceName;                        		// 0x07B8 (0x000C) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	class USparkInterface*                             SparkInterface;                                   		// 0x07C4 (0x0008) [0x0000000000002002]              ( CPF_Const | CPF_Transient )
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x07C8 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2962 ];

		return pClassPointer;
	};

	class USparkInterface* GetSparkInterface ( );
	bool eventIsCurrentDeviceValid ( int SizeNeeded );
	bool HasStorageDeviceBeenRemoved ( );
	int GetCurrentDeviceID ( );
	void SetCurrentDeviceID ( int NewDeviceID, unsigned long bProfileSignedOut );
};

// Class GearboxFramework.GearboxGameInfo
// 0x0000 (0x0330 - 0x0330)
class AGearboxGameInfo : public AGameInfo
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2964 ];

		return pClassPointer;
	};

	void eventPostLogin ( class APlayerController* NewPlayer );
};

// Class GearboxFramework.GearboxGFxMovie
// 0x008C (0x0254 - 0x01C8)
class UGearboxGFxMovie : public UGFxMovie
{
public:
	TArray< struct FAkEventResolver >                  InteractionOverrideSounds;                        		// 0x01C8 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	float                                              TickRateSeconds;                                  		// 0x01D4 (0x0004) [0x0000000000000000]              
	unsigned long                                      bTickScript : 1;                                  		// 0x01D8 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bTickFirstFrame : 1;                              		// 0x01D8 (0x0004) [0x0000000000002000] [0x00000002] ( CPF_Transient )
	unsigned long                                      bRenderingDisabled : 1;                           		// 0x01D8 (0x0004) [0x0000000000002000] [0x00000004] ( CPF_Transient )
	unsigned long                                      bSupportsStatePooling : 1;                        		// 0x01D8 (0x0004) [0x0000000000000000] [0x00000008] 
	unsigned long                                      bIsUsingFlashMouse : 1;                           		// 0x01D8 (0x0004) [0x0000000000000000] [0x00000010] 
	unsigned long                                      bBlockingMovie : 1;                               		// 0x01D8 (0x0004) [0x0000000000000000] [0x00000020] 
	unsigned long                                      bCloseOnDeath : 1;                                		// 0x01D8 (0x0004) [0x0000000000000000] [0x00000040] 
	TArray< class UGFxMovieDrawStyle* >                AllStyles;                                        		// 0x01DC (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	class UGFxMovieDefinition*                         MyDefinition;                                     		// 0x01E8 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UGFxActorMoviePool*                          MyPool;                                           		// 0x01EC (0x0004) [0x0000000000002000]              ( CPF_Transient )
	TArray< class AGearboxPlayerController* >          PlayerOwners;                                     		// 0x01F0 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	class UObject*                                     ContextObject;                                    		// 0x01FC (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              LastTickTime;                                     		// 0x0200 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UGearboxGFxMovie*                            PoolParent;                                       		// 0x0204 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	struct FMovieStateStruct                           CurrentMovieState;                                		// 0x0208 (0x0018) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	TArray< class UGFxMovieState* >                    BaseMovieStates;                                  		// 0x0220 (0x000C) [0x0000000004400001]              ( CPF_Edit | CPF_NeedCtorLink | CPF_EditInline )
	TArray< class UGFxMovieState* >                    AllMovieStates;                                   		// 0x022C (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	int                                                bMouseable;                                       		// 0x0238 (0x0004) [0x0000000000000000]              
	struct FScriptDelegate                             __OnInputAxis__Delegate;                          		// 0x023C (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	struct FScriptDelegate                             __OnClosed__Delegate;                             		// 0x0248 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2966 ];

		return pClassPointer;
	};

	void extSetLanguageExt ( struct FString ClipPath );
	void OnClosedOnDeath ( );
	bool IsShowingFlashMouse ( );
	int extIsMouseablePlatform ( );
	void eventSetMouseableFlag ( );
	struct FString GetStyleDebugString ( );
	struct FString GetStateDebugString ( unsigned long bIncludeFlags );
	void InitializeFrom ( class UGearboxGFxMovie* SrcMovie );
	bool RemoveStylesDrawnTo ( class UPrimitiveComponent* PrimComp, class UIGFxActorMovie* Target );
	bool RemoveStyles ( class UIGFxActorMovie* Target );
	void RemoveStyle ( class UGFxMovieDrawStyle* Style );
	void AddStyle ( class UGFxMovieDrawStyle* Style );
	void ShutdownMoviePlayback ( );
	void InitMoviePlayback ( );
	class UTextureRenderTarget2D* GetRenderTexture ( );
	void eventMovieState_OnChanged ( unsigned long bStateWasChanged );
	bool eventMovieState_SetFromMovie ( class UGearboxGFxMovie* Movie );
	bool MovieState_Copy ( struct FMovieStateStruct* StateDst, struct FMovieStateStruct* StateSrc );
	bool MovieState_Compare ( struct FMovieStateStruct* S1, struct FMovieStateStruct* S2 );
	void MovieState_Toggle ( struct FName TheState );
	bool MovieState_Enable ( struct FName TheState, unsigned long bEnable );
	bool MovieState_IsEnabled ( struct FName TheState );
	bool MovieState_SupportsState ( struct FName TheState );
	void MovieState_Init ( );
	void InitFromDefinition ( );
	void MovieState_Apply ( class UGearboxGFxMovie* Movie, class UClass* HandlerClass );
	void MovieState_ApplyState ( struct FName TheState, class UGearboxGFxMovie* Movie );
	void ApplyState ( struct FString StateName, struct FString StateAction );
	void SetRenderingEnabled ( unsigned long bEnabled );
	void GotoAndStop ( struct FString FrameLabel );
	void GotoAndPlay ( struct FString FrameLabel );
	void PlaySpecialUISound ( struct FString SoundString );
	void eventPlayUISound ( struct FName UIEvent );
	void eventSetOtherObject ( class UObject* Obj );
	class UObject* GetInstanceContextObject ( );
	void eventOnTick ( );
	void eventOnClose ( );
	bool eventStart ( unsigned long StartPaused );
	struct FString ColorizeTooltipText ( struct FString S, unsigned long bDisabled );
	struct FString GFxColoredText ( unsigned long bAppendNewline, struct FColor* C, struct FString* S );
	void SingleArgInvokeB ( struct FString Command, unsigned long Arg );
	void SingleArgInvokeS ( struct FString Command, struct FString Arg );
	void SingleArgInvokeF ( struct FString Command, float Arg );
	class ULocalPlayer* GetLocalPlayer ( );
	void OnClosed ( class UGearboxGFxMovie* Movie );
	bool WantsControllerInput ( int ControllerId );
	bool SetExternalTexture ( struct FString Resource, class UTexture* Texture );
	bool OnInputAxis ( int ControllerId, struct FName ukey, float Delta, float DeltaTime );
};

// Class GearboxFramework.GFxMovie_StateParent
// 0x0004 (0x0258 - 0x0254)
class UGFxMovie_StateParent : public UGearboxGFxMovie
{
public:
	class UClass*                                      StateClass;                                       		// 0x0254 (0x0004) [0x0000000000002000]              ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2968 ];

		return pClassPointer;
	};

	void MovieState_OnChanged ( unsigned long bStateWasChanged );
	bool eventStart ( unsigned long StartPaused );
};

// Class GearboxFramework.GearboxGlobals
// 0x0070 (0x00F4 - 0x0084)
class UGearboxGlobals : public UGearboxEngineGlobals
{
public:
	class UGearboxGlobalsDefinition*                   TheGlobalsDefinition;                             		// 0x0084 (0x0004) [0x0000000000000000]              
	class UClass*                                      ExposureUtilityClass;                             		// 0x0088 (0x0004) [0x0000000000000000]              
	class UClass*                                      ExposureUtilityStrategyClass;                     		// 0x008C (0x0004) [0x0000000000000000]              
	class UExposureUtilityBase*                        TheExposureUtility;                               		// 0x0090 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UGearboxAIFactory*                           TheAIFactory;                                     		// 0x0094 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class URuleEngineLoadBalanceManager*               TheRuleEngineLoadBalanceManager;                  		// 0x0098 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UGBXActorList*                               TheGBXActorList;                                  		// 0x009C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UGBXObjectList*                              TheGBXObjectList;                                 		// 0x00A0 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	TArray< struct FValidNameRange >                   ValidNameList;                                    		// 0x00A4 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	class AWireManager*                                TheWireMgr;                                       		// 0x00B0 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UGbxMessageManager*                          TheMessageManager;                                		// 0x00B4 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UGBXActorList*                               TheDynamicTextureActorList;                       		// 0x00B8 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UPopulationMaster*                           ThePopulationMaster;                              		// 0x00BC (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UBehaviorKernel*                             TheBehaviorKernel;                                		// 0x00C0 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UScreenSpaceManager*                         TheScreenSpaceManager;                            		// 0x00C4 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UGFxMovieManager*                            TheGFxManager;                                    		// 0x00C8 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UGearboxRenderTextureManager*                TheRenderTextureManager;                          		// 0x00CC (0x0004) [0x0000000000002000]              ( CPF_Transient )
	struct FString                                     GlobalInstanceClassName;                          		// 0x00D0 (0x000C) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	int                                                DefaultMaxPopulationActorCost;                    		// 0x00DC (0x0004) [0x0000000000004000]              ( CPF_Config )
	TArray< struct FLevelStateRecord >                 StateRecords;                                     		// 0x00E0 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UAkComponent*                                UIAudioComponent;                                 		// 0x00EC (0x0004) [0x0000000004082008]              ( CPF_ExportObject | CPF_Transient | CPF_Component | CPF_EditInline )
	class UGearboxDialogManager*                       TheDialogManager;                                 		// 0x00F0 (0x0004) [0x0000000000002000]              ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2970 ];

		return pClassPointer;
	};

	class UBehaviorKernel* GetBehaviorKernel ( );
	class UGearboxDialogManager* GetDialogManager ( );
	float GetPopulationRespawnDelay ( );
	class UIDialogBox* eventShowDialog ( class APlayerController* PC );
	void NotifyActorDied ( class AActor* TheActor, unsigned long bKeepBody );
	bool DoesLOSIntersectSpecialOccluder ( struct FVector FromLoc, struct FVector ToLoc, class UPawnAllegiance* AllegianceAffected );
	bool HasPhysXCapableGPU ( );
	unsigned char GetPlatform ( );
	bool ValidatePlayerName ( unsigned long bReplaceCharacters, struct FString* InName );
	bool RegisterStateKey ( struct FName LevelName, struct FName ObjectName, struct FName AdditionalKey );
	bool DoesStateKeyExist ( struct FName LevelName, struct FName ObjectName, struct FName AdditionalKey );
	bool FreeTexture2D ( class UTexture2D* Texture );
	class UTexture2D* GetTexture2D ( );
	class UGearboxRenderTextureManager* GetRenderTextureManager ( );
	class UGFxMovieManager* GetGFxManager ( );
	class UScreenSpaceManager* GetScreenSpaceManager ( );
	class UGbxMessageManager* GetMessageManager ( );
	void RegDynamicTextureStreaming ( class AActor* A, unsigned long bRegister );
	class UGBXActorList* GetDynamicTextureActorList ( );
	class UPopulationMaster* GetPopulationMaster ( );
	class AWireManager* GetWireManager ( );
	class UGBXObjectList* GetGBXObjectList ( );
	class UGBXActorList* GetGBXActorList ( );
	class URuleEngineLoadBalanceManager* GetRuleEngineLoadBalanceManager ( );
	class UGearboxAIFactory* GetGearboxAIFactory ( );
	class UExposureUtilityBase* GetExposureUtility ( );
	class UGearboxGlobals* GetGearboxGlobals ( );
};

// Class GearboxFramework.GearboxGlobalsDefinition
// 0x0008 (0x0044 - 0x003C)
class UGearboxGlobalsDefinition : public UGBXDefinition
{
public:
	float                                              RespawnDelayInSeconds;                            		// 0x003C (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	class UGearboxDialogGlobalsDefinition*             Dialog;                                           		// 0x0040 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2972 ];

		return pClassPointer;
	};

};

// Class GearboxFramework.GearboxLocationRequest
// 0x004C (0x0088 - 0x003C)
class UGearboxLocationRequest : public UObject
{
public:
	class USearchOrigin*                               SearchOrigin;                                     		// 0x003C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class USearchDirection*                            DirectionFromOrigin;                              		// 0x0040 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class ULocationFilter*                             LocationFilterTest;                               		// 0x0044 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              DirectionCone;                                    		// 0x0048 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FAttributeInitializationData                MinDistanceFromOrigin;                            		// 0x004C (0x0010) [0x0000000000000001]              ( CPF_Edit )
	struct FAttributeInitializationData                MaxDistanceFromOrigin;                            		// 0x005C (0x0010) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      SearchRandomness;                                 		// 0x006C (0x0001) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     SearchOriginResult;                               		// 0x0070 (0x000C) [0x0000000000000000]              
	struct FVector                                     SearchDirectionResult;                            		// 0x007C (0x000C) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2974 ];

		return pClassPointer;
	};

	struct FVector GetLastDirection ( );
	struct FVector GetLastOrigin ( );
	bool GetDirection ( class AActor* ContextActor, struct FVector* OutDirection );
	bool GetOrigin ( class AActor* ContextActor, struct FVector* OutOrigin );
	bool Get ( class AActor* ContextActor, struct FVector* OutLocation );
};

// Class GearboxFramework.PawnMoveLocationRequest
// 0x002C (0x00B4 - 0x0088)
class UPawnMoveLocationRequest : public UGearboxLocationRequest
{
public:
	unsigned long                                      GoToCover : 1;                                    		// 0x0088 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned char                                      CoverSearchFilter;                                		// 0x008C (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      RepathOption;                                     		// 0x008D (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      CoverFailureResponse;                             		// 0x008E (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      DestinationTestNonCover;                          		// 0x008F (0x0001) [0x0000000000000001]              ( CPF_Edit )
	struct FAttributeInitializationData                RepathDistanceThresh;                             		// 0x0090 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	class URuleEventDef*                               FailureEvent;                                     		// 0x00A0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FAttributeInitializationData                OverrideDistanceForCover;                         		// 0x00A4 (0x0010) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2976 ];

		return pClassPointer;
	};

	bool Get ( class AActor* ContextActor, struct FVector* OutLocation );
};

// Class GearboxFramework.GearboxPawn
// 0x006C (0x06FC - 0x0690)
class AGearboxPawn : public AGamePawn
{
public:
	struct FPointer                                    VfTable_ISpecialMoveInterface;                    		// 0x0690 (0x0004) [0x0000000000801002]              ( CPF_Const | CPF_Native | CPF_NoExport )
	struct FPointer                                    VfTable_IGearboxDialogInterface;                  		// 0x0694 (0x0004) [0x0000000000801002]              ( CPF_Const | CPF_Native | CPF_NoExport )
