/*
#############################################################################################
# Borderlands 2 (1.0.35.4705) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Script Structs
# ========================================================================================= #
*/

// ScriptStruct GearboxFramework.AIComponent.AIHoldData
// 0x000C
struct FAIHoldData
{
	struct FName                                       HoldName;                                         		// 0x0000 (0x0008) [0x0000000000000000]              
	class UObject*                                     HoldTag;                                          		// 0x0008 (0x0004) [0x0000000000000000]              
};

// ScriptStruct GearboxFramework.AIComponent.AIResourceData
// 0x001C
struct FAIResourceData
{
	class UAIResource*                                 Resource;                                         		// 0x0000 (0x0004) [0x0000000000000000]              
	TArray< struct FPointer >                          CanRun;                                           		// 0x0004 (0x000C) [0x0000000000001002]              ( CPF_Const | CPF_Native )
	TArray< struct FPointer >                          Running;                                          		// 0x0010 (0x000C) [0x0000000000001002]              ( CPF_Const | CPF_Native )
};

// ScriptStruct GearboxFramework.AIComponent.AIRange
// 0x0008
struct FAIRange
{
	float                                              MinVal;                                           		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              MaxVal;                                           		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct GearboxFramework.AIComponent.AITreeData
// 0x00AD
struct FAITreeData
{
	class UIAIInterface*                               AI;                                               		// 0x0000 (0x0008) [0x0000000000000002]              ( CPF_Const )
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x0004 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	unsigned char                                      Type;                                             		// 0x0008 (0x0001) [0x0000000000020003]              ( CPF_Edit | CPF_Const | CPF_EditConst )
	TArray< int >                                      Children;                                         		// 0x000C (0x000C) [0x0000000000420003]              ( CPF_Edit | CPF_Const | CPF_EditConst | CPF_NeedCtorLink )
	class UAIResource*                                 Resource;                                         		// 0x0018 (0x0004) [0x0000000000020003]              ( CPF_Edit | CPF_Const | CPF_EditConst )
	class UExpressionEvaluator*                        CanRunIf;                                         		// 0x001C (0x0004) [0x0000000000020003]              ( CPF_Edit | CPF_Const | CPF_EditConst )
	struct FAIRange                                    TimedStart;                                       		// 0x0020 (0x0008) [0x0000000000020003]              ( CPF_Edit | CPF_Const | CPF_EditConst )
	struct FAIRange                                    TimedReset;                                       		// 0x0028 (0x0008) [0x0000000000020003]              ( CPF_Edit | CPF_Const | CPF_EditConst )
	struct FAIRange                                    TimedFail;                                        		// 0x0030 (0x0008) [0x0000000000020003]              ( CPF_Edit | CPF_Const | CPF_EditConst )
	unsigned long                                      bStopIfCannotRun : 1;                             		// 0x0038 (0x0004) [0x0000000000020003] [0x00000001] ( CPF_Edit | CPF_Const | CPF_EditConst )
	int                                                ActiveChild;                                      		// 0x003C (0x0004) [0x0000000000000002]              ( CPF_Const )
	int                                                NextActiveChild;                                  		// 0x0040 (0x0004) [0x0000000000000002]              ( CPF_Const )
	float                                              LastFailTime;                                     		// 0x0044 (0x0004) [0x0000000000000002]              ( CPF_Const )
	float                                              NextTimedRun;                                     		// 0x0048 (0x0004) [0x0000000000000002]              ( CPF_Const )
	float                                              NextTimedFail;                                    		// 0x004C (0x0004) [0x0000000000000002]              ( CPF_Const )
	float                                              NextTimedResource;                                		// 0x0050 (0x0004) [0x0000000000000002]              ( CPF_Const )
	unsigned long                                      bHoldingResource : 1;                             		// 0x0054 (0x0004) [0x0000000000000002] [0x00000001] ( CPF_Const )
	class UActionSequence*                             Action;                                           		// 0x0058 (0x0004) [0x0000000000020003]              ( CPF_Edit | CPF_Const | CPF_EditConst )
	int                                                LoopCount;                                        		// 0x005C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                LastRandomChild;                                  		// 0x0060 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	TArray< float >                                    Weights;                                          		// 0x0064 (0x000C) [0x0000000000420003]              ( CPF_Edit | CPF_Const | CPF_EditConst | CPF_NeedCtorLink )
	TArray< int >                                      LoopCountMax;                                     		// 0x0070 (0x000C) [0x0000000000420003]              ( CPF_Edit | CPF_Const | CPF_EditConst | CPF_NeedCtorLink )
	unsigned long                                      bInterrupt : 1;                                   		// 0x007C (0x0004) [0x0000000000020003] [0x00000001] ( CPF_Edit | CPF_Const | CPF_EditConst )
	TArray< class UExpressionEvaluator* >              Conditions;                                       		// 0x0080 (0x000C) [0x0000000000420003]              ( CPF_Edit | CPF_Const | CPF_EditConst | CPF_NeedCtorLink )
	int                                                NextSequentialChild;                              		// 0x008C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                PosX;                                             		// 0x0090 (0x0004) [0x0000000000000002]              ( CPF_Const )
	int                                                PosY;                                             		// 0x0094 (0x0004) [0x0000000000000002]              ( CPF_Const )
	struct FString                                     NodeName;                                         		// 0x0098 (0x000C) [0x0000000000400002]              ( CPF_Const | CPF_NeedCtorLink )
	struct FName                                       ActionFailName;                                   		// 0x00A4 (0x0008) [0x0000000000000002]              ( CPF_Const )
	unsigned char                                      FailReason;                                       		// 0x00AC (0x0001) [0x0000000000000002]              ( CPF_Const )
};

// ScriptStruct GearboxFramework.AIComponent.PriorityData
// 0x0010
struct FPriorityData
{
	struct FString                                     Description;                                      		// 0x0000 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	class UExpressionEvaluator*                        Condition;                                        		// 0x000C (0x0004) [0x0000000004000001]              ( CPF_Edit | CPF_EditInline )
};

// ScriptStruct GearboxFramework.FlagDefinition.FlagDefinitionInitialization
// 0x0028
struct FFlagDefinitionInitialization
{
	class UFlagDefinition*                             FlagToSet;                                        		// 0x0000 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FAttributeInitializationData                ChanceTrue;                                       		// 0x0004 (0x0010) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	float                                              ProbabilityTrue;                                  		// 0x0014 (0x0004) [0x0000000000000002]              ( CPF_Const )
	struct FAttributeInitializationData                Duration;                                         		// 0x0018 (0x0010) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
};

// ScriptStruct GearboxFramework.GearboxGlobals.CoverDebugScoringInfo
// 0x000C
struct FCoverDebugScoringInfo
{
	struct FName                                       PriorityName;                                     		// 0x0000 (0x0008) [0x0000000000000000]              
	float                                              Score;                                            		// 0x0008 (0x0004) [0x0000000000000000]              
};

// ScriptStruct GearboxFramework.GearboxGlobals.CoverDebugPriority
// 0x002C
struct FCoverDebugPriority
{
	float                                              Score;                                            		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              Distance;                                         		// 0x0004 (0x0004) [0x0000000000000000]              
	unsigned long                                      IsACandidate : 1;                                 		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      IsBestCandidate : 1;                              		// 0x0008 (0x0004) [0x0000000000000000] [0x00000002] 
	class AActor*                                      TheCoverActor;                                    		// 0x000C (0x0004) [0x0000000000000000]              
	int                                                SlotNdx;                                          		// 0x0010 (0x0004) [0x0000000000000000]              
	struct FString                                     FailString;                                       		// 0x0014 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FCoverDebugScoringInfo >            ScoringInfo;                                      		// 0x0020 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct GearboxFramework.GearboxGlobals.ValidNameRange
// 0x0008
struct FValidNameRange
{
	int                                                Start;                                            		// 0x0000 (0x0004) [0x0000000000100000]              
	int                                                End;                                              		// 0x0004 (0x0004) [0x0000000000100000]              
};

// ScriptStruct GearboxFramework.GearboxGlobals.ObjectKey
// 0x0010
struct FObjectKey
{
	struct FName                                       ObjectName;                                       		// 0x0000 (0x0008) [0x0000000000100000]              
	struct FName                                       AdditionalKey;                                    		// 0x0008 (0x0008) [0x0000000000100000]              
};

// ScriptStruct GearboxFramework.GearboxGlobals.LevelStateRecord
// 0x0018
struct FLevelStateRecord
{
	struct FName                                       LevelName;                                        		// 0x0000 (0x0008) [0x0000000000100000]              
	unsigned char                                      LevelLoaded;                                      		// 0x0008 (0x0001) [0x0000000000100000]              
	TArray< struct FObjectKey >                        ObjectKeys;                                       		// 0x000C (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
};

// ScriptStruct GearboxFramework.GearboxGlobals.VantageSpot
// 0x000D
struct FVantageSpot
{
	struct FVector                                     Location;                                         		// 0x0000 (0x000C) [0x0000000000000000]              
	unsigned char                                      VantageType;                                      		// 0x000C (0x0001) [0x0000000000000000]              
};

// ScriptStruct GearboxFramework.GearboxGlobals.GearboxCoverState
// 0x000C
struct FGearboxCoverState
{
	class AActor*                                      TheCoverActor;                                    		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                SlotIndex;                                        		// 0x0004 (0x0004) [0x0000000000000000]              
	unsigned char                                      State;                                            		// 0x0008 (0x0001) [0x0000000000000000]              
	unsigned char                                      ExtendedState;                                    		// 0x0009 (0x0001) [0x0000000000000000]              
	unsigned char                                      MetaData;                                         		// 0x000A (0x0001) [0x0000000000000000]              
	unsigned char                                      ExtendedMetaData;                                 		// 0x000B (0x0001) [0x0000000000000000]              
};

// ScriptStruct GearboxFramework.GearboxGlobals.GearboxCoverTransition
// 0x0004
struct FGearboxCoverTransition
{
	unsigned char                                      Action;                                           		// 0x0000 (0x0001) [0x0000000000000000]              
	unsigned char                                      ExtendedAction;                                   		// 0x0001 (0x0001) [0x0000000000000000]              
	unsigned char                                      Padding[ 0x2 ];                                   		// 0x0002 (0x0002) [0x0000000000000000]              
};

// ScriptStruct GearboxFramework.GearboxGlobals.CoverCandidate
// 0x000C
struct FCoverCandidate
{
	class AActor*                                      TheCoverActor;                                    		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                SlotNdx;                                          		// 0x0004 (0x0004) [0x0000000000000000]              
	float                                              Score;                                            		// 0x0008 (0x0004) [0x0000000000000000]              
};

// ScriptStruct GearboxFramework.GearboxGlobals.PopulationActor
// 0x0028
struct FPopulationActor
{
	class UPopulationFactory*                          SpawnFactory;                                     		// 0x0000 (0x0004) [0x0000000004000003]              ( CPF_Edit | CPF_Const | CPF_EditInline )
	struct FAttributeInitializationData                Probability;                                      		// 0x0004 (0x0010) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FAttributeInitializationData                MaxActiveAtOneTime;                               		// 0x0014 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      TestVisibility : 1;                               		// 0x0024 (0x0004) [0x0000000000000003] [0x00000001] ( CPF_Edit | CPF_Const )
	unsigned long                                      TestFOV : 1;                                      		// 0x0024 (0x0004) [0x0000000000000003] [0x00000002] ( CPF_Edit | CPF_Const )
};

// ScriptStruct GearboxFramework.GearboxGlobals.LocationInfo
// 0x0010
struct FLocationInfo
{
	struct FVector                                     Location;                                         		// 0x0000 (0x000C) [0x0000000000000000]              
	unsigned long                                      IsPlayerInfo : 1;                                 		// 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct GearboxFramework.ActionSequenceRandom.ActionSequenceRandomData
// 0x0014
struct FActionSequenceRandomData
{
	struct FAttributeInitializationData                ProbabilityData;                                  		// 0x0000 (0x0010) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	class UActionSequence*                             ActionToRunWhenTrue;                              		// 0x0010 (0x0004) [0x0000000004000003]              ( CPF_Edit | CPF_Const | CPF_EditInline )
};

// ScriptStruct GearboxFramework.BehaviorProviderDefinition.SubarrayData
// 0x0004
struct FSubarrayData
{
	int                                                ArrayIndexAndLength;                              		// 0x0000 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
};

// ScriptStruct GearboxFramework.BehaviorProviderDefinition.BehaviorSequenceActionData2
// 0x000C
struct FBehaviorSequenceActionData2
{
	class UBehaviorBase*                               Behavior;                                         		// 0x0000 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FSubarrayData                               LinkedVariables;                                  		// 0x0004 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FSubarrayData                               OutputLinks;                                      		// 0x0008 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
};

// ScriptStruct GearboxFramework.BehaviorProviderDefinition.BehaviorVariableValue
// 0x0019
struct FBehaviorVariableValue
{
	int                                                IntValue;                                         		// 0x0000 (0x0004) [0x0000000000000002]              ( CPF_Const )
	float                                              FloatValue;                                       		// 0x0004 (0x0004) [0x0000000000000002]              ( CPF_Const )
	struct FVector                                     VectorValue;                                      		// 0x0008 (0x000C) [0x0000000000000002]              ( CPF_Const )
	class UObject*                                     ObjectValue;                                      		// 0x0014 (0x0004) [0x0000000000000002]              ( CPF_Const )
	unsigned char                                      VariableType;                                     		// 0x0018 (0x0001) [0x0000000000000002]              ( CPF_Const )
};

// ScriptStruct GearboxFramework.BehaviorProviderDefinition.BehaviorVariableValueUnion_Mirror
// 0x0004
struct FBehaviorVariableValueUnion_Mirror
{
	struct FPointer                                    Data;                                             		// 0x0000 (0x0004) [0x0000000000001002]              ( CPF_Const | CPF_Native )
};

// ScriptStruct GearboxFramework.BehaviorProviderDefinition.BehaviorVariableData
// 0x0010
struct FBehaviorVariableData
{
	struct FName                                       Name;                                             		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      Type;                                             		// 0x0008 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	struct FBehaviorVariableValueUnion_Mirror          Value;                                            		// 0x000C (0x0004) [0x0000000000801000]              ( CPF_Native | CPF_NoExport )
};

// ScriptStruct GearboxFramework.BehaviorProviderDefinition.BehaviorEventUserData
// 0x0018
struct FBehaviorEventUserData
{
	struct FName                                       EventName;                                        		// 0x0000 (0x0008) [0x0000000000020001]              ( CPF_Edit | CPF_EditConst )
	unsigned long                                      bEnabled : 1;                                     		// 0x0008 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bReplicate : 1;                                   		// 0x0008 (0x0004) [0x0000000000000000] [0x00000002] 
	int                                                MaxTriggerCount;                                  		// 0x000C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              ReTriggerDelay;                                   		// 0x0010 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UBehaviorEventFilterBase*                    FilterObject;                                     		// 0x0014 (0x0004) [0x0000000004420009]              ( CPF_Edit | CPF_ExportObject | CPF_EditConst | CPF_NeedCtorLink | CPF_EditInline )
};

// ScriptStruct GearboxFramework.BehaviorProviderDefinition.BehaviorVariableLinkData
// 0x001C
struct FBehaviorVariableLinkData
{
	struct FName                                       PropertyName;                                     		// 0x0000 (0x0008) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	int                                                ConnectionIndex;                                  		// 0x0008 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	TArray< int >                                      LinkedVariables;                                  		// 0x000C (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
	class UProperty*                                   CachedProperty;                                   		// 0x0018 (0x0004) [0x0000000000002000]              ( CPF_Transient )
};

// ScriptStruct GearboxFramework.BehaviorProviderDefinition.BehaviorActionLinkData
// 0x0008
struct FBehaviorActionLinkData
{
	int                                                LinkedBehavior;                                   		// 0x0000 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	float                                              ActivateDelay;                                    		// 0x0004 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
};

// ScriptStruct GearboxFramework.BehaviorProviderDefinition.BehaviorOutputLinkData
// 0x0010
struct FBehaviorOutputLinkData
{
	int                                                LinkId;                                           		// 0x0000 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	TArray< struct FBehaviorActionLinkData >           LinkedActions;                                    		// 0x0004 (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
};

// ScriptStruct GearboxFramework.BehaviorProviderDefinition.BehaviorEventData
// 0x0030
struct FBehaviorEventData
{
	struct FBehaviorEventUserData                      UserData;                                         		// 0x0000 (0x0018) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
	TArray< struct FBehaviorVariableLinkData >         OutputVariables;                                  		// 0x0018 (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
	TArray< struct FBehaviorOutputLinkData >           OutputLinks;                                      		// 0x0024 (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
};

// ScriptStruct GearboxFramework.BehaviorProviderDefinition.BehaviorEventData2
// 0x0020
struct FBehaviorEventData2
{
	struct FBehaviorEventUserData                      UserData;                                         		// 0x0000 (0x0018) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
	struct FSubarrayData                               OutputVariables;                                  		// 0x0018 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FSubarrayData                               OutputLinks;                                      		// 0x001C (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
};

// ScriptStruct GearboxFramework.BehaviorProviderDefinition.BehaviorSequenceActionData
// 0x0044
struct FBehaviorSequenceActionData
{
	class UBehaviorBase*                               Behavior;                                         		// 0x0000 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FBehaviorVariableLinkData                   ContextVariables;                                 		// 0x0004 (0x001C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	TArray< struct FBehaviorVariableLinkData >         LinkedVariables;                                  		// 0x0020 (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
	TArray< struct FBehaviorVariableLinkData >         OutputVariables;                                  		// 0x002C (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
	TArray< struct FBehaviorOutputLinkData >           OutputLinks;                                      		// 0x0038 (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
};

// ScriptStruct GearboxFramework.BehaviorProviderDefinition.BehaviorOutputLinkData2
// 0x0008
struct FBehaviorOutputLinkData2
{
	int                                                LinkIdAndLinkedBehavior;                          		// 0x0000 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	float                                              ActivateDelay;                                    		// 0x0004 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
};

// ScriptStruct GearboxFramework.BehaviorProviderDefinition.BehaviorVariableLinkData2
// 0x0014
struct FBehaviorVariableLinkData2
{
	struct FName                                       PropertyName;                                     		// 0x0000 (0x0008) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	unsigned char                                      VariableLinkType;                                 		// 0x0008 (0x0001) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	unsigned char                                      ConnectionIndex;                                  		// 0x0009 (0x0001) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FSubarrayData                               LinkedVariables;                                  		// 0x000C (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	class UProperty*                                   CachedProperty;                                   		// 0x0010 (0x0004) [0x0000000000002000]              ( CPF_Transient )
};

// ScriptStruct GearboxFramework.BehaviorProviderDefinition.BehaviorSequenceData
// 0x0070
struct FBehaviorSequenceData
{
	struct FName                                       BehaviorSequenceName;                             		// 0x0000 (0x0008) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	unsigned long                                      bEnabledOnSpawn : 1;                              		// 0x0008 (0x0004) [0x0000000000000003] [0x00000001] ( CPF_Edit | CPF_Const )
	unsigned long                                      bSequenceEnabledMutex : 1;                        		// 0x0008 (0x0004) [0x0000000000000003] [0x00000002] ( CPF_Edit | CPF_Const )
	class UBehaviorSequenceCustomEnableCondition*      CustomEnableCondition;                            		// 0x000C (0x0004) [0x0000000004000003]              ( CPF_Edit | CPF_Const | CPF_EditInline )
	TArray< struct FBehaviorEventData >                EventData;                                        		// 0x0010 (0x000C) [0x0000000020620002]              ( CPF_Const | CPF_EditConst | CPF_NeedCtorLink | CPF_Deprecated )
	TArray< struct FBehaviorEventData2 >               EventData2;                                       		// 0x001C (0x000C) [0x0000000000620002]              ( CPF_Const | CPF_EditConst | CPF_NeedCtorLink )
	TArray< struct FBehaviorSequenceActionData >       BehaviorData;                                     		// 0x0028 (0x000C) [0x0000000020620002]              ( CPF_Const | CPF_EditConst | CPF_NeedCtorLink | CPF_Deprecated )
	TArray< struct FBehaviorSequenceActionData2 >      BehaviorData2;                                    		// 0x0034 (0x000C) [0x0000000000620002]              ( CPF_Const | CPF_EditConst | CPF_NeedCtorLink )
	TArray< struct FBehaviorVariableData >             VariableData;                                     		// 0x0040 (0x000C) [0x0000000000620002]              ( CPF_Const | CPF_EditConst | CPF_NeedCtorLink )
	TArray< struct FBehaviorOutputLinkData2 >          ConsolidatedOutputLinkData;                       		// 0x004C (0x000C) [0x0000000000620002]              ( CPF_Const | CPF_EditConst | CPF_NeedCtorLink )
	TArray< struct FBehaviorVariableLinkData2 >        ConsolidatedVariableLinkData;                     		// 0x0058 (0x000C) [0x0000000000620002]              ( CPF_Const | CPF_EditConst | CPF_NeedCtorLink )
	TArray< int >                                      ConsolidatedLinkedVariables;                      		// 0x0064 (0x000C) [0x0000000000620002]              ( CPF_Const | CPF_EditConst | CPF_NeedCtorLink )
};

// ScriptStruct GearboxFramework.AIDebugCamera.DebugListItem
// 0x0051
struct FDebugListItem
{
	unsigned char                                      DisplayType;                                      		// 0x0000 (0x0001) [0x0000000000100000]              
	struct FVector                                     Location;                                         		// 0x0004 (0x000C) [0x0000000000100000]              
	struct FVector                                     Location2;                                        		// 0x0010 (0x000C) [0x0000000000100000]              
	struct FVector                                     Location3;                                        		// 0x001C (0x000C) [0x0000000000100000]              
	class UTexture2D*                                  Texture;                                          		// 0x0028 (0x0004) [0x0000000000100000]              
	float                                              U;                                                		// 0x002C (0x0004) [0x0000000000100000]              
	float                                              V;                                                		// 0x0030 (0x0004) [0x0000000000100000]              
	float                                              UL;                                               		// 0x0034 (0x0004) [0x0000000000100000]              
	float                                              VL;                                               		// 0x0038 (0x0004) [0x0000000000100000]              
	float                                              Scale;                                            		// 0x003C (0x0004) [0x0000000000100000]              
	struct FString                                     TextString;                                       		// 0x0040 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FColor                                      TextColor;                                        		// 0x004C (0x0004) [0x0000000000100000]              
	unsigned char                                      Alignment;                                        		// 0x0050 (0x0001) [0x0000000000100000]              
};

// ScriptStruct GearboxFramework.IBehaviorConsumer.BehaviorConsumerHandle
// 0x0004
struct FBehaviorConsumerHandle
{
	int                                                PID;                                              		// 0x0000 (0x0004) [0x0000000000000000]              
};

// ScriptStruct GearboxFramework.AIFactoryBase.TimeStampedRecord
// 0x0004
struct FTimeStampedRecord
{
	float                                              DeathTimeStamp;                                   		// 0x0000 (0x0004) [0x0000000000000000]              
};

// ScriptStruct GearboxFramework.AIFactoryBase.KnowledgeRecordStruct
// 0x0005(0x0009 - 0x0004)
struct FKnowledgeRecordStruct : FTimeStampedRecord
{
	class UKnowledgeRecord*                            TheObj;                                           		// 0x0004 (0x0004) [0x0000000000000000]              
	unsigned char                                      InUse;                                            		// 0x0008 (0x0001) [0x0000000000000000]              
};

// ScriptStruct GearboxFramework.AIFactoryBase.RuleSetRecord
// 0x0005(0x0009 - 0x0004)
struct FRuleSetRecord : FTimeStampedRecord
{
	class URuleSet*                                    TheObj;                                           		// 0x0004 (0x0004) [0x0000000000000000]              
	unsigned char                                      InUse;                                            		// 0x0008 (0x0001) [0x0000000000000000]              
};

// ScriptStruct GearboxFramework.AIFactoryBase.RuleRecord
// 0x0005(0x0009 - 0x0004)
struct FRuleRecord : FTimeStampedRecord
{
	class URule*                                       TheObj;                                           		// 0x0004 (0x0004) [0x0000000000000000]              
	unsigned char                                      InUse;                                            		// 0x0008 (0x0001) [0x0000000000000000]              
};

// ScriptStruct GearboxFramework.AIFactoryBase.ActionSequenceRecord
// 0x0005(0x0009 - 0x0004)
struct FActionSequenceRecord : FTimeStampedRecord
{
	class UActionSequence*                             TheObj;                                           		// 0x0004 (0x0004) [0x0000000000000000]              
	unsigned char                                      InUse;                                            		// 0x0008 (0x0001) [0x0000000000000000]              
};

// ScriptStruct GearboxFramework.AIFactoryBase.TargetInfoRecord
// 0x0005(0x0009 - 0x0004)
struct FTargetInfoRecord : FTimeStampedRecord
{
	class UMindTargetInfo*                             TheObj;                                           		// 0x0004 (0x0004) [0x0000000000000000]              
	unsigned char                                      InUse;                                            		// 0x0008 (0x0001) [0x0000000000000000]              
};

// ScriptStruct GearboxFramework.AIFactoryBase.AIDefinitionRecord
// 0x0005(0x0009 - 0x0004)
struct FAIDefinitionRecord : FTimeStampedRecord
{
	class UAIDefinition*                               TheObj;                                           		// 0x0004 (0x0004) [0x0000000000000000]              
	unsigned char                                      InUse;                                            		// 0x0008 (0x0001) [0x0000000000000000]              
};

// ScriptStruct GearboxFramework.AIResource.AIResourceRestriction
// 0x000C
struct FAIResourceRestriction
{
	int                                                MaxUsers;                                         		// 0x0000 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	int                                                MinUsers;                                         		// 0x0004 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	class UAIResource*                                 Resource;                                         		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct GearboxFramework.GearboxEditorNode.OutputLink
// 0x000C
struct FOutputLink
{
	TArray< class UGearboxEditorNode* >                Links;                                            		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct GearboxFramework.GearboxEditorNode.VariableLink
// 0x000C
struct FVariableLink
{
	TArray< class UGearboxEditorNode* >                Links;                                            		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct GearboxFramework.SpecialMoveInterface.SpecialMoveData
// 0x001C
struct FSpecialMoveData
{
	class UObject*                                     Data;                                             		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              PlayRateScale;                                    		// 0x0004 (0x0004) [0x0000000000000000]              
	float                                              Duration;                                         		// 0x0008 (0x0004) [0x0000000000000000]              
	struct FName                                       CallbackName;                                     		// 0x000C (0x0008) [0x0000000000000000]              
	class UObject*                                     CallbackObject;                                   		// 0x0014 (0x0004) [0x0000000000000000]              
	class USpecialMoveDefinition*                      SMD;                                              		// 0x0018 (0x0004) [0x0000000000000000]              
};

// ScriptStruct GearboxFramework.AnimNodeSpecialMoveBlend.SlotAnimParameters
// 0x0044
struct FSlotAnimParameters
{
	struct FSpecialMoveData                            SMData;                                           		// 0x0000 (0x001C) [0x0000000000000000]              
	class UGearboxAnimDefinition*                      CustomAnimDef;                                    		// 0x001C (0x0004) [0x0000000000000000]              
	struct FName                                       CustomAnimName;                                   		// 0x0020 (0x0008) [0x0000000000000000]              
	TArray< float >                                    PerBoneWeights;                                   		// 0x0028 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< unsigned char >                            TransformReqBone;                                 		// 0x0034 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                TransformReqBoneIndex;                            		// 0x0040 (0x0004) [0x0000000000000000]              
};

// ScriptStruct GearboxFramework.IBehaviorProvider.SpecializedBehaviorEvent
// 0x0008
struct FSpecializedBehaviorEvent
{
	struct FName                                       EventName;                                        		// 0x0000 (0x0008) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
};

// ScriptStruct GearboxFramework.ITimerBehavior.BehaviorTimerState
// 0x000C
struct FBehaviorTimerState
{
	unsigned long                                      bIsRunning : 1;                                   		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              Delay;                                            		// 0x0004 (0x0004) [0x0000000000000000]              
	float                                              EventTime;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
};

// ScriptStruct GearboxFramework.ITimerBehavior.TimerEventReactionDataSpecialized
// 0x0000(0x0008 - 0x0008)
struct FTimerEventReactionDataSpecialized : FSpecializedBehaviorEvent
{
};

// ScriptStruct GearboxFramework.ITimerBehavior.TimerBehaviorUserState
// 0x0024
struct FTimerBehaviorUserState
{
	struct FBehaviorTimerState                         Timers[ 0x3 ];                                    		// 0x0000 (0x0024) [0x0000000000000000]              
};

// ScriptStruct GearboxFramework.ITimerBehavior.TimerEventReactionData
// 0x0010
struct FTimerEventReactionData
{
	unsigned char                                      EventType;                                        		// 0x0000 (0x0001) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	TArray< class UBehaviorBase* >                     Behaviors;                                        		// 0x0004 (0x000C) [0x0000000004400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink | CPF_EditInline )
};

// ScriptStruct GearboxFramework.GbxMessage.GbxMessageSimpleMetaData
// 0x001C
struct FGbxMessageSimpleMetaData
{
	float                                              FloatData;                                        		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                IntData;                                          		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       NameData;                                         		// 0x0008 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     VectorData;                                       		// 0x0010 (0x000C) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct GearboxFramework.BehaviorHelpers.RelativeDirectionData
// 0x0020
struct FRelativeDirectionData
{
	unsigned char                                      Direction;                                        		// 0x0000 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	struct FAttributeInitializationData                ConeAroundDirection;                              		// 0x0004 (0x0010) [0x0000000000000001]              ( CPF_Edit )
	struct FRotator                                    AdditionalRotation;                               		// 0x0014 (0x000C) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct GearboxFramework.BehaviorHelpers.AttachmentLocationData
// 0x001C
struct FAttachmentLocationData
{
	struct FVector                                     Location;                                         		// 0x0000 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	class UIWorldBody*                                 AttachmentBase;                                   		// 0x000C (0x0008) [0x0000000000000000]              
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x0010 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	struct FName                                       AttachmentName;                                   		// 0x0014 (0x0008) [0x0000000000000000]              
};

// ScriptStruct GearboxFramework.BehaviorKernel.ProviderRecord
// 0x0008
struct FProviderRecord
{
	class UBehaviorProviderDefinition*                 ProviderDefinition;                               		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                ReferenceCount;                                   		// 0x0004 (0x0004) [0x0000000000000000]              
};

// ScriptStruct GearboxFramework.BehaviorKernel.BehaviorExecutionRecord
// 0x001C
struct FBehaviorExecutionRecord
{
	int                                                OwningProcessID;                                  		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                ProvidersIndex;                                   		// 0x0004 (0x0004) [0x0000000000000000]              
	int                                                SequencesDataIndex;                               		// 0x0008 (0x0004) [0x0000000000000000]              
	int                                                BehaviorNumber;                                   		// 0x000C (0x0004) [0x0000000000000000]              
	struct FName                                       BehaviorName;                                     		// 0x0010 (0x0008) [0x0000000000000000]              
	float                                              TimeOfExecution;                                  		// 0x0018 (0x0004) [0x0000000000000000]              
};

// ScriptStruct GearboxFramework.BehaviorKernel.BehaviorThread
// 0x0018
struct FBehaviorThread
{
	unsigned char                                      ThreadState;                                      		// 0x0000 (0x0001) [0x0000000000000000]              
	int                                                OwningProcessID;                                  		// 0x0004 (0x0004) [0x0000000000000000]              
	struct FPointer                                    ThreadSequenceState;                              		// 0x0008 (0x0004) [0x0000000000001000]              ( CPF_Native )
	int                                                NextBehavior;                                     		// 0x000C (0x0004) [0x0000000000000000]              
	float                                              ActivateTime;                                     		// 0x0010 (0x0004) [0x0000000000000000]              
	float                                              BehaviorStartedTime;                              		// 0x0014 (0x0004) [0x0000000000000000]              
};

// ScriptStruct GearboxFramework.BehaviorKernel.BehaviorEventState
// 0x000C
struct FBehaviorEventState
{
	int                                                TriggerCount;                                     		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              LastTriggerTime;                                  		// 0x0004 (0x0004) [0x0000000000000000]              
	class UBehaviorEventFilterBase*                    FilterObject;                                     		// 0x0008 (0x0004) [0x0000000000000000]              
};

// ScriptStruct GearboxFramework.BehaviorKernel.BehaviorVariableState
// 0x0010
struct FBehaviorVariableState
{
	struct FName                                       Name;                                             		// 0x0000 (0x0008) [0x0000000000000000]              
	unsigned char                                      Type;                                             		// 0x0008 (0x0001) [0x0000000000000000]              
	struct FBehaviorVariableValueUnion_Mirror          Value;                                            		// 0x000C (0x0004) [0x0000000000801000]              ( CPF_Native | CPF_NoExport )
};

// ScriptStruct GearboxFramework.BehaviorKernel.BehaviorSequenceState
// 0x0018
struct FBehaviorSequenceState
{
	unsigned long                                      bIsEnabled : 1;                                   		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	int                                                ProvidersIndex;                                   		// 0x0004 (0x0004) [0x0000000000000000]              
	int                                                SequencesDataIndex;                               		// 0x0008 (0x0004) [0x0000000000000000]              
	int                                                SequenceEnabledBitIndex;                          		// 0x000C (0x0004) [0x0000000000000000]              
	struct FPointer                                    EventStateHead;                                   		// 0x0010 (0x0004) [0x0000000000001000]              ( CPF_Native )
	struct FPointer                                    VariableStateHead;                                		// 0x0014 (0x0004) [0x0000000000001000]              ( CPF_Native )
};

// ScriptStruct GearboxFramework.BehaviorKernel.BehaviorProcess
// 0x001C
struct FBehaviorProcess
{
	class UObject*                                     Owner;                                            		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                ProcessID;                                        		// 0x0004 (0x0004) [0x0000000000000000]              
	int                                                SequenceEnabledBitField;                          		// 0x0008 (0x0004) [0x0000000000000000]              
	unsigned char                                      ProcessState;                                     		// 0x000C (0x0001) [0x0000000000000000]              
	unsigned char                                      NextSequenceEnabledBitIndexToUse;                 		// 0x000D (0x0001) [0x0000000000000000]              
	unsigned char                                      bSupportsReplicatedSequenceState;                 		// 0x000E (0x0001) [0x0000000000000000]              
	unsigned char                                      NumPendingProviderRemovalRequests;                		// 0x000F (0x0001) [0x0000000000000000]              
	struct FChunkedList_Mirror                         Sequences;                                        		// 0x0010 (0x0004) [0x0000000000001000]              ( CPF_Native )
	struct FChunkedList_Mirror                         Events;                                           		// 0x0014 (0x0004) [0x0000000000001000]              ( CPF_Native )
	struct FChunkedList_Mirror                         Variables;                                        		// 0x0018 (0x0004) [0x0000000000001000]              ( CPF_Native )
};

// ScriptStruct GearboxFramework.BehaviorKernel.ProviderRemovalRequest
// 0x0008
struct FProviderRemovalRequest
{
	struct FBehaviorConsumerHandle                     ConsumerHandle;                                   		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                ProvidersIndex;                                   		// 0x0004 (0x0004) [0x0000000000000000]              
};

// ScriptStruct GearboxFramework.BehaviorKernel.BehaviorKernelArrayStats
// 0x0010
struct FBehaviorKernelArrayStats
{
	int                                                UsedSlots;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                UnusedSlots;                                      		// 0x0004 (0x0004) [0x0000000000000000]              
	int                                                PeakUsage;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
	int                                                ContainerSlack;                                   		// 0x000C (0x0004) [0x0000000000000000]              
};

// ScriptStruct GearboxFramework.BehaviorKernel.BehaviorKernelStats
// 0x0068
struct FBehaviorKernelStats
{
	int                                                NumProcessesCreated;                              		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                NumThreadsCreated;                                		// 0x0004 (0x0004) [0x0000000000000000]              
	int                                                NumWaitingThreads;                                		// 0x0008 (0x0004) [0x0000000000000000]              
	int                                                NumEventsActivated;                               		// 0x000C (0x0004) [0x0000000000000000]              
	int                                                NumEventsIgnored;                                 		// 0x0010 (0x0004) [0x0000000000000000]              
	int                                                NumBehaviorsRun;                                  		// 0x0014 (0x0004) [0x0000000000000000]              
	struct FBehaviorKernelArrayStats                   ProcessListStats;                                 		// 0x0018 (0x0010) [0x0000000000000000]              
	struct FBehaviorKernelArrayStats                   ProviderListStats;                                		// 0x0028 (0x0010) [0x0000000000000000]              
	struct FBehaviorKernelArrayStats                   ObjectVariablesListStats;                         		// 0x0038 (0x0010) [0x0000000000000000]              
	struct FBehaviorKernelArrayStats                   DynamicBehaviorsListStats;                        		// 0x0048 (0x0010) [0x0000000000000000]              
	int                                                ProvidersIndexFreeListLength;                     		// 0x0058 (0x0004) [0x0000000000000000]              
	int                                                ObjectVariablesFreeListLength;                    		// 0x005C (0x0004) [0x0000000000000000]              
	int                                                TotalMemoryUsed;                                  		// 0x0060 (0x0004) [0x0000000000000000]              
	int                                                MemoryUsedBySlack;                                		// 0x0064 (0x0004) [0x0000000000000000]              
};

// ScriptStruct GearboxFramework.IBehaviorConsumer.ReplicatedBehaviorConsumerState
// 0x000C
struct FReplicatedBehaviorConsumerState
{
	unsigned long                                      bIsProcessSuspended : 1;                          		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	int                                                BehaviorSequenceEnabledFlags;                     		// 0x0004 (0x0004) [0x0000000000000000]              
	unsigned long                                      bNeedToApplyThisState : 1;                        		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct GearboxFramework.IBehaviorConsumer.ReplicatedBehaviorEvent
// 0x0004
struct FReplicatedBehaviorEvent
{
	unsigned char                                      SequenceIndex;                                    		// 0x0000 (0x0001) [0x0000000000000000]              
	unsigned char                                      EventCounter;                                     		// 0x0001 (0x0001) [0x0000000000000000]              
	unsigned char                                      EventIndex;                                       		// 0x0002 (0x0001) [0x0000000000000000]              
	unsigned char                                      EventOutput;                                      		// 0x0003 (0x0001) [0x0000000000000000]              
};

// ScriptStruct GearboxFramework.BehaviorSequenceCustomEnableCondition.LinkedBehaviorSequence
// 0x0008
struct FLinkedBehaviorSequence
{
	struct FBehaviorConsumerHandle                     ConsumerHandle;                                   		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FPointer                                    SequenceState;                                    		// 0x0004 (0x0004) [0x0000000000001000]              ( CPF_Native )
};

// ScriptStruct GearboxFramework.CharacterClassMessageDefinition.BehaviorTriggerMessageStruct
// 0x0014
struct FBehaviorTriggerMessageStruct
{
	class UGbxMessageDefinition*                       MessageDefinition;                                		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      Instigator;                                       		// 0x0004 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      OtherEventParticipant;                            		// 0x0005 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	TArray< class UBehaviorBase* >                     Behaviors;                                        		// 0x0008 (0x000C) [0x0000000004400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink | CPF_EditInline )
};

// ScriptStruct GearboxFramework.ExposureUtilityBasicCaching.ExposureCacheStruct
// 0x0040
struct FExposureCacheStruct
{
	struct FName                                       FromPawnName;                                     		// 0x0000 (0x0008) [0x0000000000100000]              
	struct FName                                       ToActorName;                                      		// 0x0008 (0x0008) [0x0000000000100000]              
	float                                              TimeCached;                                       		// 0x0010 (0x0004) [0x0000000000100000]              
	float                                              NextUpdateTime;                                   		// 0x0014 (0x0004) [0x0000000000100000]              
	float                                              Exposure;                                         		// 0x0018 (0x0004) [0x0000000000100000]              
	struct FVector                                     FromLoc;                                          		// 0x001C (0x000C) [0x0000000000100000]              
	struct FVector                                     ToLoc;                                            		// 0x0028 (0x000C) [0x0000000000100000]              
	TArray< struct FVantageSpot >                      Vantage;                                          		// 0x0034 (0x000C) [0x0000000000502000]              ( CPF_Transient | CPF_NeedCtorLink )
};

// ScriptStruct GearboxFramework.ExposureUtilityFixedCost.ExposureUpdateStruct
// 0x001D
struct FExposureUpdateStruct
{
	class AGearboxPawn*                                FromPawn;                                         		// 0x0000 (0x0004) [0x0000000000100000]              
	class AActor*                                      ToActor;                                          		// 0x0004 (0x0004) [0x0000000000100000]              
	float                                              TimeRequested;                                    		// 0x0008 (0x0004) [0x0000000000100000]              
	float                                              Exposure;                                         		// 0x000C (0x0004) [0x0000000000100000]              
	TArray< struct FVantageSpot >                      Vantage;                                          		// 0x0010 (0x000C) [0x0000000000502000]              ( CPF_Transient | CPF_NeedCtorLink )
	unsigned char                                      ShouldRemove;                                     		// 0x001C (0x0001) [0x0000000000100000]              
};

// ScriptStruct GearboxFramework.ExposureUtilityFixedCost.BucketStruct
// 0x001C
struct FBucketStruct
{
	int                                                NdxToStartCheckFrom;                              		// 0x0000 (0x0004) [0x0000000000100000]              
	float                                              DistanceSquared;                                  		// 0x0004 (0x0004) [0x0000000000100000]              
	int                                                MaxLineChecksPerFrame;                            		// 0x0008 (0x0004) [0x0000000000100000]              
	int                                                MaxIterationsPerFrame;                            		// 0x000C (0x0004) [0x0000000000100000]              
	TArray< struct FExposureUpdateStruct >             Exposures;                                        		// 0x0010 (0x000C) [0x0000000000502000]              ( CPF_Transient | CPF_NeedCtorLink )
};

// ScriptStruct GearboxFramework.ExposureUtilityFixedCost.PointExposureData
// 0x0028
struct FPointExposureData
{
	class AActor*                                      Looker;                                           		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FVector                                     Point;                                            		// 0x0004 (0x000C) [0x0000000000000000]              
	struct FVector                                     Point2;                                           		// 0x0010 (0x000C) [0x0000000000000000]              
	float                                              Exposure;                                         		// 0x001C (0x0004) [0x0000000000000000]              
	float                                              LastCheckTime;                                    		// 0x0020 (0x0004) [0x0000000000000000]              
	float                                              LastUpdateTime;                                   		// 0x0024 (0x0004) [0x0000000000000000]              
};

// ScriptStruct GearboxFramework.FeatherBoneBlendDefinition.FeatherBoneBlendData
// 0x000C
