/*
#############################################################################################
# Borderlands 2 (1.0.35.4705) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Script Structs
# ========================================================================================= #
*/

// ScriptStruct WillowGame.AchievementUtility.AchievementUnlockData
// 0x0014
struct FAchievementUnlockData
{
	unsigned char                                      UnlockType;                                       		// 0x0000 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      Achievement;                                      		// 0x0001 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     StringData;                                       		// 0x0004 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	int                                                IntData;                                          		// 0x0010 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct WillowGame.WillowDamageTypeDefinition.PlayerRecentDamageEventData
// 0x0024
struct FPlayerRecentDamageEventData
{
	class UWillowDamageTypeDefinition*                 DamageTypeDefinition;                             		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FVector                                     DamageLocation;                                   		// 0x0004 (0x000C) [0x0000000000000000]              
	float                                              TotalDamageForDamageType;                         		// 0x0010 (0x0004) [0x0000000000000000]              
	unsigned char                                      DamageEventFlags;                                 		// 0x0014 (0x0001) [0x0000000000000000]              
	unsigned long                                      bDirty : 1;                                       		// 0x0018 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              DamageTime;                                       		// 0x001C (0x0004) [0x0000000000000000]              
	class AActor*                                      DamagedActor;                                     		// 0x0020 (0x0004) [0x0000000000000000]              
};

// ScriptStruct WillowGame.BodyClassDefinition.VehicleCrewMappingStruct
// 0x000C
struct FVehicleCrewMappingStruct
{
	struct FName                                       VehicleArchetypeName;                             		// 0x0000 (0x0008) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	class UAnimSet*                                    AnimSet;                                          		// 0x0008 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
};

// ScriptStruct WillowGame.BodyClassDefinition.InjuredLoopOverride
// 0x0008
struct FInjuredLoopOverride
{
	class UWillowDialogNameTag*                        NameTag;                                          		// 0x0000 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	class UAkEvent*                                    StartAkEvent;                                     		// 0x0004 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
};

// ScriptStruct WillowGame.BodyClassDefinition.BreathingLoopInfo
// 0x000C
struct FBreathingLoopInfo
{
	class UExpressionEvaluator*                        Condition;                                        		// 0x0000 (0x0004) [0x0000000004000003]              ( CPF_Edit | CPF_Const | CPF_EditInline )
	class UAkEvent*                                    StartAkEvent;                                     		// 0x0004 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	class UAkEvent*                                    StopAkEvent;                                      		// 0x0008 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
};

// ScriptStruct WillowGame.BodyClassDefinition.CustomCringeData
// 0x0014
struct FCustomCringeData
{
	unsigned long                                      bDOT : 1;                                         		// 0x0000 (0x0004) [0x0000000000000003] [0x00000001] ( CPF_Edit | CPF_Const )
	unsigned char                                      DamageType;                                       		// 0x0004 (0x0001) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	TArray< class USpecialMove_Cringe* >               Cringes;                                          		// 0x0008 (0x000C) [0x0000000004400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink | CPF_EditInline )
};

// ScriptStruct WillowGame.BodyClassDefinition.PainDialogLine
// 0x0028
struct FPainDialogLine
{
	class UGearboxDialogEventTag*                      DET_Pain;                                         		// 0x0000 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	float                                              DamageThresholdPct;                               		// 0x0004 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	float                                              ChanceToPlay;                                     		// 0x0008 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	class UAkEvent*                                    AkEvent;                                          		// 0x000C (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	unsigned long                                      bDeathSound : 1;                                  		// 0x0010 (0x0004) [0x0000000000000003] [0x00000001] ( CPF_Edit | CPF_Const )
	unsigned long                                      bCriticalHitSound : 1;                            		// 0x0010 (0x0004) [0x0000000000000003] [0x00000002] ( CPF_Edit | CPF_Const )
	unsigned long                                      bRanOverSound : 1;                                		// 0x0010 (0x0004) [0x0000000000000003] [0x00000004] ( CPF_Edit | CPF_Const )
	unsigned long                                      bGoreTechDeathSound : 1;                          		// 0x0010 (0x0004) [0x0000000000000003] [0x00000008] ( CPF_Edit | CPF_Const )
	unsigned char                                      FlinchAnimType;                                   		// 0x0014 (0x0001) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	float                                              FlinchImpulseStrength;                            		// 0x0018 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	TArray< class UBehaviorBase* >                     PainBehaviors;                                    		// 0x001C (0x000C) [0x0000000004400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink | CPF_EditInline )
};

// ScriptStruct WillowGame.BodyClassDefinition.ExtraWeaponSlot
// 0x0024
struct FExtraWeaponSlot
{
	struct FName                                       Socket;                                           		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      bShowWeaponMesh : 1;                              		// 0x0008 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	class USkeletalMeshComponent*                      Mesh;                                             		// 0x000C (0x0004) [0x0000000004082008]              ( CPF_ExportObject | CPF_Transient | CPF_Component | CPF_EditInline )
	class UParticleSystemComponent*                    MuzzleFlash;                                      		// 0x0010 (0x0004) [0x0000000004082008]              ( CPF_ExportObject | CPF_Transient | CPF_Component | CPF_EditInline )
	TArray< class UParticleSystemComponent* >          AltMuzzleFlashes;                                 		// 0x0014 (0x000C) [0x0000000004482008]              ( CPF_ExportObject | CPF_Transient | CPF_Component | CPF_NeedCtorLink | CPF_EditInline )
	class UWillowPointLight*                           MuzzleFlashLight;                                 		// 0x0020 (0x0004) [0x0000000004082008]              ( CPF_ExportObject | CPF_Transient | CPF_Component | CPF_EditInline )
};

// ScriptStruct WillowGame.BodyClassDefinition.TurnData
// 0x001C
struct FTurnData
{
	float                                              MinRepeatTime;                                    		// 0x0000 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	class USpecialMove_Turn*                           Left;                                             		// 0x0004 (0x0004) [0x0000000004000003]              ( CPF_Edit | CPF_Const | CPF_EditInline )
	class USpecialMove_Turn*                           Right;                                            		// 0x0008 (0x0004) [0x0000000004000003]              ( CPF_Edit | CPF_Const | CPF_EditInline )
	class USpecialMove_Turn*                           Left01;                                           		// 0x000C (0x0004) [0x0000000004000003]              ( CPF_Edit | CPF_Const | CPF_EditInline )
	class USpecialMove_Turn*                           Right01;                                          		// 0x0010 (0x0004) [0x0000000004000003]              ( CPF_Edit | CPF_Const | CPF_EditInline )
	class USpecialMove_Turn*                           Left02;                                           		// 0x0014 (0x0004) [0x0000000004000003]              ( CPF_Edit | CPF_Const | CPF_EditInline )
	class USpecialMove_Turn*                           Right02;                                          		// 0x0018 (0x0004) [0x0000000004000003]              ( CPF_Edit | CPF_Const | CPF_EditInline )
};

// ScriptStruct WillowGame.WillowAIComponent.CombatZone
// 0x0020
struct FCombatZone
{
	int                                                Index;                                            		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FBox                                        Bounds;                                           		// 0x0004 (0x001C) [0x0000000000000000]              
};

// ScriptStruct WillowGame.WillowAIComponent.CoverExposureData
// 0x0004
struct FCoverExposureData
{
	unsigned long                                      bExposedUp : 1;                                   		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bExposedLeft : 1;                                 		// 0x0000 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bExposedRight : 1;                                		// 0x0000 (0x0004) [0x0000000000000000] [0x00000004] 
};

// ScriptStruct WillowGame.WillowAIComponent.CombatPointDebugData
// 0x0014
struct FCombatPointDebugData
{
	unsigned long                                      bBest : 1;                                        		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              Score;                                            		// 0x0004 (0x0004) [0x0000000000000000]              
	struct FVector                                     Location;                                         		// 0x0008 (0x000C) [0x0000000000000000]              
};

// ScriptStruct WillowGame.WillowAIComponent.CombatPointData
// 0x0038
struct FCombatPointData
{
	int                                                Slot;                                             		// 0x0000 (0x0004) [0x0000000000020001]              ( CPF_Edit | CPF_EditConst )
	struct FVector                                     Location;                                         		// 0x0004 (0x000C) [0x0000000000020001]              ( CPF_Edit | CPF_EditConst )
	struct FActorReference                             Actor;                                            		// 0x0010 (0x0014) [0x0000000000020001]              ( CPF_Edit | CPF_EditConst )
	unsigned char                                      ConstraintType;                                   		// 0x0024 (0x0001) [0x0000000000020001]              ( CPF_Edit | CPF_EditConst )
	TArray< class UPopulationSpawnedActorTagDefinition* > ConstraintTags;                                   		// 0x0028 (0x000C) [0x0000000000420001]              ( CPF_Edit | CPF_EditConst | CPF_NeedCtorLink )
	unsigned long                                      bClaimed : 1;                                     		// 0x0034 (0x0004) [0x0000000000002000] [0x00000001] ( CPF_Transient )
};

// ScriptStruct WillowGame.WillowAIComponent.CombatZoneSearchData
// 0x0028
struct FCombatZoneSearchData
{
	float                                              ZoneMoveDist;                                     		// 0x0000 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FAIRange                                    ZoneTimeLimit;                                    		// 0x0004 (0x0008) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FAIRange                                    TargetRange;                                      		// 0x000C (0x0008) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	float                                              MinHeight;                                        		// 0x0014 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	unsigned long                                      bCanFail : 1;                                     		// 0x0018 (0x0004) [0x0000000000000003] [0x00000001] ( CPF_Edit | CPF_Const )
	unsigned char                                      LineOfSight;                                      		// 0x001C (0x0001) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FAIRange                                    LineOfSightTimeLimit;                             		// 0x0020 (0x0008) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
};

// ScriptStruct WillowGame.WillowAIComponent.CombatPointSearchData
// 0x0008(0x0030 - 0x0028)
struct FCombatPointSearchData : FCombatZoneSearchData
{
	unsigned long                                      bUseCover : 1;                                    		// 0x0028 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	float                                              PointRadius;                                      		// 0x002C (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct WillowGame.PerchDefinition.PerchAnimData
// 0x0010
struct FPerchAnimData
{
	class UPopulationBodyTag*                          Key;                                              		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class USpecialMove_Perch*                          StartAnim;                                        		// 0x0004 (0x0004) [0x0000000004000001]              ( CPF_Edit | CPF_EditInline )
	class USpecialMove_Perch*                          StopAnim;                                         		// 0x0008 (0x0004) [0x0000000004000001]              ( CPF_Edit | CPF_EditInline )
	class USpecialMove_PerchLoop*                      IdleAnim;                                         		// 0x000C (0x0004) [0x0000000004000001]              ( CPF_Edit | CPF_EditInline )
};

// ScriptStruct WillowGame.WillowAIPawn.WillowCoverState
// 0x0014
struct FWillowCoverState
{
	struct FName                                       Action;                                           		// 0x0000 (0x0008) [0x0000000000000000]              
	struct FCoverInfo                                  Cover;                                            		// 0x0008 (0x0008) [0x0000000000000000]              
	class UWillowCoverStanceDefinition*                Stance;                                           		// 0x0010 (0x0004) [0x0000000000000000]              
};

// ScriptStruct WillowGame.Action_Drive_Pursuit.EnemyBreadCrumbStruct
// 0x0010
struct FEnemyBreadCrumbStruct
{
	struct FVector                                     pos;                                              		// 0x0000 (0x000C) [0x0000000000000000]              
	class AWillowVehicleCombatArea*                    CombatArea;                                       		// 0x000C (0x0004) [0x0000000000000000]              
};

// ScriptStruct WillowGame.WillowAIPawn.SplineAnimPathData
// 0x0010
struct FSplineAnimPathData
{
	class ASplineActor*                                StartSpline;                                      		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FName                                       AnimSeqName;                                      		// 0x0004 (0x0008) [0x0000000000000000]              
	unsigned long                                      bReverse : 1;                                     		// 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct WillowGame.Behavior_AIThrowProjectileAtTarget.TrajectoryData
// 0x0020
struct FTrajectoryData
{
	float                                              Speed;                                            		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              AnglePct;                                         		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Angle;                                            		// 0x0008 (0x0004) [0x0000000000000000]              
	float                                              Error;                                            		// 0x000C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     Offset;                                           		// 0x0010 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	float                                              PredictDistMax;                                   		// 0x001C (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct WillowGame.WillowLightProjectileManager.BeamDamageData
// 0x0028
struct FBeamDamageData
{
	float                                              Momentum;                                         		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              Amount;                                           		// 0x0004 (0x0004) [0x0000000000000000]              
	float                                              Radius;                                           		// 0x0008 (0x0004) [0x0000000000000000]              
	class UClass*                                      Source;                                           		// 0x000C (0x0004) [0x0000000000000000]              
	class UDamageTypeDefinition*                       TypeDefinition;                                   		// 0x0010 (0x0004) [0x0000000000000000]              
	float                                              BarrelSourceTime;                                 		// 0x0014 (0x0004) [0x0000000000000000]              
	float                                              PlantSourceTime;                                  		// 0x0018 (0x0004) [0x0000000000000000]              
	class UIDamageCauser*                              DamageCauser;                                     		// 0x001C (0x0008) [0x0000000000000000]              
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x0020 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	unsigned long                                      bCanDamageFriendlies : 1;                         		// 0x0024 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct WillowGame.WillowLightProjectileManager.ServerBeamState
// 0x005C
struct FServerBeamState
{
	unsigned long                                      bDeleteMe : 1;                                    		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FBeamDamageData                             DamageData;                                       		// 0x0004 (0x0028) [0x0000000000000000]              
	class AController*                                 DamageInstigator;                                 		// 0x002C (0x0004) [0x0000000000000000]              
	float                                              StartTime;                                        		// 0x0030 (0x0004) [0x0000000000000000]              
	float                                              LockTime;                                         		// 0x0034 (0x0004) [0x0000000000000000]              
	float                                              NextTraceTime;                                    		// 0x0038 (0x0004) [0x0000000000000000]              
	float                                              BeamNetUpdateTime;                                		// 0x003C (0x0004) [0x0000000000000000]              
	float                                              LastDamageApplicationTime;                        		// 0x0040 (0x0004) [0x0000000000000000]              
	class AActor*                                      LastDamagedActor;                                 		// 0x0044 (0x0004) [0x0000000000000000]              
	float                                              NextRandomBoneTime;                               		// 0x0048 (0x0004) [0x0000000000000000]              
	int                                                ParentBeamIndex;                                  		// 0x004C (0x0004) [0x0000000000000000]              
	TArray< int >                                      ChildBeamsIndicies;                               		// 0x0050 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct WillowGame.WillowLightProjectileManager.BeamLocationData
// 0x0024
struct FBeamLocationData
{
	class AActor*                                      Actor;                                            		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FName                                       Socket;                                           		// 0x0004 (0x0008) [0x0000000000000000]              
	struct FVector                                     Offset;                                           		// 0x000C (0x000C) [0x0000000000000000]              
	unsigned long                                      bUseWeapon : 1;                                   		// 0x0018 (0x0004) [0x0000000000000000] [0x00000001] 
	class UIWorldBody*                                 WorldBody;                                        		// 0x001C (0x0008) [0x0000000000000000]              
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x0020 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
};

// ScriptStruct WillowGame.WillowLightProjectileManager.ReplicatedBeamState
// 0x005C
struct FReplicatedBeamState
{
	unsigned long                                      bEnabled : 1;                                     		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	class UFiringModeDefinition*                       FireDef;                                          		// 0x0004 (0x0004) [0x0000000000000000]              
	class UImpactDefinition*                           ImpactDefinition;                                 		// 0x0008 (0x0004) [0x0000000000000000]              
	unsigned long                                      bLocked : 1;                                      		// 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
	struct FBeamLocationData                           SourceData;                                       		// 0x0010 (0x0024) [0x0000000000000000]              
	struct FBeamLocationData                           TargetData;                                       		// 0x0034 (0x0024) [0x0000000000000000]              
	unsigned long                                      bPlayImpactAudio : 1;                             		// 0x0058 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct WillowGame.WillowLightProjectileManager.BeamState
// 0x0118
struct FBeamState
{
	int                                                BeamIndex;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FServerBeamState                            ServerOnlyState;                                  		// 0x0004 (0x005C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FReplicatedBeamState                        CoreBeamState;                                    		// 0x0060 (0x005C) [0x0000000000000000]              
	class UParticleSystemComponent*                    PartRef;                                          		// 0x00BC (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	struct FAkPlayingInfo                              BeamAudioInfo;                                    		// 0x00C0 (0x0008) [0x0000000000080000]              ( CPF_Component )
	struct FAkPlayingInfo                              BeamImpactAudioInfo;                              		// 0x00C8 (0x0008) [0x0000000000080000]              ( CPF_Component )
	struct FVector                                     CurrentStartPoint;                                		// 0x00D0 (0x000C) [0x0000000000000000]              
	struct FVector                                     CurrentEndPoint;                                  		// 0x00DC (0x000C) [0x0000000000000000]              
	struct FVector                                     CurrentStartTangent;                              		// 0x00E8 (0x000C) [0x0000000000000000]              
	struct FVector                                     CurrentEndTangent;                                		// 0x00F4 (0x000C) [0x0000000000000000]              
	struct FRotator                                    CurrentDirection;                                 		// 0x0100 (0x000C) [0x0000000000000000]              
	struct FVector                                     LastImpactLocation;                               		// 0x010C (0x000C) [0x0000000000000000]              
};

// ScriptStruct WillowGame.WillowLightProjectileManager.LightProjectile
// 0x0088
struct FLightProjectile
{
	unsigned long                                      bEnabled : 1;                                     		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bPendingAdd : 1;                                  		// 0x0000 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bNeedsConstantTrace : 1;                          		// 0x0000 (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      bStartParticleTracerAtWeapon : 1;                 		// 0x0000 (0x0004) [0x0000000000000000] [0x00000008] 
	unsigned long                                      bActorReflected : 1;                              		// 0x0000 (0x0004) [0x0000000000000000] [0x00000010] 
	unsigned long                                      bEnemyPenetrating : 1;                            		// 0x0000 (0x0004) [0x0000000000000000] [0x00000020] 
	unsigned long                                      bOvercharged : 1;                                 		// 0x0000 (0x0004) [0x0000000000000000] [0x00000040] 
	unsigned long                                      bRicochetTowardsEnemy : 1;                        		// 0x0000 (0x0004) [0x0000000000000000] [0x00000080] 
	unsigned long                                      bPenetrateUsingOriginalTraceDirection : 1;        		// 0x0000 (0x0004) [0x0000000000000000] [0x00000100] 
	struct FVector                                     Location;                                         		// 0x0004 (0x000C) [0x0000000000000000]              
	struct FVector                                     PartLocation;                                     		// 0x0010 (0x000C) [0x0000000000000000]              
	struct FVector                                     Velocity;                                         		// 0x001C (0x000C) [0x0000000000000000]              
	class UParticleSystemComponent*                    PartRef;                                          		// 0x0028 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	struct FAkPlayingInfo                              AudioRef;                                         		// 0x002C (0x0008) [0x0000000000080000]              ( CPF_Component )
	class UFiringModeDefinition*                       FireDef;                                          		// 0x0034 (0x0004) [0x0000000000000000]              
	float                                              StartTime;                                        		// 0x0038 (0x0004) [0x0000000000000000]              
	int                                                NumRicochets;                                     		// 0x003C (0x0004) [0x0000000000000000]              
	float                                              LastTraceTime;                                    		// 0x0040 (0x0004) [0x0000000000000000]              
	struct FVector                                     LastSafeTraceStartLocation;                       		// 0x0044 (0x000C) [0x0000000000000000]              
	class AActor*                                      LastHitActor;                                     		// 0x0050 (0x0004) [0x0000000000000000]              
	class APawn*                                       Instigator;                                       		// 0x0054 (0x0004) [0x0000000000000000]              
	float                                              Damage;                                           		// 0x0058 (0x0004) [0x0000000000000000]              
	int                                                FiringPatternIdx;                                 		// 0x005C (0x0004) [0x0000000000000000]              
	unsigned char                                      BulletFromClipType;                               		// 0x0060 (0x0001) [0x0000000000000000]              
	unsigned char                                      bHitWater;                                        		// 0x0061 (0x0001) [0x0000000000000000]              
	unsigned char                                      PenetrationCount;                                 		// 0x0062 (0x0001) [0x0000000000000000]              
	unsigned char                                      Id;                                               		// 0x0063 (0x0001) [0x0000000000000000]              
	struct FVector                                     StartTrace;                                       		// 0x0064 (0x000C) [0x0000000000000000]              
	struct FVector                                     EndTrace;                                         		// 0x0070 (0x000C) [0x0000000000000000]              
	struct FVector                                     OriginalStartTrace;                               		// 0x007C (0x000C) [0x0000000000000000]              
};

// ScriptStruct WillowGame.WillowLightProjectileManager.ReplicatedLightProjectile
// 0x0034
struct FReplicatedLightProjectile
{
	unsigned long                                      bEnabled : 1;                                     		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bStartParticleTracerAtWeapon : 1;                 		// 0x0000 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bActorReflected : 1;                              		// 0x0000 (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      bEnemyPenetrating : 1;                            		// 0x0000 (0x0004) [0x0000000000000000] [0x00000008] 
	unsigned long                                      bOvercharged : 1;                                 		// 0x0000 (0x0004) [0x0000000000000000] [0x00000010] 
	unsigned long                                      bRicochetTowardsEnemy : 1;                        		// 0x0000 (0x0004) [0x0000000000000000] [0x00000020] 
	unsigned char                                      Id;                                               		// 0x0004 (0x0001) [0x0000000000000000]              
	struct FVector                                     StartTrace;                                       		// 0x0008 (0x000C) [0x0000000000000000]              
	struct FVector                                     EndTrace;                                         		// 0x0014 (0x000C) [0x0000000000000000]              
	float                                              ReflectSpeed;                                     		// 0x0020 (0x0004) [0x0000000000000000]              
	class UFiringModeDefinition*                       FireDef;                                          		// 0x0024 (0x0004) [0x0000000000000000]              
	int                                                FiringPatternIdx;                                 		// 0x0028 (0x0004) [0x0000000000000000]              
	class APawn*                                       Instigator;                                       		// 0x002C (0x0004) [0x0000000000000000]              
	float                                              StartTime;                                        		// 0x0030 (0x0004) [0x0000000000000000]              
};

// ScriptStruct WillowGame.WillowLightProjectileManager.ReplicatedBeamEndPoints
// 0x0018
struct FReplicatedBeamEndPoints
{
	struct FVector                                     StartPoint;                                       		// 0x0000 (0x000C) [0x0000000000000000]              
	struct FVector                                     EndPoint;                                         		// 0x000C (0x000C) [0x0000000000000000]              
};

// ScriptStruct WillowGame.Action_SwoopAttack.SwoopAttackData
// 0x0008
struct FSwoopAttackData
{
	unsigned long                                      bTriggered : 1;                                   		// 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bCacheTargetLocation : 1;                         		// 0x0000 (0x0004) [0x0000000000000003] [0x00000002] ( CPF_Edit | CPF_Const )
	float                                              Distance;                                         		// 0x0004 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
};

// ScriptStruct WillowGame.ActionSkill.ActionSkillCustomEventReplicationData
// 0x000C
struct FActionSkillCustomEventReplicationData
{
	unsigned char                                      EventCountForReplication;                         		// 0x0000 (0x0001) [0x0000000000000000]              
	struct FName                                       EventName;                                        		// 0x0004 (0x0008) [0x0000000000000000]              
};

// ScriptStruct WillowGame.ActionSkill.CachedWeaponInfo
// 0x0028
struct FCachedWeaponInfo
{
	int                                                CachedClipSize;                                   		// 0x0000 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                CachedAmmoInClip;                                 		// 0x0004 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                CachedAmmoNotInClip;                              		// 0x0008 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	unsigned char                                      CachedWeaponIsReloading;                          		// 0x000C (0x0001) [0x0000000000002000]              ( CPF_Transient )
	struct FString                                     CachedWeaponType;                                 		// 0x0010 (0x000C) [0x0000000000402000]              ( CPF_Transient | CPF_NeedCtorLink )
	class USwfMovie*                                   CachedWeaponTypeDLCClip;                          		// 0x001C (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                IsReloadIconDisplayed;                            		// 0x0020 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                IsInteractionIconDisplayed;                       		// 0x0024 (0x0004) [0x0000000000002000]              ( CPF_Transient )
};

// ScriptStruct WillowGame.WillowBaseStats.WillowStatProperty
// 0x0034
struct FWillowStatProperty
{
	struct FName                                       Id;                                               		// 0x0000 (0x0008) [0x0000000000000000]              
	struct FSettingsData                               Data;                                             		// 0x0008 (0x000C) [0x0000000000000000]              
	struct FSettingsData                               MaxData;                                          		// 0x0014 (0x000C) [0x0000000000000000]              
	struct FSettingsData                               ChallengeBaseData;                                		// 0x0020 (0x000C) [0x0000000000000000]              
	int                                                OnlineId;                                         		// 0x002C (0x0004) [0x0000000000000000]              
	unsigned long                                      bSparkStatDirty : 1;                              		// 0x0030 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bSparkStatInFlight : 1;                           		// 0x0030 (0x0004) [0x0000000000000000] [0x00000002] 
};

// ScriptStruct WillowGame.WillowCharacterClassDefinition.AttributeCategory
// 0x0018
struct FAttributeCategory
{
	struct FString                                     Category;                                         		// 0x0000 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	TArray< struct FAttributeBaseValueData >           Attributes;                                       		// 0x000C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
};

// ScriptStruct WillowGame.WillowCharacterClassDefinition.DeathByWeaponStatID
// 0x000C
struct FDeathByWeaponStatID
{
	unsigned char                                      DamageCauserType;                                 		// 0x0000 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       StatId;                                           		// 0x0004 (0x0008) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct WillowGame.WillowCharacterClassDefinition.DeathByDamageTypeStatID
// 0x000C
struct FDeathByDamageTypeStatID
{
	unsigned char                                      DamageType;                                       		// 0x0000 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       StatId;                                           		// 0x0004 (0x0008) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct WillowGame.WillowCharacterClassDefinition.DeathByWeaponDamageStatID
// 0x000C
struct FDeathByWeaponDamageStatID
{
	unsigned char                                      DamageType;                                       		// 0x0000 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      DamageCauserType;                                 		// 0x0001 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       StatId;                                           		// 0x0004 (0x0008) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct WillowGame.InteractionIconDefinition.InteractionIconWithOverrides
// 0x0014
struct FInteractionIconWithOverrides
{
	class UInteractionIconDefinition*                  IconDef;                                          		// 0x0000 (0x0004) [0x0000000000000000]              
	class UInteractionIconDefinition*                  OverrideIconDef;                                  		// 0x0004 (0x0004) [0x0000000000000000]              
	unsigned long                                      bOverrideIcon : 1;                                		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bOverrideAction : 1;                              		// 0x0008 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bOverrideText : 1;                                		// 0x0008 (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned char                                      bCostsToUse;                                      		// 0x000C (0x0001) [0x0000000000000000]              
	unsigned char                                      CostsCurrencyType;                                		// 0x000D (0x0001) [0x0000000000000000]              
	int                                                CostsAmount;                                      		// 0x0010 (0x0004) [0x0000000000000000]              
};

// ScriptStruct WillowGame.WillowRadarManager.ServerDynamicRadarIconData
// 0x000C
struct FServerDynamicRadarIconData
{
	class UObject*                                     SourceObject;                                     		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              Duration;                                         		// 0x0004 (0x0004) [0x0000000000000000]              
	float                                              StartTime;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
};

// ScriptStruct WillowGame.WillowRadarManager.RemoteDynamicRadarIconData
// 0x0014
struct FRemoteDynamicRadarIconData
{
	unsigned char                                      IconType;                                         		// 0x0000 (0x0001) [0x0000000000000000]              
	struct FVector                                     Location;                                         		// 0x0004 (0x000C) [0x0000000000000000]              
	unsigned long                                      bActive : 1;                                      		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct WillowGame.AIPawnBalanceDefinition.AITransformedName
// 0x0018
struct FAITransformedName
{
	unsigned char                                      Type;                                             		// 0x0000 (0x0001) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FString                                     TransformedName;                                  		// 0x0004 (0x000C) [0x0000000000408003]              ( CPF_Edit | CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FName                                       TransformedKillStat;                              		// 0x0010 (0x0008) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
};

// ScriptStruct WillowGame.ItemPool.ItemPoolInfo
// 0x0014
struct FItemPoolInfo
{
	class UItemPoolDefinition*                         ItemPool;                                         		// 0x0000 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FAttributeInitializationData                PoolProbability;                                  		// 0x0004 (0x0010) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
};

// ScriptStruct WillowGame.AIPawnBalanceDefinition.AIPawnPlaythroughData
// 0x0050
struct FAIPawnPlaythroughData
{
	int                                                PlayThrough;                                      		// 0x0000 (0x0004) [0x0000000000020003]              ( CPF_Edit | CPF_Const | CPF_EditConst )
	struct FString                                     DisplayName;                                      		// 0x0004 (0x000C) [0x0000000000408003]              ( CPF_Edit | CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	TArray< struct FAITransformedName >                TransformedNames;                                 		// 0x0010 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	TArray< class UBehaviorBase* >                     OnSpawnCustomizations;                            		// 0x001C (0x000C) [0x0000000004400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink | CPF_EditInline )
	TArray< struct FAttributeBaseValueData >           AttributeStartingValues;                          		// 0x0028 (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
	TArray< class UItemPoolListDefinition* >           CustomItemPoolIncludedLists;                      		// 0x0034 (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
	TArray< struct FItemPoolInfo >                     CustomItemPoolList;                               		// 0x0040 (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
	class UMaterialInstance*                           MeshMaterial;                                     		// 0x004C (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
};

// ScriptStruct WillowGame.AIPawnBalanceDefinition.AIPawnGradeModifierData
// 0x0050
struct FAIPawnGradeModifierData
{
	class AWillowAIPawn*                               CustomAIPawnArchetype;                            		// 0x0000 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FString                                     DisplayName;                                      		// 0x0004 (0x000C) [0x0000000000408003]              ( CPF_Edit | CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	int                                                ExpLevel;                                         		// 0x0010 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	TArray< class UBehaviorBase* >                     OnSpawnCustomizations;                            		// 0x0014 (0x000C) [0x0000000004400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink | CPF_EditInline )
	TArray< struct FAttributeBaseValueData >           AttributeStartingValues;                          		// 0x0020 (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
	TArray< class UItemPoolListDefinition* >           CustomItemPoolIncludedLists;                      		// 0x002C (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
	TArray< struct FItemPoolInfo >                     CustomItemPoolList;                               		// 0x0038 (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
	TArray< struct FAITransformedName >                TransformedNames;                                 		// 0x0044 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
};

// ScriptStruct WillowGame.AIPawnBalanceDefinition.AIPawnGameStageGradeWeightData
// 0x0050(0x0078 - 0x0028)
struct FAIPawnGameStageGradeWeightData : FGameStageGradeWeightData
{
	struct FAIPawnGradeModifierData                    GradeModifiers;                                   		// 0x0028 (0x0050) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
};

// ScriptStruct WillowGame.WillowDeclarations.CellInfo
// 0x0020
struct FCellInfo
{
	struct FVector                                     AbsolutePosition;                                 		// 0x0000 (0x000C) [0x0000000000000000]              
	float                                              Width;                                            		// 0x000C (0x0004) [0x0000000000000000]              
	float                                              Height;                                           		// 0x0010 (0x0004) [0x0000000000000000]              
	struct FString                                     CellName;                                         		// 0x0014 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct WillowGame.WillowDeclarations.CellContentData
// 0x0010
struct FCellContentData
{
	class UTexture*                                    Tex;                                              		// 0x0000 (0x0004) [0x0000000000000000]              
	class UMeshComponent*                              Mesh;                                             		// 0x0004 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class AWillowInventory*                            Inv;                                              		// 0x0008 (0x0004) [0x0000000000000000]              
	int                                                ExtArrayIndex;                                    		// 0x000C (0x0004) [0x0000000000000000]              
};

// ScriptStruct WillowGame.WillowDeclarations.PanelInfo
// 0x0040
struct FPanelInfo
{
	struct FName                                       PanelName;                                        		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     PanelFocused;                                     		// 0x0008 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     PanelUnfocused;                                   		// 0x0014 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     PanelCompare;                                     		// 0x0020 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      PanelBackground;                                  		// 0x002C (0x0001) [0x0000000000000001]              ( CPF_Edit )
	int                                                CellWidth;                                        		// 0x0030 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                CellHeight;                                       		// 0x0034 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                TextureWidth;                                     		// 0x0038 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                TextureHeight;                                    		// 0x003C (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct WillowGame.WillowDeclarations.CardInfoRelativeToPanel
// 0x0018
struct FCardInfoRelativeToPanel
{
	struct FName                                       PanelName;                                        		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     ComparePosition;                                  		// 0x0008 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	float                                              CompareScale;                                     		// 0x0014 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct WillowGame.WillowDeclarations.CardInfo
// 0x003C
struct FCardInfo
{
	struct FName                                       CardName;                                         		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	int                                                CellWidth;                                        		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                CellHeight;                                       		// 0x000C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                TextureWidth;                                     		// 0x0010 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                TextureHeight;                                    		// 0x0014 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     MainPlayerLinkageName;                            		// 0x0018 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     SplitPlayerLinkageName;                           		// 0x0024 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	TArray< struct FCardInfoRelativeToPanel >          CompareSettings;                                  		// 0x0030 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
};

// ScriptStruct WillowGame.WillowWeaponTypes.WeaponAccessorySetup
// 0x001C
struct FWeaponAccessorySetup
{
	struct FName                                       WeaponArchetypeName;                              		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UGestaltSkeletalMeshDefinition*              AccessoryDefinition;                              		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UGestaltPartMatrices*                        AccessoryTransforms;                              		// 0x000C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	TArray< struct FGestaltPartPermutation >           AccessoryParts;                                   		// 0x0010 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
};

// ScriptStruct WillowGame.WillowWeaponTypes.WeaponDefinitionData
// 0x0044
struct FWeaponDefinitionData
{
	class UWeaponTypeDefinition*                       WeaponTypeDefinition;                             		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UInventoryBalanceDefinition*                 BalanceDefinition;                                		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UManufacturerDefinition*                     ManufacturerDefinition;                           		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                ManufacturerGradeIndex;                           		// 0x000C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UWeaponPartDefinition*                       BodyPartDefinition;                               		// 0x0010 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UWeaponPartDefinition*                       GripPartDefinition;                               		// 0x0014 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UWeaponPartDefinition*                       BarrelPartDefinition;                             		// 0x0018 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UWeaponPartDefinition*                       SightPartDefinition;                              		// 0x001C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UWeaponPartDefinition*                       StockPartDefinition;                              		// 0x0020 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UWeaponPartDefinition*                       ElementalPartDefinition;                          		// 0x0024 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UWeaponPartDefinition*                       Accessory1PartDefinition;                         		// 0x0028 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UWeaponPartDefinition*                       Accessory2PartDefinition;                         		// 0x002C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UWeaponPartDefinition*                       MaterialPartDefinition;                           		// 0x0030 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UWeaponNamePartDefinition*                   PrefixPartDefinition;                             		// 0x0034 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UWeaponNamePartDefinition*                   TitlePartDefinition;                              		// 0x0038 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                GameStage;                                        		// 0x003C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                UniqueId;                                         		// 0x0040 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct WillowGame.WillowItemTypes.ItemDefinitionData
// 0x0044
struct FItemDefinitionData
{
	class UItemDefinition*                             ItemDefinition;                                   		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UInventoryBalanceDefinition*                 BalanceDefinition;                                		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UManufacturerDefinition*                     ManufacturerDefinition;                           		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                ManufacturerGradeIndex;                           		// 0x000C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UItemPartDefinition*                         AlphaItemPartDefinition;                          		// 0x0010 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UItemPartDefinition*                         BetaItemPartDefinition;                           		// 0x0014 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UItemPartDefinition*                         GammaItemPartDefinition;                          		// 0x0018 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UItemPartDefinition*                         DeltaItemPartDefinition;                          		// 0x001C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UItemPartDefinition*                         EpsilonItemPartDefinition;                        		// 0x0020 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UItemPartDefinition*                         ZetaItemPartDefinition;                           		// 0x0024 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UItemPartDefinition*                         EtaItemPartDefinition;                            		// 0x0028 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UItemPartDefinition*                         ThetaItemPartDefinition;                          		// 0x002C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UItemPartDefinition*                         MaterialItemPartDefinition;                       		// 0x0030 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UItemNamePartDefinition*                     PrefixItemNamePartDefinition;                     		// 0x0034 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UItemNamePartDefinition*                     TitleItemNamePartDefinition;                      		// 0x0038 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                GameStage;                                        		// 0x003C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                UniqueId;                                         		// 0x0040 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct WillowGame.WillowDeclarations.PendingMissionRewardData
// 0x0118
struct FPendingMissionRewardData
{
	class UMissionDefinition*                          Mission;                                          		// 0x0000 (0x0004) [0x0000000000000000]              
